{
  "MP_DATABASE": "Καθορίστε το όνομα του τοπικού αρχείου βάσης δεδομένων για την αποθήκευση επίμονων δεδομένων. Το προκαθορισμένο είναι ένα τοπικό προσωρινό αρχείο το οποίο διαγράφεται αυτόματα κατά την έξοδο του Mailpit. Μπορείτε προαιρετικά να χρησιμοποιήσετε μια απομακρυσμένη βάση δεδομένων rqlite, καθορίζοντας μια \"διεύθυνση http\" (δείτε τα έγγραφα).",
  "MP_LABEL": "Ορίστε μια προαιρετική ετικέτα για τον προσδιορισμό αυτής της παρουσίας Mailpit. Αυτό προσθέτει την ετικέτα στους διακομιστές Web UI, SMTP και POP3.",
  "MP_TENANT_ID": "Ορίστε ένα αναγνωριστικό μισθωτή (πρόθεμα πίνακα). Αυτό χρησιμοποιείται για την απομόνωση των δεδομένων από άλλες περιπτώσεις Mailpit που μοιράζονται το ίδιο αρχείο δεδομένων (δείτε docs).",
  "MP_MAX_MESSAGES": "Μέγιστος αριθμός μηνυμάτων προς αποθήκευση. Το Mailpit θα διαγράφει περιοδικά τα παλαιότερα μηνύματα εάν είναι μεγαλύτερα από αυτό. Ορίστε το 0 για να απενεργοποιήσετε την αυτόματη διαγραφή (δείτε τα docs).",
  "MP_MAX_AGE": "Μέγιστη ηλικία των μηνυμάτων που αποθηκεύονται σε κάθε (ώρες) ή (η)ays. Το Mailpit θα διαγράφει περιοδικά τα παλαιότερα μηνύματα, εάν είναι μεγαλύτερα από αυτό. Η τιμή πρέπει να είναι είτε σε ώρες (Παράδειγμα: --max-age 36h) ή ημέρες (Παράδειγμα: --max-age 14d) (βλ. docs).",
  "MP_USE_MESSAGE_DATES": "Χρήση της ημερομηνίας & ώρας λήψης του μηνύματος ως ημερομηνία & ώρα λήψης του Mailpit αντί της ημερομηνίας & ώρας λήψης SMTP.",
  "MP_IGNORE_DUPLICATE_IDS": "Παράβλεψη διπλότυπων μηνυμάτων με βάση τα Id Μηνύματος.",
  "MP_LOG_FILE": "Καταγραφή εξόδου Mailpit σε αρχείο αντί για stdout. Παράδειγμα: --log-file /path/to/logfile.log",
  "MP_QUIET": "Ήσυχη καταγραφή (μόνο λάθη)",
  "MP_VERBOSE": "Λεπτομερής καταγραφή (αποσφαλμάτωση)",
  "MP_UI_BIND_ADDR": "Σύνδεση διεπαφής HTTP και θύρας για UI.",
  "MP_WEBROOT": "Ορίστε το webroot για web UI & API, για παράδειγμα mail θα έχει ως αποτέλεσμα http://0.0.0.0:8025/mail/.",
  "MP_UI_AUTH_FILE": "Καθορίστε ένα αρχείο κωδικού πρόσβασης για βασικό έλεγχο ταυτότητας UI & API ιστού (βλ. docs).",
  "MP_UI_TLS_CERT": "Πιστοποιητικό TLS για web UI & API (πχ: HTTPS). Αυτή η επιλογή απαιτεί τον ορισμό της μεταβλητής περιβάλλοντος --ui-tls-key ή MP_ UI_ TLS_ KEY",
  "MP_UI_TLS_KEY": "Το κλειδί TLS για το Web UI & API (δηλαδή: HTTPS). Αυτή η επιλογή απαιτεί τον ορισμό της μεταβλητής περιβάλλοντος --ui-tls-cert ή MP_ UI_ TLS_ CERT.",
  "MP_API_CORS": "Ορίστε API CORS Access-Control-Allow-Origin header αν χρειάζεστε cross-domain browser requests.",
  "MP_BLOCK_REMOTE_CSS_AND_FONTS": "Αποκλεισμός όλων των φυλλομετρητών πρόσβασης σε απομακρυσμένα CSS και γραμματοσειρές που εισάγονται μέσω φύλλων στυλ μηνυμάτων. Το Mailpit χρησιμοποιεί τη μέθοδο HTTP Content Security Policy (CSP) για να τις μπλοκάρει. Αυτό δεν αποκλείει απομακρυσμένες εικόνες ή κάνοντας κλικ στον εξωτερικό σύνδεσμο.",
  "MP_ENABLE_SPAMASSASSIN": "Ενεργοποίηση ενσωμάτωσης SpamAssassin για βαθμολογία spamminess (βλ. docs).",
  "MP_ALLOW_UNTRUSTED_TLS": "Μην επαληθεύετε τα πιστοποιητικά HTTPS για έλεγχο σύνδεσης και δημιουργία στιγμιότυπου οθόνης.",
  "MP_SMTP_BIND_ADDR": "Σύνδεση SMTP με διασύνδεση και θύρα.",
  "MP_SMTP_AUTH_FILE": "Καθορίστε ένα αρχείο κωδικού πρόσβασης για τον έλεγχο ταυτότητας SMTP (δείτε τα έγγραφα).",
  "MP_SMTP_AUTH_ACCEPT_ANY": "Αποδοχή οποιουδήποτε ονόματος χρήστη και κωδικού πρόσβασης SMTP, συμπεριλαμβανομένου και κανενός. Χρησιμοποιήστε αυτό για να επιτρέψετε ουσιαστικά οτιδήποτε.",
  "MP_SMTP_TLS_CERT": "Πιστοποιητικό TLS για SMTP STARTLS. Αυτή η επιλογή απαιτεί να οριστεί η μεταβλητή περιβάλλοντος --smtp-tls-key ή MP_SMTP_TLS_KEY.",
  "MP_SMTP_TLS_KEY": "TLS κλειδί για SMTP STARTLS. Αυτή η επιλογή απαιτεί τον ορισμό της μεταβλητής περιβάλλοντος --smtp-tls-cert ή MP_SMTP_TLS_CERT.",
  "MP_SMTP_REQUIRE_STARTTLS": "Απαιτείται από όλους τους πελάτες SMTP να χρησιμοποιούν κρυπτογράφηση STARTTLS. Εάν οριστεί σε true, οι μόνες επιτρεπόμενες εντολές είναι NOOP, EHLO, STARTTLS και QUIT (όπως καθορίζεται στο RFC 4954) έως ότου η σύνδεση αναβαθμιστεί στο STARTTLS.",
  "MP_SMTP_REQUIRE_TLS": "Απαιτείται από όλους τους πελάτες SMTP να χρησιμοποιούν κρυπτογράφηση SSL/TLS. Αν οριστεί σε true, όλες οι συνδέσεις με το διακομιστή SMTP πρέπει να αντιμετωπίζονται μέσω TLS. Αυτό είναι διαφορετικό από το STARTTLS το οποίο απαιτεί την μη κρυπτογράφηση της αρχικής σύνδεσης. Σημειώστε ότι αυτή η επιλογή απενεργοποιεί STARTTLS και μπορεί να μειώσει τη συμβατότητα του πελάτη.",
  "MP_SMTP_AUTH_ALLOW_INSECURE": "Συνήθως είτε το STARTTLS είτε το TLS επιβάλλεται έλεγχος ταυτότητας για όλες τις SMTP. Αυτή η επιλογή επιτρέπει τον ανασφαλή έλεγχο ταυτότητας PLAIN & LOGIN SMTP όταν χρησιμοποιείτε STARTTLS.",
  "MP_SMTP_STRICT_RFC_HEADERS": "Force Mailpit to return an SMTP error if message headers contain \\n instead to \\r\\n line breaks. By default Mailpit will silently fix incorrect line breaks generated by some broken sendmail clients (see related GitHub issue).",
  "MP_SMTP_MAX_RECIPIENTS": "Μέγιστος αριθμός αποδεκτών SMTP ανά μήνυμα.",
  "MP_SMTP_ALLOWED_RECIPIENTS": "Επιτρέπει μόνο τους παραλήπτες SMTP που ταιριάζουν με μια κανονική έκφραση. Χρησιμοποιήστε αυτό για να περιορίσετε τα εισερχόμενα μηνύματα μόνο σε όσους αποστέλλονται σε μια προκαθορισμένη λίστα. Ένα παράδειγμα θα ήταν το --smtp-allowed-παραλήπτες '{'@'}example.com$' για να επιτρέπονται μόνο τα μηνύματα που αποστέλλονται στους παραλήπτες που τελειώνουν στο {'@'}example.com.",
  "MP_SMTP_DISABLE_RDNS": "Απενεργοποίηση SMTP αντίστροφης αναζήτησης DNS. Το SMTP θα επιλύσει από προεπιλογή το όνομα κεντρικού υπολογιστή της διεύθυνσης IP του συνδεόμενου υπολογιστή-πελάτη, Ωστόσο, σε δοκιμαστικά δίκτυα, αυτό μπορεί μερικές φορές να είναι προβληματικό προκαλώντας καθυστερήσεις για κάθε παραδοθέν μήνυμα.",
  "MP_SMTP_RELAY_CONFIG": "Αρχείο ρυθμίσεων SMTP για να ενεργοποιήσετε το ρελέ/απελευθέρωση μηνυμάτων (βλ. docs). Εναλλακτικά, ολόκληρη η ρύθμιση παραμέτρων μπορεί να περάσει μέσω μεταβλητών περιβάλλοντος.",
  "MP_SMTP_RELAY_ALL": "Αυτόματη αναμετάδοση όλων των εισερχόμενων μηνυμάτων μέσω εξωτερικού διακομιστή SMTP (δείτε docs). Χρησιμοποιήστε το με εξαιρετική προσοχή!",
  "MP_SMTP_RELAY_MATCHING": "Αυτόματη αναμετάδοση μερικών εισερχόμενων μηνυμάτων σε αντιστοίχιση παραληπτών μέσω εξωτερικού διακομιστή SMTP (δείτε docs).",
  "MP_POP3_BIND_ADDR": "POP3 server δεσμεύουν τη διεπαφή και τη θύρα.",
  "MP_POP3_AUTH_FILE": "Καθορίστε ένα αρχείο κωδικού πρόσβασης για έλεγχο ταυτότητας POP3 (δείτε τα docs).",
  "MP_POP3_TLS_CERT": "Πιστοποιητικό TLS για το POP3 SSL/TLS. Αυτή η επιλογή απαιτεί να οριστεί η μεταβλητή περιβάλλοντος --pop3-tls-key ή MP_POP3_TLS_KEY.",
  "MP_POP3_TLS_KEY": "TLS κλειδί για POP3 SSL/TLS. Αυτή η επιλογή απαιτεί τον ορισμό της μεταβλητής περιβάλλοντος --pop3-tls-cert ή MP_POP3_TLS_CERT.",
  "MP_TAG": "Αυτόματη σήμανση νέων μηνυμάτων που ταιριάζουν με φίλτρα (δείτε docs).",
  "MP_TAGS_CONFIG": "Φόρτωση φίλτρων ετικετών από το αρχείο διαμόρφωσης yaml (δείτε τα docs).",
  "MP_TAGS_TITLE_CASE": "Επιβολή του TitleCasing για όλες τις νεοδημιουργημένες ετικέτες (δείτε τα docs).",
  "MP_TAGS_DISABLE": "Απενεργοποίηση συγκεκριμένης αυτόματης σήμανσης. Αυτή η επιλογή παίρνει μια λίστα επιλογών διαχωρισμένη με κόμματα (δείτε τα έγγραφα).",
  "MP_WEBHOOK_URL": "Καλέστε ένα webhook όταν λαμβάνονται νέα μηνύματα (βλ. docs). Παράδειγμα: --webhook-url https://example.com/webhook.php",
  "MP_WEBHOOK_LIMIT": "Βαθμολογήστε περιορισμένα αιτήματα webhook ανά δευτερόλεπτο. Για να αποφευχθεί η ενδεχόμενη υπερφόρτωση του διακομιστή webhook, αυτός είναι ο ρυθμός που περιορίζεται από προεπιλογή σε ένα μέγιστο 1 αίτημα ανά δευτερόλεπτο (δείτε docs)."
}
