{
  "working_dir": "Κατάλογος Εργασίας",
  "db_path": "Καθορίζει την τοποθεσία όπου θα δημιουργηθούν και θα ανακτηθούν αρχεία βάσης δεδομένων",
  "env": "Ρυθμίζει το περιβάλλον της παρουσίας. Η τιμή πρέπει να είναι είτε «παραγωγή» είτε «ανάπτυξη».",
  "http_addr": "Η διεύθυνση στην οποία θα ακούσει ο εξυπηρετητής HTTP.",
  "master_key": "Ορίζει το κύριο κλειδί της παρουσίας, προστατεύοντας αυτόματα όλες τις διαδρομές εκτός από το GET /health.",
  "no_analytics": "Απενεργοποιεί την ενσωματωμένη τηλεμετρία της Meilisearch όταν παρέχεται. Η\nMeilisearch συλλέγει αυτόματα δεδομένα από όλες τις περιπτώσεις που δεν εξαιρούνται με αυτή τη σημαία.\nΌλα τα συλλεγόμενα δεδομένα χρησιμοποιούνται αποκλειστικά για τη βελτίωση της Meilisearch, και μπορούν να διαγραφούν ανά πάσα στιγμή.",
  "http_payload_size_limit": "Ορίζει το μέγιστο μέγεθος αποδεκτών ωφέλιμων φορτίων.",
  "log_level": "Καθορίζει πόση λεπτομέρεια πρέπει να υπάρχει στα αρχεία καταγραφής του Meilisearch.\nΗ Meilisearch υποστηρίζει επί του παρόντος έξι επίπεδα καταγραφής, τα οποία παρατίθενται με σειρά αυξανόμενης προφορικότητας: `OFF`, `ERROR`, `WARN`, `INFO`, `DEBUG`, `TRACE`",
  "max_indexing_memory": "Ορίζει τη μέγιστη ποσότητα RAM Meilisearch που μπορεί να χρησιμοποιηθεί κατά την ευρετηρίαση.",
  "max_indexing_threads": "Ορίζει τον μέγιστο αριθμό νημάτων που μπορεί να χρησιμοποιήσει η Meilisearch κατά τη διάρκεια της ευρετηρίασης.",
  "dump_dir": "Ορίζει τον κατάλογο όπου η Meilisearch θα δημιουργήσει αρχεία αποτύπωσης.",
  "import_dump": "Εισάγει το αρχείο απόρριψης που βρίσκεται στην καθορισμένη διαδρομή. Η διαδρομή πρέπει να δείχνει σε ένα αρχείο .dump.",
  "ignore_missing_dump": "Εμποδίζει την Meilisearch να ρίξει ένα σφάλμα όταν το `import_dump` δεν δείχνει ένα έγκυρο αρχείο αποτύπωσης.",
  "ignore_dump_if_db_exists": "Αποτρέπει μια παρουσία Meilisearch με μια υπάρχουσα βάση δεδομένων από το να ρίξει ένα σφάλμα κατά τη χρήση `import_dump`.",
  "schedule_snapshot": "Ενεργοποιεί τα προγραμματισμένα στιγμιότυπα όταν είναι αληθές, απενεργοποιήστε όταν είναι ψευδές (η προεπιλογή).\nΑν η τιμή δίνεται ως ακέραιος αριθμός, Στη συνέχεια ενεργοποιείται το προγραμματισμένο στιγμιότυπο με την τιμή πέρασης ως το διάστημα μεταξύ κάθε στιγμιότυπου, σε δευτερόλεπτα.",
  "snapshot_dir": "Ορίζει τον κατάλογο όπου η Meilisearch θα αποθηκεύει στιγμιότυπα.",
  "import_snapshot": "Ξεκινά την Meilisearch μετά την εισαγωγή ενός στιγμιότυπου που δημιουργήθηκε στο δοσμένο filepath.",
  "ignore_missing_snapshot": "Αποτρέπει μια παρουσία Meilisearch από το να ρίξει ένα σφάλμα όταν το `import_snapshot` δεν δείχνει σε ένα έγκυρο αρχείο στιγμιότυπου στιγμιότυπου.",
  "ignore_snapshot_if_db_exists": "Αποτρέπει μια παρουσία Meilisearch με μια υπάρχουσα βάση δεδομένων από το να ρίξει ένα σφάλμα κατά τη χρήση `import_snapshot`.",
  "ssl_auth_path": "Ενεργοποιεί τον έλεγχο ταυτότητας πελάτη στην καθορισμένη διαδρομή.",
  "ssl_cert_path": "Ορίζει τα πιστοποιητικά SSL του διακομιστή.",
  "ssl_key_path": "Ορίζει τα αρχεία κλειδιού SSL του διακομιστή.",
  "ssl_ocsp_path": "Ορίζει το αρχείο OCSP του διακομιστή.",
  "ssl_require_auth": "Κάνει τον έλεγχο ταυτότητας SSL υποχρεωτικό.",
  "ssl_resumption": "Ενεργοποιεί τη συνέχιση της συνεδρίας SSL.",
  "ssl_tickets": "Ενεργοποιεί εισιτήρια SSL.",
  "experimental_enable_metrics": "Πειραματική λειτουργία μετρήσεων. Ενεργοποιεί τις μετρήσεις Prometheus στο τελικό σημείο «GET /metrics».",
  "experimental_reduce_indexing_memory_usage": "Πειραματική μείωση της RAM κατά τη διάρκεια της ευρετηρίασης, μην χρησιμοποιείτε στην παραγωγή.",
  "experimental_max_number_of_batched_tasks": "Πειραματικά μειώνει τον μέγιστο αριθμό εργασιών που θα υποβληθούν σε επεξεργασία ταυτόχρονα."
}
