{
  "MINIO_ADDRESS": "Δεσμεύει τη διεργασία του διακομιστή minio σε μια συγκεκριμένη διεύθυνση δικτύου και αριθμό θύρας.",
  "MINIO_CONSOLE_ADDRESS": "Καθορίζει μια στατική θύρα για την ενσωματωμένη κονσόλα MinIO.",
  "MINIO_CERTS_DIR": "Καθορίζει τη διαδρομή προς το φάκελο που περιέχει πιστοποιητικά που χρησιμοποιεί η διεργασία minio για τη ρύθμιση της σύνδεσης TLS/SSL.",
  "MINIO_ROOT_USER": "Ο χρήστης Root. Προεπιλογές του minioadmin",
  "MINIO_ROOT_PASSWORD": "Κωδικός χρήστη Root. Προεπιλογές στο minioadmin",
  "MINIO_SITE_NAME": "όνομα για το site π.χ. \"cal-rack0\"",
  "MINIO_SITE_REGION": "όνομα της τοποθεσίας του διακομιστή π.χ. \"us-west-1\"",
  "MINIO_SITE_COMMENT": "προαιρετικά προσθέστε ένα σχόλιο σε αυτήν τη ρύθμιση",
  "MINIO_STORAGE_CLASS_STANDARD": "όρισε τον αριθμό ισοτιμίας για την προεπιλεγμένη τυπική κλάση αποθήκευσης π.χ. \"EC:4\"",
  "MINIO_STORAGE_CLASS_RRS": "όρισε τον αριθμό ισοτιμίας για την κατηγορία μειωμένης εφεδρικής αποθήκευσης π.χ. \"EC:2\"",
  "MINIO_ETCD_ENDPOINTS": "λίστα διαχωρισμένη με κόμμα των τελικών σημείων etcd π.χ. \"http://localhost:2379\"",
  "MINIO_ETCD_PATH_PREFIX": "πρόθεμα χώρου ονομάτων για την απομόνωση ενοικιαστών π.χ. \"customer1/\"",
  "MINIO_API_REQUESTS_MAX": "ορισμός του μέγιστου αριθμού ταυτόχρονων αιτήσεων (προεπιλογή: 'αυτόματο')",
  "MINIO_API_CLUSTER_DEADLINE": "ορισμός της προθεσμίας ελέγχου ετοιμότητας συμπλέγματος (προεπιλογή: '10s')",
  "MINIO_API_CORS_ALLOW_ORIGIN": "ορισμός λίστας προέλευσης χωρισμένων με κόμμα επιτρεπόμενων αιτήσεων CORS (προεπιλογή: '*')",
  "MINIO_API_REMOTE_TRANSPORT_DEADLINE": "ορίστε την προθεσμία για αιτήσεις API σε απομακρυσμένες μεταφορές, ενώ βρίσκονται σε διακομιστή μεσολάβησης μεταξύ ομοσπονδιακών αποστολών, π.χ. \"2h\" (προεπιλογή: '2h')",
  "MINIO_API_LIST_QUORUM": "όρισε την αποδεκτή απαρτία που αναμένεται για λειτουργίες λίστας π.χ. \"βέλτιστη\", \"μειωμένη\", \"δίσκος\", \"αυστηρό\", \"αυτόματο\" (προεπιλογή: 'αυστηρό')",
  "MINIO_API_REPLICATION_PRIORITY": "ορισμός προτεραιότητας αντιγραφής (προεπιλογή: 'αυτόματο')",
  "MINIO_API_REPLICATION_MAX_WORKERS": "όρισε το μέγιστο αριθμό εργαζομένων αναπαραγωγής (προεπιλογή: '500')",
  "MINIO_API_TRANSITION_WORKERS": "όρισε τον αριθμό των εργαζομένων μετάβασης (προεπιλογή: '100')",
  "MINIO_API_STALE_UPLOADS_EXPIRY": "όρισε να λήξει παλιές πολυμερείς μεταφορτώσεις παλαιότερες από αυτές τις τιμές (προεπιλογή: '24h')",
  "MINIO_API_STALE_UPLOADS_CLEANUP_INTERVAL": "ορίστε να αλλάζετε χρονικά διαστήματα όταν έχουν λήξει οι καθυστερημένες πολυμερείς προσθήκες (προεπιλογή: '6h')",
  "MINIO_API_DELETE_CLEANUP_INTERVAL": "set to change intervals when deleted objects are permanently deleted from \".trash\" folder (default: '5m')",
  "MINIO_API_ODIRECT": "set to enable or disable O_DIRECT for writes under special conditions NOTE: do not disable O_DIRECT without prior testing (default: 'on')",
  "MINIO_API_ROOT_ACCESS": "απενεργοποιήστε την πρόσβαση root διαπιστευτηρίων για όλες τις κλήσεις API συμπεριλαμβανομένων των s3, λειτουργίες διαχειριστή (προεπιλογή: 'on')",
  "MINIO_API_SYNC_EVENTS": "ορίστε για να ενεργοποιήσετε συγχρονισμένες ειδοποιήσεις κάδου (προεπιλογή: 'off')",
  "MINIO_API_OBJECT_MAX_VERSIONS": "όρισε μέγιστο επιτρεπόμενο αριθμό εκδόσεων ανά αντικείμενο (προεπιλογή: '9223372036854775807')",
  "MINIO_BROWSER": "Ενεργοποιήστε ή απενεργοποιήστε την πρόσβαση σε διεπαφή ιστού κονσόλας. Από προεπιλογή έχει οριστεί σε 'on'",
  "MINIO_DOMAIN": "ενεργοποιήστε αιτήματα τύπου εικονικού υπολογιστή π.χ. \"mydomain.com\" ή πολλαπλούς τομείς με τιμές διαχωρισμένες με κόμμα π.χ. \"sub1.mydomain.com,sub2.mydomain.com\""
}
