{
  "MP_DATABASE": "Especifique o nome do arquivo do banco de dados local para armazenar dados persistentes. O padrão é um arquivo temporário local que é excluído automaticamente quando o Mailpit é encerrado. Você pode opcionalmente usar um banco de dados rqlite remoto especificando um 'endereço http' (veja a documentação).",
  "MP_LABEL": "Defina um rótulo opcional para identificar esta instância do Mailpit. Isso adiciona o rótulo à interface web, servidores SMTP e POP3.",
  "MP_TENANT_ID": "Defina um ID de locatário (prefixo de tabela). Isso é usado para isolar os dados de outras instâncias do Mailpit que compartilham o mesmo arquivo de dados (veja a documentação).",
  "MP_MAX_MESSAGES": "Número máximo de mensagens a serem armazenadas. O Mailpit irá periodicamente excluir as mensagens mais antigas se exceder esse valor. Defina como 0 para desativar a exclusão automática (veja a documentação).",
  "MP_MAX_AGE": "Idade máxima das mensagens a serem armazenadas em (h)oras ou (d)ias. O Mailpit irá periodicamente excluir as mensagens mais antigas se exceder esse valor. O valor deve ser em horas (Exemplo: --max-age 36h) ou dias (Exemplo: --max-age 14d) (veja a documentação).",
  "MP_USE_MESSAGE_DATES": "Usar a data do cabeçalho da mensagem como data/hora de recebimento no Mailpit em vez da data/hora recebida pelo SMTP.",
  "MP_IGNORE_DUPLICATE_IDS": "Ignorar mensagens duplicadas com base nos Message-Ids.",
  "MP_LOG_FILE": "Registrar a saída do Mailpit em arquivo ao invés do stdout. Exemplo: --log-file /caminho/para/logfile.log",
  "MP_QUIET": "Log silencioso (apenas erros)",
  "MP_VERBOSE": "Log detalhado (debug)",
  "MP_UI_BIND_ADDR": "Interface e porta HTTP para a UI.",
  "MP_WEBROOT": "Defina o webroot para a interface web e API, por exemplo mail resultará em http://0.0.0.0:8025/mail/.",
  "MP_UI_AUTH_FILE": "Especifique um arquivo de senha para autenticação básica da interface web e API (veja a documentação).",
  "MP_UI_TLS_CERT": "Certificado TLS para a interface web e API (HTTPS). Esta opção requer o argumento --ui-tls-key ou a variável de ambiente MP_UI_TLS_KEY.",
  "MP_UI_TLS_KEY": "Chave TLS para a interface web e API (HTTPS). Esta opção requer o argumento --ui-tls-cert ou a variável de ambiente MP_UI_TLS_CERT.",
  "MP_API_CORS": "Defina o cabeçalho API CORS Access-Control-Allow-Origin se precisar de requisições cross-domain do navegador.",
  "MP_BLOCK_REMOTE_CSS_AND_FONTS": "Bloqueia todo acesso do navegador a CSS e fontes remotas importadas via estilos das mensagens. O Mailpit usa a política de segurança de conteúdo HTTP (CSP) para bloquear isso. Não bloqueia imagens remotas ou cliques em links externos.",
  "MP_ENABLE_SPAMASSASSIN": "Habilita integração com SpamAssassin para pontuação de spam das mensagens (veja a documentação).",
  "MP_ALLOW_UNTRUSTED_TLS": "Não verifica certificados HTTPS para verificação de links e geração de capturas de tela.",
  "MP_SMTP_BIND_ADDR": "Interface e porta de escuta SMTP.",
  "MP_SMTP_AUTH_FILE": "Especifique um arquivo de senha para autenticação SMTP (veja a documentação).",
  "MP_SMTP_AUTH_ACCEPT_ANY": "Aceita qualquer nome de usuário e senha SMTP, inclusive nenhum. Use para basicamente permitir qualquer coisa.",
  "MP_SMTP_TLS_CERT": "Certificado TLS para SMTP STARTTLS. Esta opção requer o argumento --smtp-tls-key ou a variável de ambiente MP_SMTP_TLS_KEY.",
  "MP_SMTP_TLS_KEY": "Chave TLS para SMTP STARTTLS. Esta opção requer o argumento --smtp-tls-cert ou a variável de ambiente MP_SMTP_TLS_CERT.",
  "MP_SMTP_REQUIRE_STARTTLS": "Exige que todos os clientes SMTP usem criptografia STARTTLS. Se ativado, apenas os comandos NOOP, EHLO, STARTTLS e QUIT são permitidos (conforme RFC 4954) até a conexão ser atualizada para STARTTLS.",
  "MP_SMTP_REQUIRE_TLS": "Exige que todos os clientes SMTP usem criptografia SSL/TLS. Se ativado, todas as conexões ao servidor SMTP devem ser feitas via TLS. Isso é diferente do STARTTLS, que requer conexão inicial não criptografada. Note que esta opção desativa o STARTTLS e pode reduzir a compatibilidade de clientes.",
  "MP_SMTP_AUTH_ALLOW_INSECURE": "Normalmente STARTTLS ou TLS são exigidos para toda autenticação SMTP. Esta opção permite autenticação SMTP PLAIN & LOGIN insegura ao usar STARTTLS.",
  "MP_SMTP_STRICT_RFC_HEADERS": "Força o Mailpit a retornar erro SMTP se os cabeçalhos das mensagens contiverem \n ao invés de \r\n nas quebras de linha. Por padrão, o Mailpit corrige silenciosamente quebras de linha incorretas geradas por alguns clientes sendmail com problemas (veja o issue no GitHub).",
  "MP_SMTP_MAX_RECIPIENTS": "Número máximo de destinatários SMTP permitidos por mensagem.",
  "MP_SMTP_ALLOWED_RECIPIENTS": "Permite apenas destinatários SMTP que correspondam a uma expressão regular. Use para restringir o recebimento de e-mails apenas para uma lista pré-definida. Exemplo: --smtp-allowed-recipients '{'@'}example.com$' para permitir apenas e-mails enviados para destinatários terminando em {'@'}example.com.",
  "MP_SMTP_DISABLE_RDNS": "Desativa buscas reversas de DNS no SMTP. Por padrão, o SMTP tenta resolver o nome do host do IP do cliente, mas em redes de teste isso pode causar atrasos na entrega das mensagens.",
  "MP_SMTP_RELAY_CONFIG": "Arquivo de configuração SMTP para habilitar retransmissão/liberação de mensagens (veja a documentação). Alternativamente, toda a configuração pode ser passada via variáveis de ambiente.",
  "MP_SMTP_RELAY_ALL": "Retransmite automaticamente todas as mensagens recebidas via servidor SMTP externo (veja a documentação). Use com extremo cuidado!",
  "MP_SMTP_RELAY_MATCHING": "Retransmite automaticamente algumas mensagens recebidas para destinatários correspondentes via servidor SMTP externo (veja a documentação).",
  "MP_POP3_BIND_ADDR": "Interface e porta de escuta do servidor POP3.",
  "MP_POP3_AUTH_FILE": "Especifique um arquivo de senha para autenticação POP3 (veja a documentação).",
  "MP_POP3_TLS_CERT": "Certificado TLS para POP3 SSL/TLS. Esta opção requer o argumento --pop3-tls-key ou a variável de ambiente MP_POP3_TLS_KEY.",
  "MP_POP3_TLS_KEY": "Chave TLS para POP3 SSL/TLS. Esta opção requer o argumento --pop3-tls-cert ou a variável de ambiente MP_POP3_TLS_CERT.",
  "MP_TAG": "Auto-tag para novas mensagens que correspondam a filtros (veja a documentação).",
  "MP_TAGS_CONFIG": "Carrega filtros de tags a partir de arquivo de configuração yaml (veja a documentação).",
  "MP_TAGS_TITLE_CASE": "Força TitleCase para todas as novas tags criadas (veja a documentação).",
  "MP_TAGS_DISABLE": "Desativa auto-tagging específico. Esta opção aceita uma lista separada por vírgulas (veja a documentação).",
  "MP_WEBHOOK_URL": "Chama um webhook quando novas mensagens são recebidas (veja a documentação). Exemplo: --webhook-url https://example.com/webhook.php",
  "MP_WEBHOOK_LIMIT": "Limita a taxa de requisições webhook por segundo. Para evitar sobrecarga do servidor webhook, o padrão é limitar a 1 requisição por segundo (veja a documentação)."
}