{
  "MINIO_ADDRESS": "Vincula o processo do servidor minio a um endereço de rede e porta específicos.",
  "MINIO_CONSOLE_ADDRESS": "Especifica uma porta fixa para o Console MinIO embutido.",
  "MINIO_CERTS_DIR": "Especifica o caminho para a pasta que contém os certificados usados pelo processo minio para configurar a conectividade TLS/SSL.",
  "MINIO_ROOT_USER": "Usuário root. Padrão: minioadmin",
  "MINIO_ROOT_PASSWORD": "Senha do usuário root. Padrão: minioadmin",
  "MINIO_SITE_NAME": "nome para o site, ex: \"cal-rack0\"",
  "MINIO_SITE_REGION": "nome da localização do servidor, ex: \"us-west-1\"",
  "MINIO_SITE_COMMENT": "adicione opcionalmente um comentário para esta configuração",
  "MINIO_STORAGE_CLASS_STANDARD": "define a contagem de paridade para a classe de armazenamento padrão, ex: \"EC:4\"",
  "MINIO_STORAGE_CLASS_RRS": "define a contagem de paridade para a classe de armazenamento de redundância reduzida, ex: \"EC:2\"",
  "MINIO_ETCD_ENDPOINTS": "lista de endpoints etcd separados por vírgula, ex: \"http://localhost:2379\"",
  "MINIO_ETCD_PATH_PREFIX": "prefixo de namespace para isolar locatários, ex: \"customer1/\"",
  "MINIO_API_REQUESTS_MAX": "define o número máximo de requisições simultâneas (padrão: 'auto')",
  "MINIO_API_CLUSTER_DEADLINE": "define o tempo limite para verificação de prontidão do cluster (padrão: '10s')",
  "MINIO_API_CORS_ALLOW_ORIGIN": "define a lista de origens permitidas para requisições CORS, separadas por vírgula (padrão: '*')",
  "MINIO_API_REMOTE_TRANSPORT_DEADLINE": "define o tempo limite para requisições de API em transportes remotos ao fazer proxy entre instâncias federadas, ex: \"2h\" (padrão: '2h')",
  "MINIO_API_LIST_QUORUM": "define o quórum aceitável esperado para operações de listagem, ex: \"optimal\", \"reduced\", \"disk\", \"strict\", \"auto\" (padrão: 'strict')",
  "MINIO_API_REPLICATION_PRIORITY": "define a prioridade de replicação (padrão: 'auto')",
  "MINIO_API_REPLICATION_MAX_WORKERS": "define o número máximo de workers de replicação (padrão: '500')",
  "MINIO_API_TRANSITION_WORKERS": "define o número de workers de transição (padrão: '100')",
  "MINIO_API_STALE_UPLOADS_EXPIRY": "define o tempo para expirar uploads multipart antigos (padrão: '24h')",
  "MINIO_API_STALE_UPLOADS_CLEANUP_INTERVAL": "define o intervalo para expirar uploads multipart antigos (padrão: '6h')",
  "MINIO_API_DELETE_CLEANUP_INTERVAL": "define o intervalo para exclusão permanente de objetos apagados da pasta \".trash\" (padrão: '5m')",
  "MINIO_API_ODIRECT": "define para ativar ou desativar O_DIRECT para gravações em condições especiais. NOTA: não desative O_DIRECT sem testes prévios (padrão: 'on')",
  "MINIO_API_ROOT_ACCESS": "desativa o acesso root para todas as chamadas de API, incluindo s3 e operações administrativas (padrão: 'on')",
  "MINIO_API_SYNC_EVENTS": "define para ativar notificações síncronas de bucket (padrão: 'off')",
  "MINIO_API_OBJECT_MAX_VERSIONS": "define o número máximo de versões permitidas por objeto (padrão: '9223372036854775807')",
  "MINIO_BROWSER": "Ativa ou desativa o acesso à interface web do console. Por padrão está ativado ('on')",
  "MINIO_DOMAIN": "ativa requisições no estilo virtual-host, ex: \"mydomain.com\" ou múltiplos domínios separados por vírgula, ex: \"sub1.mydomain.com,sub2.mydomain.com\""
}