{
  "MP_DATABASE": "Specificați numele bazei de date locale pentru a stoca date persistente. Implicit este un fișier temporar local care este șters automat la ieșirea Mailpit. Opţional puteţi utiliza o bază de date rqlite de la distanţă specificând o \"adresă http\" (vezi documentele).",
  "MP_LABEL": "Setați o etichetă opțională pentru a identifica această instanță a Mailpit. Aceasta adaugă eticheta la serverele web UI, SMTP și POP3.",
  "MP_TENANT_ID": "Setaţi un ID locatar (prefix tabel). Acesta este folosit pentru a izola datele de la alte instanţe Mailpit partajând acelaşi fişier de date (vezi documentele). (Automatic Translation)",
  "MP_MAX_MESSAGES": "Numărul maxim de mesaje de stocat. Mailpit va șterge periodic cele mai vechi mesaje dacă sunt mai mari. Setat la 0 pentru a dezactiva ștergerea automată (vezi documentele).",
  "MP_MAX_AGE": "Vârsta maximă a mesajelor pentru a stoca în (ore) sau (d)ays. Mailpit va șterge periodic mesajele cele mai vechi dacă acestea sunt mai mari. Valoarea trebuie să fie în ore (exemplu: --max-age 36 ore) sau zile (Exemplu: --max-age 14 d) (vezi documentele).",
  "MP_USE_MESSAGE_DATES": "Folosește data antetului mesajului ca Mailpit recepționat data și ora în loc de data și ora recepționate prin SMTP.",
  "MP_IGNORE_DUPLICATE_IDS": "Ignoră mesajele duplicate bazate pe ID-urile mesajelor.",
  "MP_LOG_FILE": "Log Mailpit ieșire în fișier în loc de stdout. Exemplu: --log-file /path/to/logfile.log",
  "MP_QUIET": "Jurnalizare liniştită (doar erori)",
  "MP_VERBOSE": "Înregistrare verbose (depanare)",
  "MP_UI_BIND_ADDR": "Interfață de legare HTTP și port pentru UI.",
  "MP_WEBROOT": "Setați webroot pentru web UI & API, de exemplu e-mailul va duce la http://0.0.0.0:8025/mail/.",
  "MP_UI_AUTH_FILE": "Specificați un fișier parolă pentru UI web și API de autentificare de bază (vezi documentele).",
  "MP_UI_TLS_CERT": "Certificat TLS pentru web UI & API (ie: HTTPS). Această opțiune necesită --ui-tls-key argument sau variabila MP_UI_TLS_KEY environment pentru a fi setată.",
  "MP_UI_TLS_KEY": "TLS key for web UI & API (ie: HTTPS). Această opţiune necesită argumentul --ui-tls-cert sau variabila MP_UI_TLS_CERT environment pentru a fi setată.",
  "MP_API_CORS": "Setați antetul API CORS Access-Control-Allow-Origin dacă aveți nevoie de cereri de navigare cross-domain",
  "MP_BLOCK_REMOTE_CSS_AND_FONTS": "Blochează accesul browser-ului la CSS și fonturi importate prin intermediul stilurilor mesajelor. Mailpit folosește metoda HTTP Content Security Policy (CSP) pentru a le bloca. Aceasta nu blochează imaginile de la distanță sau dă click pe link-ul extern.",
  "MP_ENABLE_SPAMASSASSIN": "Activează integrarea SpamAssassin pentru a trimite mesaje cu scorul (vezi documentele).",
  "MP_ALLOW_UNTRUSTED_TLS": "Nu verifica certificatele HTTPS pentru verificarea link-urilor și generarea capturii de ecran.",
  "MP_SMTP_BIND_ADDR": "Interfaţă de legare SMTP şi port.",
  "MP_SMTP_AUTH_FILE": "Specificați un fișier parolă pentru autentificarea SMTP (vezi documentele).",
  "MP_SMTP_AUTH_ACCEPT_ANY": "Acceptaţi orice nume de utilizator SMTP şi parolă, inclusiv niciunul. Utilizaţi acest lucru pentru a permite practic orice.",
  "MP_SMTP_TLS_CERT": "Certificat TLS pentru SMTP STARTTLS. Această opţiune necesită --smtp-tls-key argument sau MP_SMTP_TLS_KEY environment variabilă pentru a fi setată.",
  "MP_SMTP_TLS_KEY": "TLS key for SMTP STARTTLS. This option requires the --smtp-tls-cert argument or MP_SMTP_TLS_CERT environment variable to be setat.",
  "MP_SMTP_REQUIRE_STARTTLS": "Necesita toti clientii SMTP sa foloseasca criptarea STARTTLS. Dacă este setat adevărat, numai comenzile permise sunt NOOP, EHLO, STARTTLS și QUIT (după cum se specifică în RFC 4954) până când conexiunea este îmbunătățită la STARTTLS.",
  "MP_SMTP_REQUIRE_TLS": "Solicitați tuturor clienților SMTP să utilizeze criptarea SSL/TLS. Dacă este setat pe adevărat, toate conexiunile către serverul SMTP trebuie să fie gestionate prin TLS. Acest lucru este diferit de STARTTLS care necesită ca conexiunea iniţială să fie necriptată. Reţineţi că această opţiune dezactivează STARTTLS şi poate reduce compatibilitatea cu clienţii.",
  "MP_SMTP_AUTH_ALLOW_INSECURE": "De obicei, fie STARTTLS, fie TLS este executat pentru toate autentificările SMTP. Această opţiune permite autentificarea SMTP insigură atunci când se utilizează STARTTLS.",
  "MP_SMTP_STRICT_RFC_HEADERS": "Forțează Mailpit să returneze o eroare SMTP în cazul în care antetele mesajelor conțin \\n în schimb la linia \\r\\n întrerupe. În mod implicit, Mailpit va repara în mod silențios întreruperile de linie generate de unii clienți sendmail (a se vedea problema GitHub aferentă).",
  "MP_SMTP_MAX_RECIPIENTS": "Numărul maxim de destinatari SMTP permis pe mesaj.",
  "MP_SMTP_ALLOWED_RECIPIENTS": "Permiteți doar destinatarilor SMTP care se potrivesc cu o expresie regulată. Utilizați acest lucru pentru a restricționa primirea de mesaje doar la cei trimiși într-o listă predefinită. Un exemplu ar fi --smtp recipiente '{'@'}example.com$' pentru a permite doar e-mailuri trimise destinatarilor care se termină în {'@'}example.com.",
  "MP_SMTP_DISABLE_RDNS": "Dezactivează căutările DNS invers SMTP. SMTP în mod implicit va încerca să rezolve numele gazdei adresei IP a clientului de legătură, Cu toate acestea, în reţelele de testare, acest lucru poate fi uneori problematic, provocând întârzieri pentru fiecare mesaj transmis.",
  "MP_SMTP_RELAY_CONFIG": "Fişierul de configurare SMTP pentru a activa transmisia/eliberarea mesajelor (vezi documentele). Alternativ, întreaga configuraţie poate fi transmisă prin variabilele de mediu.",
  "MP_SMTP_RELAY_ALL": "Redirecționează automat toate mesajele primite prin serverul SMTP extern (a se vedea documentele). Utilizați cu extremă prudență!",
  "MP_SMTP_RELAY_MATCHING": "Redirecționează automat unele mesaje primite către destinatarii care se potrivesc cu serverul SMTP extern (vezi documentele).",
  "MP_POP3_BIND_ADDR": "Serverul POP3 leagă interfața și portul.",
  "MP_POP3_AUTH_FILE": "Specificați un fișier cu parolă pentru autentificarea POP3 (vezi documentele).",
  "MP_POP3_TLS_CERT": "Certificat TLS pentru POP3 SSL/TLS. Această opțiune necesită setarea variabilei de mediu --pop3-tls-key sau MP_POP3_TLS_KEY",
  "MP_POP3_TLS_KEY": "TLS key for POP3 SSL/TLS. This option requires the --pop3-tls-cert argument or MP_POP3_TLS_CERT environment variable to be setat.",
  "MP_TAG": "Filtre pentru afișarea automată a mesajelor noi care se potrivesc (vezi documentele).",
  "MP_TAGS_CONFIG": "Încărcați filtrele de etichete din fișierul de configurare yaml (vezi documentele).",
  "MP_TAGS_TITLE_CASE": "Își permite TitleCasing pentru toate etichetele nou create (vezi documentele).",
  "MP_TAGS_DISABLE": "Dezactivați marcarea automată specifică. Această opțiune ia o listă de opțiuni separate prin virgulă (vezi documentele).",
  "MP_WEBHOOK_URL": "Apelaţi un webhook atunci când primiţi mesaje noi (vezi documentele). Exemplu: --webhook-url https://example.com/webhook.php",
  "MP_WEBHOOK_LIMIT": "Evaluați cereri webhook limitate pe secundă. Pentru a preveni posibila supraîncărcare a serverului webhook, această rată este limitată în mod implicit la maxim 1 cerere pe secundă (vezi documentele)."
}
