{
  "working_dir": "Director de lucru",
  "db_path": "Desemnează locația în care vor fi create și preluate fișierele bazei de date",
  "env": "Configurează mediul de instanţă. Valoarea trebuie să fie fie \"producţie\" sau \"dezvoltare\".",
  "http_addr": "Adresa pe care serverul HTTP o va asculta.",
  "master_key": "Setează cheia principală a instanței, protejând automat toate rutele cu excepția GET /health.",
  "no_analytics": "Dezactivează telemetria încorporată a lui Meilisearch, atunci când este furnizată.\nMeilisτ colectează automat date din toate cazurile care nu optează pentru folosirea acestui steag.\nToate datele colectate sunt utilizate exclusiv în scopul îmbunătățirii Meilisearch, și pot fi șterse în orice moment.",
  "http_payload_size_limit": "Setează dimensiunea maximă a încărcăturilor acceptate.",
  "log_level": "Definește cât de multe detalii ar trebui să fie prezente în jurnalele Meilisearch.\nMeilisitab, momentan, acceptă şase niveluri de jurnale, listate în ordinea creşterii verbositului: `OFF`, `ERROR`, `WARN`, `INFO`, `DEBUG`, `TRACE`",
  "max_indexing_memory": "Setează cantitatea maximă de RAM Meilisτ poate fi utilizată la indexare.",
  "max_indexing_threads": "Setează numărul maxim de fire pe care Meilisτ le poate utiliza în timpul indexării.",
  "dump_dir": "Setează directorul în care Meilis· va crea fișiere de copiere.",
  "import_dump": "Importați fișierul de depanare localizat la calea specificată. Calea trebuie să indice către un fișier .dump.",
  "ignore_missing_dump": "Previne Meilis·de la aruncarea unei erori atunci când `import_dump` nu indică un fișier de dumping valid.",
  "ignore_dump_if_db_exists": "Previne ca un Meilisinstance cu o bază de date existentă să arunce o eroare atunci când folosește `import_dump`.",
  "schedule_snapshot": "Activează imaginile programate când este adevărat, dezactivează când este fals (implicit).\nDacă valoarea este dată ca un număr întreg, apoi activează instantaneul programat cu valoarea pasată ca intervalul dintre fiecare imagine, în secunde.",
  "snapshot_dir": "Setează directorul unde Meilisτ va stoca instantanei.",
  "import_snapshot": "Lansează Meilis· după ce importă un instantaneu generat anterior la fișierul dat.",
  "ignore_missing_snapshot": "Împiedică o instanță de la aruncarea unei erori atunci când `import_snapshot` nu indică un fișier de imagine valid.",
  "ignore_snapshot_if_db_exists": "Previne ca un Meilisinstance cu o bază de date existentă să arunce o eroare atunci când se folosește `import_snapshot`.",
  "ssl_auth_path": "Activează autentificarea clientului în calea specificată.",
  "ssl_cert_path": "Setează certificatele SSL ale serverului.",
  "ssl_key_path": "Setează fișierele cheie SSL ale serverului.",
  "ssl_ocsp_path": "Setează fișierul OCSP al serverului.",
  "ssl_require_auth": "Face obligatorie autentificarea SSL.",
  "ssl_resumption": "Activează reluarea sesiunii SSL.",
  "ssl_tickets": "Activează bilete SSL.",
  "experimental_enable_metrics": "Caracteristica măsurătorilor experimentale. Permite măsurătorile Prometheus pe criteriul final `GET /trics`.",
  "experimental_reduce_indexing_memory_usage": "Reducerea experimentală a RAM în timpul indexării, nu se utilizează în producție.",
  "experimental_max_number_of_batched_tasks": "Reduce experimental numărul maxim de sarcini care vor fi procesate simultan."
}
