{
  "MINIO_ADDRESS": "Asociază procesul de minio server cu o anumită adresă de rețea și număr de port.",
  "MINIO_CONSOLE_ADDRESS": "Specifică un port static pentru consola MinIO încorporată.",
  "MINIO_CERTS_DIR": "Specifică calea către dosarul care conține certificate procesul minio utilizează pentru configurarea conexiunii TLS/SSL.",
  "MINIO_ROOT_USER": "Utilizator rădăcină. Implicit la minioadmin",
  "MINIO_ROOT_PASSWORD": "Parolă utilizator rădăcin. Implicit la minioadmin",
  "MINIO_SITE_NAME": "nume pentru site ex. \"cal-rack0\"",
  "MINIO_SITE_REGION": "numele locației serverului, de exemplu \"us-vest-1\"",
  "MINIO_SITE_COMMENT": "opțional adaugă un comentariu la această setare",
  "MINIO_STORAGE_CLASS_STANDARD": "setează paritatea pentru clasa standard de stocare implicită, de ex. \"EC:4\"",
  "MINIO_STORAGE_CLASS_RRS": "setează numărul parității pentru clasa de stocare redusă de concedieri, de ex. \"EC:2\"",
  "MINIO_ETCD_ENDPOINTS": "lista de criterii finale etcd, separate prin virgulă, de ex. \"http://localhost:2379\"",
  "MINIO_ETCD_PATH_PREFIX": "prefixul spațiului de nume pentru izolarea locatarilor de ex. \"client1/\"",
  "MINIO_API_REQUESTS_MAX": "setează numărul maxim de cereri simultane (implicit: 'auto')",
  "MINIO_API_CLUSTER_DEADLINE": "a stabilit termenul pentru verificarea disponibilității clusterelor (implicit: '10s')",
  "MINIO_API_CORS_ALLOW_ORIGIN": "setează lista de origini separate prin virgulă permisă pentru cererile CORS (implicit: '*')",
  "MINIO_API_REMOTE_TRANSPORT_DEADLINE": "a stabilit termenul pentru cererile API privind transporturile la distanță în timp ce se face proxy între instanțe federate, de ex. \"2h\" (implicit: '2h')",
  "MINIO_API_LIST_QUORUM": "setează cvorumul acceptabil așteptat pentru operațiunile de listă, de ex. \"optimal\", \"redus\", \"disk\", \"strict\", \"auto\" (implicit: 'strict')",
  "MINIO_API_REPLICATION_PRIORITY": "setează prioritatea de replicare (implicit: 'auto')",
  "MINIO_API_REPLICATION_MAX_WORKERS": "setează numărul maxim de lucrători de replicare (implicit: '500')",
  "MINIO_API_TRANSITION_WORKERS": "a stabilit numărul de lucrători în tranziție (implicit: '100')",
  "MINIO_API_STALE_UPLOADS_EXPIRY": "setat să expire încărcările mai vechi decât aceste valori (implicit: '24h')",
  "MINIO_API_STALE_UPLOADS_CLEANUP_INTERVAL": "setat pentru a schimba intervalele atunci când sunt expirate încărcări multiple vechi (implicit: '6h')",
  "MINIO_API_DELETE_CLEANUP_INTERVAL": "setat pentru a schimba intervalele când obiectele șterse sunt șterse permanent din folderul \".trash\" (implicit: '5m')",
  "MINIO_API_ODIRECT": "setați pentru a activa sau dezactiva O_DIRECT pentru scrieri în condiții speciale. NOTĂ: nu dezactivați O_DIRECT fără testare anterioară (implicit: 'on')",
  "MINIO_API_ROOT_ACCESS": "dezactivează accesul root de acreditări pentru toate apelurile API, inclusiv s3, operațiunile de admin (implicit: 'on')",
  "MINIO_API_SYNC_EVENTS": "setează pentru a activa notificările sincron cu găleată (implicit: 'off')",
  "MINIO_API_OBJECT_MAX_VERSIONS": "setează numărul maxim permis de versiuni per obiect (implicit: '9223372036854775807')",
  "MINIO_BROWSER": "Activează sau dezactivează accesul la interfața web a consolei. Implicit este setat ca \"pornit\"",
  "MINIO_DOMAIN": "activează cererile de stil virtual-host, de ex. \"mydomain.com\" sau mai multe domenii cu valori separate prin virgulă ex. \"sub1.mydomain.com,sub2.mydomain.com\""
}
