{
  "MP_DATABASE": "Specifica il nome del file del database locale per memorizzare i dati in modo persistente. Il valore predefinito è un file temporaneo locale che viene eliminato automaticamente all'uscita di Mailpit. Puoi anche usare un database remoto rqlite specificando un “indirizzo http” (vedi documentazione).",
  "MP_LABEL": "Imposta un'etichetta opzionale per identificare questa istanza di Mailpit. Verrà mostrata nell’interfaccia web, nei server SMTP e POP3.",
  "MP_TENANT_ID": "Imposta un ID tenant (prefisso tabella). Serve a isolare i dati tra istanze Mailpit che condividono lo stesso file di dati (vedi documentazione).",
  "MP_MAX_MESSAGES": "Numero massimo di messaggi da memorizzare. Mailpit eliminerà periodicamente i messaggi più vecchi se si supera il limite. Imposta a 0 per disattivare l'eliminazione automatica (vedi documentazione).",
  "MP_MAX_AGE": "Età massima dei messaggi da conservare in (h) ore o (d) giorni. Mailpit eliminerà periodicamente i messaggi più vecchi se si supera il limite. Esempi validi: --max-age 36h o --max-age 14d (vedi documentazione).",
  "MP_USE_MESSAGE_DATES": "Usa la data dell’intestazione del messaggio come data/ora di ricezione invece di quella registrata da SMTP.",
  "MP_IGNORE_DUPLICATE_IDS": "Ignora messaggi duplicati in base al Message-ID.",
  "MP_LOG_FILE": "Scrive l’output di Mailpit su file invece che su stdout. Esempio: --log-file /percorso/file.log",
  "MP_QUIET": "Log silenzioso (solo errori)",
  "MP_VERBOSE": "Log dettagliato (debug)",
  "MP_UI_BIND_ADDR": "Interfaccia e porta di binding HTTP per l’interfaccia web.",
  "MP_WEBROOT": "Imposta il percorso webroot per l'interfaccia e l’API. Esempio: 'mail' diventa http://0.0.0.0:8025/mail/",
  "MP_UI_AUTH_FILE": "Specifica un file delle password per l'autenticazione basic dell'interfaccia e API (vedi documentazione).",
  "MP_UI_TLS_CERT": "Certificato TLS per interfaccia web e API (HTTPS). Richiede l’argomento --ui-tls-key o la variabile MP_UI_TLS_KEY.",
  "MP_UI_TLS_KEY": "Chiave TLS per interfaccia web e API (HTTPS). Richiede l’argomento --ui-tls-cert o la variabile MP_UI_TLS_CERT.",
  "MP_API_CORS": "Imposta l'intestazione CORS 'Access-Control-Allow-Origin' per consentire richieste cross-domain da browser.",
  "MP_BLOCK_REMOTE_CSS_AND_FONTS": "Blocca l'accesso a CSS e font remoti importati tramite fogli di stile nei messaggi. Usa la politica di sicurezza dei contenuti (CSP) HTTP. Non blocca immagini remote né i link esterni.",
  "MP_ENABLE_SPAMASSASSIN": "Abilita l’integrazione con SpamAssassin per il punteggio spam dei messaggi (vedi documentazione).",
  "MP_ALLOW_UNTRUSTED_TLS": "Non verifica i certificati HTTPS per link checker e generazione screenshot.",
  "MP_SMTP_BIND_ADDR": "Interfaccia e porta di binding per il server SMTP.",
  "MP_SMTP_AUTH_FILE": "Specifica un file delle password per l'autenticazione SMTP (vedi documentazione).",
  "MP_SMTP_AUTH_ACCEPT_ANY": "Accetta qualsiasi username/password SMTP, anche nessuna. Utile per test aperti.",
  "MP_SMTP_TLS_CERT": "Certificato TLS per STARTTLS SMTP. Richiede --smtp-tls-key o MP_SMTP_TLS_KEY.",
  "MP_SMTP_TLS_KEY": "Chiave TLS per STARTTLS SMTP. Richiede --smtp-tls-cert o MP_SMTP_TLS_CERT.",
  "MP_SMTP_REQUIRE_STARTTLS": "Richiede che tutti i client SMTP usino STARTTLS. Finché la connessione non è aggiornata, sono ammessi solo i comandi NOOP, EHLO, STARTTLS e QUIT (RFC 4954).",
  "MP_SMTP_REQUIRE_TLS": "Richiede che tutti i client SMTP usino solo connessioni su SSL/TLS (diverso da STARTTLS). Disabilita STARTTLS e potrebbe ridurre la compatibilità.",
  "MP_SMTP_AUTH_ALLOW_INSECURE": "Consente autenticazione SMTP PLAIN & LOGIN anche non sicura (solo se si usa STARTTLS).",
  "MP_SMTP_STRICT_RFC_HEADERS": "Forza Mailpit a restituire errore SMTP se le intestazioni contengono \\n anziché \\r\\n. Per default Mailpit le corregge in silenzio.",
  "MP_SMTP_MAX_RECIPIENTS": "Numero massimo di destinatari SMTP per messaggio.",
  "MP_SMTP_ALLOWED_RECIPIENTS": "Consente solo destinatari SMTP che corrispondono a una regex. Es: --smtp-allowed-recipients '{'@'}example.com$' per accettare solo mail verso @example.com.",
  "MP_SMTP_DISABLE_RDNS": "Disabilita il reverse DNS nel server SMTP. Utile in reti di test dove può causare ritardi.",
  "MP_SMTP_RELAY_CONFIG": "File di configurazione SMTP per inoltro/rilascio dei messaggi (vedi documentazione). Alternativamente configurabile via variabili d’ambiente.",
  "MP_SMTP_RELAY_ALL": "Inoltra automaticamente tutti i messaggi in entrata tramite server SMTP esterno (vedi documentazione). Usare con cautela!",
  "MP_SMTP_RELAY_MATCHING": "Inoltra automaticamente messaggi in entrata a destinatari corrispondenti tramite server SMTP esterno (vedi documentazione).",
  "MP_POP3_BIND_ADDR": "Interfaccia e porta di binding per il server POP3.",
  "MP_POP3_AUTH_FILE": "Specifica un file delle password per l'autenticazione POP3 (vedi documentazione).",
  "MP_POP3_TLS_CERT": "Certificato TLS per POP3 SSL/TLS. Richiede --pop3-tls-key o MP_POP3_TLS_KEY.",
  "MP_POP3_TLS_KEY": "Chiave TLS per POP3 SSL/TLS. Richiede --pop3-tls-cert o MP_POP3_TLS_CERT.",
  "MP_TAG": "Tag automatici per nuovi messaggi in base a filtri (vedi documentazione).",
  "MP_TAGS_CONFIG": "Carica filtri tag da file di configurazione YAML (vedi documentazione).",
  "MP_TAGS_TITLE_CASE": "Applica automaticamente il formato TitleCase ai nuovi tag creati (vedi documentazione).",
  "MP_TAGS_DISABLE": "Disabilita specifici tag automatici. Accetta elenco separato da virgole (vedi documentazione).",
  "MP_WEBHOOK_URL": "Chiama un webhook all’arrivo di nuovi messaggi (vedi documentazione). Esempio: --webhook-url https://example.com/webhook.php",
  "MP_WEBHOOK_LIMIT": "Limita il numero di richieste webhook al secondo (default: 1/s) per evitare sovraccarico del server webhook (vedi documentazione)."
}
