{
  "working_dir": "Cartella di lavoro",
  "db_path": "Specifica la posizione in cui verranno creati e recuperati i file del database",
  "env": "Configura l'ambiente dell'istanza. Il valore deve essere `production` oppure `development`.",
  "http_addr": "Indirizzo su cui il server HTTP sarà in ascolto.",
  "master_key": "Imposta la chiave principale dell'istanza, proteggendo automaticamente tutte le rotte tranne GET /health.",
  "no_analytics": "Disattiva la telemetria integrata di Meilisearch se impostato.\nMeilisearch raccoglie automaticamente dati dalle istanze che non disattivano questa opzione.\nTutti i dati raccolti servono esclusivamente a migliorare Meilisearch e possono essere eliminati in qualsiasi momento.",
  "http_payload_size_limit": "Imposta la dimensione massima dei payload accettati.",
  "log_level": "Definisce il livello di dettaglio dei log di Meilisearch.\nI livelli supportati (in ordine crescente di verbosità) sono: `OFF`, `ERROR`, `WARN`, `INFO`, `DEBUG`, `TRACE`.",
  "max_indexing_memory": "Imposta la quantità massima di RAM che Meilisearch può usare durante l’indicizzazione.",
  "max_indexing_threads": "Imposta il numero massimo di thread utilizzabili durante l’indicizzazione.",
  "dump_dir": "Imposta la cartella dove Meilisearch salverà i file di dump.",
  "import_dump": "Importa un file di dump presente nel percorso specificato. Il percorso deve puntare a un file con estensione .dump.",
  "ignore_missing_dump": "Evita che Meilisearch generi errori se `import_dump` non punta a un file di dump valido.",
  "ignore_dump_if_db_exists": "Evita errori se si utilizza `import_dump` su un’istanza con database già esistente.",
  "schedule_snapshot": "Abilita gli snapshot pianificati se impostato su true (default: disabilitato).\nSe impostato come intero, abilita gli snapshot a intervalli (in secondi) pari al valore indicato.",
  "snapshot_dir": "Imposta la cartella in cui Meilisearch salverà gli snapshot.",
  "import_snapshot": "Avvia Meilisearch dopo aver importato uno snapshot precedentemente generato dal percorso indicato.",
  "ignore_missing_snapshot": "Evita errori se `import_snapshot` non punta a un file snapshot valido.",
  "ignore_snapshot_if_db_exists": "Evita errori se si utilizza `import_snapshot` su un’istanza con database già esistente.",
  "ssl_auth_path": "Abilita l'autenticazione del client nella cartella specificata.",
  "ssl_cert_path": "Imposta il certificato SSL del server.",
  "ssl_key_path": "Imposta il file della chiave SSL del server.",
  "ssl_ocsp_path": "Imposta il file OCSP del server.",
  "ssl_require_auth": "Rende obbligatoria l'autenticazione SSL.",
  "ssl_resumption": "Attiva la ripresa della sessione SSL.",
  "ssl_tickets": "Attiva i ticket SSL.",
  "experimental_enable_metrics": "Funzionalità sperimentale: abilita le metriche Prometheus sull’endpoint `GET /metrics`.",
  "experimental_reduce_indexing_memory_usage": "Riduzione sperimentale dell'uso di RAM durante l’indicizzazione. Non usare in produzione.",
  "experimental_max_number_of_batched_tasks": "Riduce sperimentalmente il numero massimo di task che vengono processati contemporaneamente."
}
