{
  "MINIO_ADDRESS": "Associa il processo MinIO a un indirizzo di rete e porta specifici.",
  "MINIO_CONSOLE_ADDRESS": "Specifica una porta statica per la Console integrata di MinIO.",
  "MINIO_CERTS_DIR": "Specifica il percorso alla cartella contenente i certificati utilizzati da MinIO per configurare la connettività TLS/SSL.",
  "MINIO_ROOT_USER": "Utente root. Predefinito: minioadmin",
  "MINIO_ROOT_PASSWORD": "Password dell'utente root. Predefinita: minioadmin",
  "MINIO_SITE_NAME": "Nome del sito, es: \"cal-rack0\"",
  "MINIO_SITE_REGION": "Nome della regione del server, es: \"us-west-1\"",
  "MINIO_SITE_COMMENT": "Aggiungi opzionalmente un commento a questa configurazione",
  "MINIO_STORAGE_CLASS_STANDARD": "Imposta il numero di parità per lo storage standard predefinito, es: \"EC:4\"",
  "MINIO_STORAGE_CLASS_RRS": "Imposta il numero di parità per lo storage a ridotta ridondanza, es: \"EC:2\"",
  "MINIO_STORAGE_CLASS_COMMENT": "Aggiungi opzionalmente un commento a questa configurazione",
  "MINIO_ETCD_ENDPOINTS": "Lista separata da virgole degli endpoint etcd, es: \"http://localhost:2379\"",
  "MINIO_ETCD_PATH_PREFIX": "Prefisso namespace per isolare i tenant, es: \"customer1/\"",
  "MINIO_ETCD_COREDNS_PATH": "Record DNS per bucket condivisi, predefinito: \"/skydns\"",
  "MINIO_ETCD_CLIENT_CERT": "Certificato client per autenticazione mTLS",
  "MINIO_ETCD_CLIENT_CERT_KEY": "Chiave del certificato client per autenticazione mTLS",
  "MINIO_ETCD_COMMENT": "Aggiungi opzionalmente un commento a questa configurazione",
  "MINIO_API_REQUESTS_MAX": "Imposta il numero massimo di richieste concorrenti (predefinito: 'auto')",
  "MINIO_API_CLUSTER_DEADLINE": "Imposta la scadenza per il controllo di disponibilità del cluster (predefinito: '10s')",
  "MINIO_API_CORS_ALLOW_ORIGIN": "Imposta una lista separata da virgole di origini consentite per le richieste CORS (predefinito: '*')",
  "MINIO_API_REMOTE_TRANSPORT_DEADLINE": "Imposta la scadenza per le richieste API su trasporti remoti durante il proxying tra istanze federate, es: \"2h\" (predefinito: '2h')",
  "MINIO_API_LIST_QUORUM": "Imposta il quorum accettabile per le operazioni di elenco, es: \"optimal\", \"reduced\", \"disk\", \"strict\", \"auto\" (predefinito: 'strict')",
  "MINIO_API_REPLICATION_PRIORITY": "Imposta la priorità di replica (predefinito: 'auto')",
  "MINIO_API_REPLICATION_MAX_WORKERS": "Numero massimo di worker per la replica (predefinito: '500')",
  "MINIO_API_TRANSITION_WORKERS": "Numero di worker per la transizione (predefinito: '100')",
  "MINIO_API_STALE_UPLOADS_EXPIRY": "Scadenza oltre la quale i caricamenti multipart inattivi vengono eliminati (predefinito: '24h')",
  "MINIO_API_STALE_UPLOADS_CLEANUP_INTERVAL": "Intervallo per l'eliminazione dei caricamenti multipart scaduti (predefinito: '6h')",
  "MINIO_API_DELETE_CLEANUP_INTERVAL": "Intervallo per l'eliminazione definitiva degli oggetti nella cartella \".trash\" (predefinito: '5m')",
  "MINIO_API_ODIRECT": "Abilita o disabilita O_DIRECT per la scrittura in condizioni particolari. **Attenzione**: non disabilitare senza test (predefinito: 'on')",
  "MINIO_API_ROOT_ACCESS": "Disattiva l'accesso tramite credenziali root per tutte le chiamate API (inclusi S3 e operazioni admin) (predefinito: 'on')",
  "MINIO_API_SYNC_EVENTS": "Abilita notifiche sincrone per i bucket (predefinito: 'off')",
  "MINIO_API_OBJECT_MAX_VERSIONS": "Numero massimo consentito di versioni per oggetto (predefinito: '9223372036854775807')",
  "MINIO_BROWSER": "Abilita o disabilita l'accesso all'interfaccia web. Abilitato per default ('on')",
  "MINIO_DOMAIN": "Abilita richieste in stile virtual-host, es: \"mydomain.com\" o più domini separati da virgola, es: \"sub1.mydomain.com,sub2.mydomain.com\""
}
