{
  "MP_DATABASE": "স্থায়ী ডেটা সংরক্ষণের জন্য স্থানীয় ডেটাবেস ফাইলনাম নির্দিষ্ট করুন। ডিফল্ট হল একটি স্থানীয় অস্থায়ী ফাইল যা Mailpit প্রস্থান করলে স্বয়ংক্রিয়ভাবে মুছে যায়। আপনি ঐচ্ছিকভাবে একটি \"http address\" নির্দিষ্ট করে একটি দূরবর্তী rqlite ডেটাবেস ব্যবহার করতে পারেন (ডক্স দেখুন)।",
  "MP_LABEL": "এই Mailpit ইনস্ট্যান্স সনাক্ত করতে একটি ঐচ্ছিক লেবেল সেট করুন। এটি ওয়েব UI, SMTP এবং POP3 সার্ভারে লেবেল যোগ করে।",
  "MP_TENANT_ID": "একটি টেন্যান্ট ID (টেবিল প্রিফিক্স) সেট করুন। এটি একই ডেটা ফাইল শেয়ার করা অন্যান্য Mailpit ইনস্ট্যান্স থেকে ডেটা আলাদা করতে ব্যবহৃত হয় (ডক্স দেখুন)।",
  "MP_MAX_MESSAGES": "সংরক্ষণ করার জন্য সর্বাধিক বার্তার সংখ্যা। এর চেয়ে বেশি হলে Mailpit পর্যায়ক্রমে পুরানো বার্তা মুছবে। স্বয়ংক্রিয়-মুছে ফেলা নিষ্ক্রিয় করতে 0 সেট করুন (ডক্স দেখুন)।",
  "MP_MAX_AGE": "(h)ours বা (d)ays এ বার্তা সংরক্ষণের সর্বাধিক বয়স। এর চেয়ে বেশি হলে Mailpit পর্যায়ক্রমে পুরানো বার্তা মুছবে। মান অবশ্যই ঘন্টায় (উদাহরণ: --max-age 36h) বা দিনে (উদাহরণ: --max-age 14d) হতে হবে (ডক্স দেখুন)।",
  "MP_USE_MESSAGE_DATES": "SMTP-প্রাপ্ত তারিখ ও সময়ের পরিবর্তে Mailpit প্রাপ্ত তারিখ ও সময় হিসেবে বার্তা হেডার তারিখ ব্যবহার করুন।",
  "MP_IGNORE_DUPLICATE_IDS": "Message-Ids এর উপর ভিত্তি করে ডুপ্লিকেট বার্তা উপেক্ষা করুন।",
  "MP_LOG_FILE": "stdout এর পরিবর্তে ফাইলে Mailpit আউটপুট লগ করুন। উদাহরণ: --log-file /path/to/logfile.log",
  "MP_QUIET": "শান্ত লগিং (শুধুমাত্র ত্রুটি)",
  "MP_VERBOSE": "ভার্বোস লগিং (ডিবাগ)",
  "MP_UI_BIND_ADDR": "UI এর জন্য HTTP বাইন্ড ইন্টারফেস এবং পোর্ট।",
  "MP_WEBROOT": "ওয়েব UI ও API এর জন্য webroot সেট করুন, উদাহরণস্বরূপ mail এর ফলে http://0.0.0.0:8025/mail/ হবে।",
  "MP_UI_AUTH_FILE": "ওয়েব UI ও API বেসিক অথেন্টিকেশনের জন্য একটি পাসওয়ার্ড ফাইল নির্দিষ্ট করুন (ডক্স দেখুন)।",
  "MP_UI_TLS_CERT": "ওয়েব UI ও API এর জন্য TLS সার্টিফিকেট (যেমন: HTTPS)। এই অপশনের জন্য --ui-tls-key আর্গুমেন্ট বা MP_UI_TLS_KEY এনভায়রনমেন্ট ভেরিয়েবল সেট করতে হবে।",
  "MP_UI_TLS_KEY": "ওয়েব UI ও API এর জন্য TLS কী (যেমন: HTTPS)। এই অপশনের জন্য --ui-tls-cert আর্গুমেন্ট বা MP_UI_TLS_CERT এনভায়রনমেন্ট ভেরিয়েবল সেট করতে হবে।",
  "MP_API_CORS": "আপনার যদি ক্রস-ডোমেইন ব্রাউজার অনুরোধ প্রয়োজন হয় তাহলে API CORS Access-Control-Allow-Origin হেডার সেট করুন।",
  "MP_BLOCK_REMOTE_CSS_AND_FONTS": "বার্তা স্টাইলশীটের মাধ্যমে ইমপোর্ট করা দূরবর্তী CSS এবং ফন্টে সব ব্রাউজার অ্যাক্সেস ব্লক করুন। Mailpit এগুলি ব্লক করতে HTTP Content Security Policy (CSP) পদ্ধতি ব্যবহার করে। এটি দূরবর্তী ছবি বা বাহ্যিক লিংকে ক্লিক করা ব্লক করে না।",
  "MP_ENABLE_SPAMASSASSIN": "বার্তা স্প্যামিনেস স্কোরের জন্য SpamAssassin ইন্টিগ্রেশন সক্রিয় করুন (ডক্স দেখুন)।",
  "MP_ALLOW_UNTRUSTED_TLS": "লিংক চেকার ও স্ক্রিনশট তৈরির জন্য HTTPS সার্টিফিকেট যাচাই করবেন না।",
  "MP_SMTP_BIND_ADDR": "SMTP বাইন্ড ইন্টারফেস এবং পোর্ট।",
  "MP_SMTP_AUTH_FILE": "SMTP অথেন্টিকেশনের জন্য একটি পাসওয়ার্ড ফাইল নির্দিষ্ট করুন (ডক্স দেখুন)।",
  "MP_SMTP_AUTH_ACCEPT_ANY": "কোনো SMTP ইউজারনেম এবং পাসওয়ার্ড গ্রহণ করুন, কিছু না থাকলেও। মূলত যেকোনো কিছু অনুমতি দিতে এটি ব্যবহার করুন।",
  "MP_SMTP_TLS_CERT": "SMTP STARTTLS এর জন্য TLS সার্টিফিকেট। এই অপশনের জন্য --smtp-tls-key আর্গুমেন্ট বা MP_SMTP_TLS_KEY এনভায়রনমেন্ট ভেরিয়েবল সেট করতে হবে।",
  "MP_SMTP_TLS_KEY": "SMTP STARTTLS এর জন্য TLS কী। এই অপশনের জন্য --smtp-tls-cert আর্গুমেন্ট বা MP_SMTP_TLS_CERT এনভায়রনমেন্ট ভেরিয়েবল সেট করতে হবে।",
  "MP_SMTP_REQUIRE_STARTTLS": "সব SMTP ক্লায়েন্টকে STARTTLS এনক্রিপশন ব্যবহার করতে হবে। true সেট করলে, কানেকশন STARTTLS এ আপগ্রেড না হওয়া পর্যন্ত শুধুমাত্র অনুমোদিত কমান্ড হল NOOP, EHLO, STARTTLS এবং QUIT (RFC 4954 এ নির্দিষ্ট)।",
  "MP_SMTP_REQUIRE_TLS": "সব SMTP ক্লায়েন্টকে SSL/TLS এনক্রিপশন ব্যবহার করতে হবে। true সেট করলে, SMTP সার্ভারের সব কানেকশন TLS এর মাধ্যমে পরিচালনা করতে হবে। এটি STARTTLS থেকে আলাদা যা প্রাথমিক কানেকশন এনক্রিপ্ট না করা প্রয়োজন। মনে রাখবেন যে এই অপশন STARTTLS নিষ্ক্রিয় করে এবং ক্লায়েন্ট সামঞ্জস্য কমাতে পারে।",
  "MP_SMTP_AUTH_ALLOW_INSECURE": "সাধারণত STARTTLS বা TLS সব SMTP অথেন্টিকেশনের জন্য প্রয়োগ করা হয়। এই অপশন STARTTLS ব্যবহার করার সময় অনিরাপদ PLAIN ও LOGIN SMTP অথেন্টিকেশন অনুমতি দেয়।",
  "MP_SMTP_STRICT_RFC_HEADERS": "বার্তা হেডারে \\r\\n এর পরিবর্তে \\n লাইন ব্রেক থাকলে Mailpit কে একটি SMTP ত্রুটি ফেরত দিতে বাধ্য করুন। ডিফল্টভাবে Mailpit নীরবে কিছু ভাঙা sendmail ক্লায়েন্ট দ্বারা তৈরি ভুল লাইন ব্রেক ঠিক করবে (সম্পর্কিত GitHub ইস্যু দেখুন)।",
  "MP_SMTP_MAX_RECIPIENTS": "প্রতি বার্তায় অনুমোদিত SMTP প্রাপকদের সর্বাধিক সংখ্যা।",
  "MP_SMTP_ALLOWED_RECIPIENTS": "শুধুমাত্র একটি রেগুলার এক্সপ্রেশনের সাথে মিলে যাওয়া SMTP প্রাপকদের অনুমতি দিন। শুধুমাত্র একটি পূর্ব-নির্ধারিত তালিকায় পাঠানো মেইল সীমাবদ্ধ করতে এটি ব্যবহার করুন। একটি উদাহরণ হবে --smtp-allowed-recipients '{'@'}example.com শুধুমাত্র {'@'}example.com এ শেষ হওয়া প্রাপকদের পাঠানো ইমেইল অনুমতি দিতে।",
  "MP_SMTP_DISABLE_RDNS": "SMTP রিভার্স DNS লুকআপ নিষ্ক্রিয় করুন। SMTP ডিফল্টভাবে সংযোগকারী ক্লায়েন্টের IP ঠিকানার হোস্টনাম রিজলভ করার চেষ্টা করবে, তবে পরীক্ষা নেটওয়ার্কে এটি কখনও কখনও সমস্যাযুক্ত হতে পারে প্রতিটি বার্তা সরবরাহের জন্য বিলম্ব সৃষ্টি করে।",
  "MP_SMTP_RELAY_CONFIG": "বার্তা রিলে/রিলিজ সক্রিয় করতে SMTP কনফিগারেশন ফাইল (ডক্স দেখুন)। বিকল্পভাবে সম্পূর্ণ কনফিগারেশন এনভায়রনমেন্ট ভেরিয়েবলের মাধ্যমে পাস করা যেতে পারে।",
  "MP_SMTP_RELAY_ALL": "বাহ্যিক SMTP সার্ভারের মাধ্যমে স্বয়ংক্রিয়ভাবে সব আগত বার্তা রিলে করুন (ডক্স দেখুন)। অত্যন্ত সতর্কতার সাথে ব্যবহার করুন!",
  "MP_SMTP_RELAY_MATCHING": "বাহ্যিক SMTP সার্ভারের মাধ্যমে স্বয়ংক্রিয়ভাবে মিলে যাওয়া প্রাপকদের কিছু আগত বার্তা রিলে করুন (ডক্স দেখুন)।",
  "MP_POP3_BIND_ADDR": "POP3 সার্ভার বাইন্ড ইন্টারফেস এবং পোর্ট।",
  "MP_POP3_AUTH_FILE": "POP3 অথেন্টিকেশনের জন্য একটি পাসওয়ার্ড ফাইল নির্দিষ্ট করুন (ডক্স দেখুন)।",
  "MP_POP3_TLS_CERT": "POP3 SSL/TLS এর জন্য TLS সার্টিফিকেট। এই অপশনের জন্য --pop3-tls-key আর্গুমেন্ট বা MP_POP3_TLS_KEY এনভায়রনমেন্ট ভেরিয়েবল সেট করতে হবে।",
  "MP_POP3_TLS_KEY": "POP3 SSL/TLS এর জন্য TLS কী। এই অপশনের জন্য --pop3-tls-cert আর্গুমেন্ট বা MP_POP3_TLS_CERT এনভায়রনমেন্ট ভেরিয়েবল সেট করতে হবে।",
  "MP_TAG": "ফিল্টার মিলে যাওয়া নতুন বার্তা স্বয়ংক্রিয়-ট্যাগ করুন (ডক্স দেখুন)।",
  "MP_TAGS_CONFIG": "yaml কনফিগারেশন ফাইল থেকে ট্যাগ ফিল্টার লোড করুন (ডক্স দেখুন)।",
  "MP_TAGS_TITLE_CASE": "সব নতুন-তৈরি ট্যাগের জন্য TitleCasing প্রয়োগ করে (ডক্স দেখুন)।",
  "MP_TAGS_DISABLE": "নির্দিষ্ট স্বয়ংক্রিয়-ট্যাগিং নিষ্ক্রিয় করুন। এই অপশন কমা-বিভক্ত অপশনের একটি তালিকা নেয় (ডক্স দেখুন)।",
  "MP_WEBHOOK_URL": "নতুন বার্তা প্রাপ্ত হলে একটি webhook কল করুন (ডক্স দেখুন)। উদাহরণ: --webhook-url https://example.com/webhook.php",
  "MP_WEBHOOK_LIMIT": "প্রতি সেকেন্ডে রেট সীমিত webhook অনুরোধ। সম্ভাব্যভাবে webhook সার্ভার ওভারলোড করা প্রতিরোধ করতে, এটি ডিফল্টভাবে প্রতি সেকেন্ডে সর্বাধিক 1 অনুরোধে রেট সীমিত (ডক্স দেখুন)।"
}
