{
  "working_dir": "ওয়ার্কিং ডিরেক্টরি",
  "db_path": "ডেটাবেস ফাইল তৈরি এবং পুনরুদ্ধার করার স্থান নির্ধারণ করে",
  "env": "ইনস্ট্যান্সের এনভায়রনমেন্ট কনফিগার করে। মান অবশ্যই `production` বা `development` হতে হবে।",
  "http_addr": "HTTP সার্ভার যে ঠিকানায় শুনবে।",
  "master_key": "ইনস্ট্যান্সের মাস্টার কী সেট করে, GET /health ছাড়া সব রুট স্বয়ংক্রিয়ভাবে সুরক্ষিত করে।",
  "no_analytics": "প্রদান করা হলে Meilisearch এর বিল্ট-ইন টেলিমেট্রি নিষ্ক্রিয় করে।\nMeilisearch স্বয়ংক্রিয়ভাবে সব ইনস্ট্যান্স থেকে ডেটা সংগ্রহ করে যা এই ফ্ল্যাগ ব্যবহার করে অপ্ট আউট করে না।\nসংগৃহীত সব ডেটা শুধুমাত্র Meilisearch উন্নত করার উদ্দেশ্যে ব্যবহৃত হয়, এবং যেকোনো সময় মুছে ফেলা যেতে পারে।",
  "http_payload_size_limit": "গৃহীত পেলোডের সর্বাধিক আকার সেট করে।",
  "log_level": "Meilisearch এর লগে কতটা বিস্তারিত উপস্থিত থাকা উচিত তা নির্ধারণ করে।\nMeilisearch বর্তমানে ছয়টি লগ লেভেল সমর্থন করে, ক্রমবর্ধমান ভার্বোসিটির ক্রমে তালিকাভুক্ত:  `OFF`, `ERROR`, `WARN`, `INFO`, `DEBUG`, `TRACE`",
  "max_indexing_memory": "ইনডেক্সিং করার সময় Meilisearch সর্বাধিক কতটা RAM ব্যবহার করতে পারে তা সেট করে।",
  "max_indexing_threads": "ইনডেক্সিং করার সময় Meilisearch সর্বাধিক কতগুলি থ্রেড ব্যবহার করতে পারে তা সেট করে।",
  "dump_dir": "Meilisearch ডাম্প ফাইল তৈরি করবে এমন ডিরেক্টরি সেট করে।",
  "import_dump": "নির্দিষ্ট পাথে অবস্থিত ডাম্প ফাইল ইমপোর্ট করে। পাথ অবশ্যই একটি .dump ফাইলে নির্দেশ করতে হবে।",
  "ignore_missing_dump": "`import_dump` একটি বৈধ ডাম্প ফাইলে নির্দেশ না করলে Meilisearch কে ত্রুটি ছুড়তে বাধা দেয়।",
  "ignore_dump_if_db_exists": "একটি বিদ্যমান ডেটাবেস সহ একটি Meilisearch ইনস্ট্যান্সকে `import_dump` ব্যবহার করার সময় ত্রুটি ছুড়তে বাধা দেয়।",
  "schedule_snapshot": "true হলে নির্ধারিত স্ন্যাপশট সক্রিয় করে, false হলে নিষ্ক্রিয় করে (ডিফল্ট)।\nমান একটি পূর্ণসংখ্যা হিসাবে দেওয়া হলে, তারপর পাস করা মান দিয়ে নির্ধারিত স্ন্যাপশট সক্রিয় করে প্রতিটি স্ন্যাপশটের মধ্যে ব্যবধান হিসাবে, সেকেন্ডে।",
  "snapshot_dir": "Meilisearch স্ন্যাপশট সংরক্ষণ করবে এমন ডিরেক্টরি সেট করে।",
  "import_snapshot": "প্রদত্ত ফাইলপাথে পূর্বে-তৈরি স্ন্যাপশট ইমপোর্ট করার পরে Meilisearch চালু করে।",
  "ignore_missing_snapshot": "`import_snapshot` একটি বৈধ স্ন্যাপশট ফাইলে নির্দেশ না করলে একটি Meilisearch ইনস্ট্যান্সকে ত্রুটি ছুড়তে বাধা দেয়।",
  "ignore_snapshot_if_db_exists": "একটি বিদ্যমান ডেটাবেস সহ একটি Meilisearch ইনস্ট্যান্সকে `import_snapshot` ব্যবহার করার সময় ত্রুটি ছুড়তে বাধা দেয়।",
  "ssl_auth_path": "নির্দিষ্ট পাথে ক্লায়েন্ট অথেন্টিকেশন সক্রিয় করে।",
  "ssl_cert_path": "সার্ভারের SSL সার্টিফিকেট সেট করে।",
  "ssl_key_path": "সার্ভারের SSL কী ফাইল সেট করে।",
  "ssl_ocsp_path": "সার্ভারের OCSP ফাইল সেট করে।",
  "ssl_require_auth": "SSL অথেন্টিকেশন বাধ্যতামূলক করে।",
  "ssl_resumption": "SSL সেশন রিজাম্পশন সক্রিয় করে।",
  "ssl_tickets": "SSL টিকিট সক্রিয় করে।",
  "experimental_enable_metrics": "পরীক্ষামূলক মেট্রিক্স ফিচার। `GET /metrics` এন্ডপয়েন্টে Prometheus মেট্রিক্স সক্রিয় করে।",
  "experimental_reduce_indexing_memory_usage": "ইনডেক্সিং করার সময় পরীক্ষামূলক RAM হ্রাস, প্রোডাকশনে ব্যবহার করবেন না।",
  "experimental_max_number_of_batched_tasks": "পরীক্ষামূলকভাবে একসাথে প্রক্রিয়া করা হবে এমন কাজের সর্বাধিক সংখ্যা হ্রাস করে।"
}
