{
  "MP_DATABASE": "Määritä paikallinen tietokannan tiedostonimi pysyvien tietojen tallentamiseksi. Oletus on paikallinen väliaikainen tiedosto, joka poistetaan automaattisesti, kun Mailpit poistuu. Voit halutessasi käyttää kauko rqlite tietokantaa määrittämällä “http osoite” (katso asiat).",
  "MP_LABEL": "Aseta valinnainen etiketti tunnistaaksesi tämän Mailpit instanssin. Tämä lisää tunnisteen web-käyttöliittymään, SMTP- ja POP3-palvelimille.",
  "MP_TENANT_ID": "Set a tenant ID (table prefix). This is used to isolate data from other Mailpit instances sharing the same data file (katso docs).",
  "MP_MAX_MESSAGES": "Tallennettavien viestien enimmäismäärä. Mailpit poistaa määräajoin vanhimmat viestit, jos suurempi kuin tämä. Aseta arvoon 0 poistaaksesi automaattisen poiston käytöstä (ks. asiak.",
  "MP_MAX_AGE": "Tallennettavien viestien enimmäisikä joko (h)ours tai (d)ays. Mailpit poistaa säännöllisesti vanhimmat viestit, jos tämä on suurempi. Arvon on oltava joko tunnissa (esimerkki: --max-age 36h) tai päivinä (esimerkki: --max-age 14d) (ks. asiat).",
  "MP_USE_MESSAGE_DATES": "Käytä viestin otsikkopäivää Mailpit vastaanotettu päivämäärä ja aika sijaan SMTP vastaanotettu päivämäärä & aika.",
  "MP_IGNORE_DUPLICATE_IDS": "Ohita viestien kaksoiskappaleet, jotka perustuvat Viesti-Ideihin.",
  "MP_LOG_FILE": "Loki Mailpit ulostulo tiedostoon stdoutin sijaan. Esimerkki: --log-file /path/to/logfile.log",
  "MP_QUIET": "Hiljainen kirjaaminen (vain virheet)",
  "MP_VERBOSE": "Moniulotteinen kirjaaminen (virheenkorjaus)",
  "MP_UI_BIND_ADDR": "HTTP sitovan käyttöliittymän ja portin UI:lle.",
  "MP_WEBROOT": "Set the webroot for web UI & API, for example mail would result in http://0.0.0.0:8025/mail/.",
  "MP_UI_AUTH_FILE": "Määritä salasanatiedosto web-käyttöliittymän ja API:n perustunnistautumista varten (katso asiak.",
  "MP_UI_TLS_CERT": "TLS sertifikaatti web UI & API (eli HTTPS). Tämä valinta vaatii valitsimen --ui-tls-argumentin tai MP_UI_TLS_KEY ympäristömuuttujan.",
  "MP_UI_TLS_KEY": "TLS-avain web UI & API (eli HTTPS). Tämä valinta vaatii valitsimen --ui-tls-cert argumentin tai MP_UI_TLS_CERT ympäristömuuttujan.",
  "MP_API_CORS": "Aseta API CORS Access-Control-Allow-Origin otsikko, jos tarvitset domain-selaimen pyynnöt.",
  "MP_BLOCK_REMOTE_CSS_AND_FONTS": "Estä kaikki selaimen käyttöoikeudet etäiseen CSS:ään ja kirjasimiin, jotka on tuotu viestityylisivustojen kautta. Mailpit käyttää HTTP Content Security Policy (CSP) -menetelmää näiden estämiseksi. Tämä ei estä etäkuvia tai klikkaa ulkoista linkkiä.",
  "MP_ENABLE_SPAMASSASSIN": "Ota SpamAssassin integraatio käyttöön viestien roskapostinvastausten pisteissä (katso asiat).",
  "MP_ALLOW_UNTRUSTED_TLS": "Älä vahvista HTTPS varmenteita joko linkin tarkistin ja kuvakaappauksen luomiseen.",
  "MP_SMTP_BIND_ADDR": "SMTP sitoo käyttöliittymä ja portti.",
  "MP_SMTP_AUTH_FILE": "Määritä salasanatiedosto SMTP autentikointia varten (ks. asiat).",
  "MP_SMTP_AUTH_ACCEPT_ANY": "Hyväksy mikä tahansa SMTP käyttäjätunnus ja salasana, mukaan lukien ei mitään. Käytä tätä salliaksesi periaatteessa mitään.",
  "MP_SMTP_TLS_CERT": "TLS sertifikaatti SMTP STARTTLS. Tämä valinta vaatii valittuna --smtp-tls-key- argumentin tai MP_SMTP_TLS_KEY ympäristömuuttujan.",
  "MP_SMTP_TLS_KEY": "TLS avain SMTP STARTTLS. Tämä valinta vaatii valittuna --smtp-tls-cert argumentin tai MP_SMTP_TLS_CERT ympäristömuuttujan.",
  "MP_SMTP_REQUIRE_STARTTLS": "Vaadi kaikki SMTP-asiakkaat käyttämään STARTTLS-salausta. Jos arvo on tosi, ainoat sallitut komennot ovat NOOP, EHLO, STARTTLS ja QUIT (kuten määritelty RFC 4954) kunnes liitäntä on päivitetty STARTTLS-järjestelmään.",
  "MP_SMTP_REQUIRE_TLS": "Vaadi kaikki SMTP-asiakkaat käyttämään SSL/TLS-salausta. Jos asetus on tosi, kaikki SMTP-palvelimen yhteydet on käsiteltävä TLS-järjestelmän kautta. Tämä on erilainen kuin STARTTLS, joka vaatii alkuperäisen yhteyden salaamattomana. Huomaa, että tämä valinta poistaa STARTTLS käytöstä ja saattaa heikentää asiakasyhteensopivuutta.",
  "MP_SMTP_AUTH_ALLOW_INSECURE": "Tyypillisesti joko STARTTLS tai TLS pannaan täytäntöön kaikessa SMTP-todennuksessa. Tämä asetus sallii suojaamattoman PLAIN & LOGIN SMTP todennuksen STARTTLS-järjestelmän käytössä.",
  "MP_SMTP_STRICT_RFC_HEADERS": "Pakota Mailpit palauttamaan SMTP-virhe, jos viestin otsikot sisältävät \\n sen sijaan \\r\\n rivikatkosta. Oletuksena Mailpit korjaa hiljaisesti joidenkin rikkinäisten sendmail-asiakkaiden luomat virheelliset rivinvaihdot (katso liittyvä GitHub kysymys).",
  "MP_SMTP_MAX_RECIPIENTS": "Suurin sallittu SMTP-vastaanottajien määrä viestiä kohden.",
  "MP_SMTP_ALLOWED_RECIPIENTS": "Salli vain säännöllistä lauseketta vastaavat SMTP-vastaanottajat. Käytä tätä rajataksesi saapuvan postin vain ennalta määriteltyyn luetteloon lähetettyihin vastaanottajiin. Esimerkkinä mainittakoon --smtp-sallitut vastaanottajat '{'@'}example.com$' salliaksesi vain vastaanottajille lähetetyt sähköpostit jotka päättyvät osoitteeseen {'@'}example.com.",
  "MP_SMTP_DISABLE_RDNS": "Poista SMTP käänteiset DNS-hakut. SMTP kokeilla oletuksena ratkaista isäntänimi IP osoitteen yhdistävä asiakas, kuitenkin testiverkoissa tämä voi joskus olla ongelmallista aiheuttaen viiveitä jokaiseen lähetettyyn viestiin.",
  "MP_SMTP_RELAY_CONFIG": "SMTP konfiguraatiotiedosto aktivoidaksesi viestin rele/julkaisu (katso dokumentit). Vaihtoehtoisesti koko konfiguraatio voidaan siirtää ympäristömuuttujien kautta.",
  "MP_SMTP_RELAY_ALL": "Lähetä kaikki saapuvat viestit automaattisesti ulkoisen SMTP-palvelimen kautta (katso asiat). Käytä äärimmäistä varovaisuutta!",
  "MP_SMTP_RELAY_MATCHING": "Käynnistä saapuvat viestit automaattisesti vastaanottajille ulkoisen SMTP-palvelimen kautta (katso dokumentit).",
  "MP_POP3_BIND_ADDR": "POP3-palvelin sitoo käyttöliittymän ja portin.",
  "MP_POP3_AUTH_FILE": "Määritä salasanatiedosto POP3 autentikointia varten (ks. asiat).",
  "MP_POP3_TLS_CERT": "TLS sertifikaatti POP3 SSL/TLS. Tämä valinta vaatii valitsimen --pop3-tls-avainargumentin tai MP_POP3_TLS_KEY ympäristömuuttujan.",
  "MP_POP3_TLS_KEY": "TLS-avain POP3 SSL/TLS. Tämä valinta vaatii valitsimen --pop3-tls-cert argumentin tai MP_POP3_TLS_CERT ympäristömuuttujan.",
  "MP_TAG": "Merkitse automaattisesti uudet viestit, jotka vastaavat suodattimia (katso asiak).",
  "MP_TAGS_CONFIG": "Lataa tunnisteet suodattimia yaml asetustiedostosta (ks. asiakku).",
  "MP_TAGS_TITLE_CASE": "Pakottaa TitleCasing kaikille uusille tunnisteille (ks. asiat).",
  "MP_TAGS_DISABLE": "Poista automaattinen merkintä. Tämä valinta vie pilkulla erotetun listan vaihtoehdoista (katso asiak.",
  "MP_WEBHOOK_URL": "Soita verkkokoukulle, kun uusia viestejä vastaanotetaan (ks. dokumentit). Esimerkki: --webhook-url https://example.com/webhook.php",
  "MP_WEBHOOK_LIMIT": "Arvostele rajoitetut webhook -pyynnöt sekunnissa. Jotta webhook-palvelinta ei mahdollisesti ylikuormittaisi, tämä nopeus on oletusarvoisesti rajoitettu enintään yhteen pyyntöön sekunnissa (ks. asiak. )."
}
