{
  "MP_DATABASE": "Tentukan nama file database lokal untuk menyimpan data yang persisten. Secara default, ini adalah file sementara lokal yang akan dihapus otomatis saat Mailpit keluar. Anda dapat menggunakan database rqlite jarak jauh dengan menentukan 'alamat http' (lihat dokumentasi).",
  "MP_LABEL": "Tentukan label opsional untuk mengidentifikasi instance Mailpit ini. Ini akan menambahkan label ke antarmuka web, server SMTP dan POP3.",
  "MP_TENANT_ID": "Tentukan ID penyewa (prefix tabel). Ini digunakan untuk mengisolasi data dari instance Mailpit lain yang berbagi file data yang sama (lihat dokumentasi).",
  "MP_MAX_MESSAGES": "Jumlah maksimum pesan yang akan disimpan. Mailpit akan secara berkala menghapus pesan tertua jika melebihi jumlah ini. Setel ke 0 untuk menonaktifkan penghapusan otomatis (lihat dokumentasi).",
  "MP_MAX_AGE": "Usia maksimum pesan yang akan disimpan dalam jam (h) atau hari (d). Mailpit akan secara berkala menghapus pesan tertua jika lebih lama dari ini. Nilai harus dalam jam (Contoh: --max-age 36h) atau hari (Contoh: --max-age 14d) (lihat dokumentasi).",
  "MP_USE_MESSAGE_DATES": "Gunakan tanggal header pesan sebagai tanggal & waktu diterima Mailpit, bukan tanggal & waktu diterima SMTP.",
  "MP_IGNORE_DUPLICATE_IDS": "Abaikan pesan duplikat berdasarkan Message-Ids.",
  "MP_LOG_FILE": "Log output Mailpit ke file daripada stdout. Contoh: --log-file /path/to/logfile.log",
  "MP_QUIET": "Logging tenang (hanya kesalahan)",
  "MP_VERBOSE": "Logging rinci (debug)",
  "MP_UI_BIND_ADDR": "Antarmuka HTTP bind dan port untuk UI.",
  "MP_WEBROOT": "Tentukan webroot untuk UI web & API, misalnya mail akan menghasilkan http://0.0.0.0:8025/mail/.",
  "MP_UI_AUTH_FILE": "Tentukan file kata sandi untuk otentikasi dasar UI web & API (lihat dokumentasi).",
  "MP_UI_TLS_CERT": "Sertifikat TLS untuk UI web & API (misalnya: HTTPS). Opsi ini membutuhkan argumen --ui-tls-key atau variabel lingkungan MP_UI_TLS_KEY.",
  "MP_UI_TLS_KEY": "Kunci TLS untuk UI web & API (misalnya: HTTPS). Opsi ini membutuhkan argumen --ui-tls-cert atau variabel lingkungan MP_UI_TLS_CERT.",
  "MP_API_CORS": "Tetapkan header API CORS Access-Control-Allow-Origin jika Anda memerlukan permintaan browser lintas domain.",
  "MP_BLOCK_REMOTE_CSS_AND_FONTS": "Blokir semua akses browser ke CSS dan font jarak jauh yang diimpor melalui stylesheet pesan. Mailpit menggunakan metode HTTP Content Security Policy (CSP) untuk memblokir ini. Ini tidak memblokir gambar jarak jauh atau mengklik tautan eksternal.",
  "MP_ENABLE_SPAMASSASSIN": "Aktifkan integrasi SpamAssassin untuk skor spam pesan (lihat dokumentasi).",
  "MP_ALLOW_UNTRUSTED_TLS": "Jangan verifikasi sertifikat HTTPS untuk pemeriksa tautan & pembuatan tangkapan layar.",
  "MP_SMTP_BIND_ADDR": "Antarmuka bind SMTP dan port.",
  "MP_SMTP_AUTH_FILE": "Tentukan file kata sandi untuk otentikasi SMTP (lihat dokumentasi).",
  "MP_SMTP_AUTH_ACCEPT_ANY": "Terima nama pengguna dan kata sandi SMTP apa pun, termasuk yang kosong. Gunakan ini untuk pada dasarnya mengizinkan apa saja.",
  "MP_SMTP_TLS_CERT": "Sertifikat TLS untuk SMTP STARTTLS. Opsi ini membutuhkan argumen --smtp-tls-key atau variabel lingkungan MP_SMTP_TLS_KEY.",
  "MP_SMTP_TLS_KEY": "Kunci TLS untuk SMTP STARTTLS. Opsi ini membutuhkan argumen --smtp-tls-cert atau variabel lingkungan MP_SMTP_TLS_CERT.",
  "MP_SMTP_REQUIRE_STARTTLS": "Wajibkan semua klien SMTP untuk menggunakan enkripsi STARTTLS. Jika disetel ke true, satu-satunya perintah yang diizinkan adalah NOOP, EHLO, STARTTLS dan QUIT (seperti yang ditentukan dalam RFC 4954) hingga koneksi ditingkatkan ke STARTTLS.",
  "MP_SMTP_REQUIRE_TLS": "Wajibkan semua klien SMTP untuk menggunakan enkripsi SSL/TLS. Jika disetel ke true, semua koneksi ke server SMTP harus ditangani melalui TLS. Ini berbeda dengan STARTTLS yang memerlukan koneksi awal untuk tidak terenkripsi. Perhatikan bahwa opsi ini menonaktifkan STARTTLS dan dapat mengurangi kompatibilitas klien.",
  "MP_SMTP_AUTH_ALLOW_INSECURE": "Biasanya, baik STARTTLS atau TLS diterapkan untuk semua otentikasi SMTP. Opsi ini memungkinkan otentikasi SMTP PLAIN & LOGIN yang tidak aman saat menggunakan STARTTLS.",
  "MP_SMTP_STRICT_RFC_HEADERS": "Paksa Mailpit untuk mengembalikan kesalahan SMTP jika header pesan berisi \\n alih-alih \\r\\n untuk pemisah baris. Secara default, Mailpit akan memperbaiki kesalahan pemisah baris yang tidak benar yang dihasilkan oleh beberapa klien sendmail yang rusak (lihat masalah GitHub terkait).",
  "MP_SMTP_MAX_RECIPIENTS": "Jumlah maksimum penerima SMTP yang diizinkan per pesan.",
  "MP_SMTP_ALLOWED_RECIPIENTS": "Hanya izinkan penerima SMTP yang sesuai dengan ekspresi reguler. Gunakan ini untuk membatasi email masuk hanya untuk yang dikirim ke daftar yang sudah ditentukan. Sebagai contoh, --smtp-allowed-recipients '{'@'}example.com$' untuk hanya mengizinkan email yang dikirim ke penerima yang berakhiran {'@'}example.com.",
  "MP_SMTP_DISABLE_RDNS": "Nonaktifkan pencarian DNS terbalik SMTP. SMTP secara default akan mencoba menyelesaikan nama host dari alamat IP klien yang terhubung, namun dalam jaringan pengujian ini terkadang bisa bermasalah yang menyebabkan keterlambatan untuk setiap pesan yang dikirim.",
  "MP_SMTP_RELAY_CONFIG": "File konfigurasi SMTP untuk memungkinkan relay/pembebasan pesan (lihat dokumentasi). Sebagai alternatif, seluruh konfigurasi dapat diteruskan melalui variabel lingkungan.",
  "MP_SMTP_RELAY_ALL": "Secara otomatis relay semua pesan masuk melalui server SMTP eksternal (lihat dokumentasi). Gunakan dengan hati-hati!",
  "MP_SMTP_RELAY_MATCHING": "Secara otomatis relay beberapa pesan masuk ke penerima yang sesuai melalui server SMTP eksternal (lihat dokumentasi).",
  "MP_POP3_BIND_ADDR": "Antarmuka bind server POP3 dan port.",
  "MP_POP3_AUTH_FILE": "Tentukan file kata sandi untuk otentikasi POP3 (lihat dokumentasi).",
  "MP_POP3_TLS_CERT": "Sertifikat TLS untuk POP3 SSL/TLS. Opsi ini membutuhkan argumen --pop3-tls-key atau variabel lingkungan MP_POP3_TLS_KEY.",
  "MP_POP3_TLS_KEY": "Kunci TLS untuk POP3 SSL/TLS. Opsi ini membutuhkan argumen --pop3-tls-cert atau variabel lingkungan MP_POP3_TLS_CERT.",
  "MP_TAG": "Otomatis menandai pesan baru yang sesuai dengan filter (lihat dokumentasi).",
  "MP_TAGS_CONFIG": "Muat filter tag dari file konfigurasi yaml (lihat dokumentasi).",
  "MP_TAGS_TITLE_CASE": "Menegakkan TitleCasing untuk semua tag yang baru dibuat (lihat dokumentasi).",
  "MP_TAGS_DISABLE": "Nonaktifkan penandaan otomatis tertentu. Opsi ini menerima daftar yang dipisahkan koma dari opsi (lihat dokumentasi).",
  "MP_WEBHOOK_URL": "Panggil webhook saat pesan baru diterima (lihat dokumentasi). Contoh: --webhook-url https://example.com/webhook.php",
  "MP_WEBHOOK_LIMIT": "Batasan laju permintaan webhook per detik. Untuk mencegah beban berlebih pada server webhook, ini dibatasi secara default hingga maksimum 1 permintaan per detik (lihat dokumentasi)."
}
