{
  "db_path": "Menentukan lokasi pembuatan dan pengambilan file database",
  "env": "Mengkonfigurasi lingkungan instance. Nilai harus `production` atau `development`.",
  "http_addr": "Alamat yang akan didengarkan oleh server HTTP.",
  "master_key": "Mengatur kunci master instance, secara otomatis melindungi semua rute kecuali GET /health.",
  "no_analytics": "Menonaktifkan telemetry bawaan Meilisearch saat disediakan.\nMeilisearch secara otomatis mengumpulkan data dari semua instance yang tidak memilih keluar menggunakan flag ini.\nSemua data yang dikumpulkan hanya digunakan untuk meningkatkan Meilisearch dan dapat dihapus kapan saja.",
  "http_payload_size_limit": "Mengatur ukuran maksimum payload yang diterima.",
  "log_level": "Menentukan seberapa detail yang harus ada dalam log Meilisearch.\nMeilisearch saat ini mendukung enam level log, tercantum dalam urutan peningkatan detail: `OFF`, `ERROR`, `WARN`, `INFO`, `DEBUG`, `TRACE`",
  "max_indexing_memory": "Mengatur jumlah RAM maksimum yang dapat digunakan Meilisearch saat mengindeks.",
  "max_indexing_threads": "Mengatur jumlah thread maksimum yang dapat digunakan Meilisearch selama pengindeksan.",
  "dump_dir": "Mengatur direktori tempat Meilisearch akan membuat file dump.",
  "import_dump": "Mengimpor file dump yang terletak di jalur yang ditentukan. Jalur harus menunjuk ke file .dump.",
  "ignore_missing_dump": "Mencegah Meilisearch menimbulkan error ketika `import_dump` tidak menunjuk ke file dump yang valid.",
  "ignore_dump_if_db_exists": "Mencegah instance Meilisearch dengan database yang ada menimbulkan error saat menggunakan `import_dump`.",
  "schedule_snapshot": "Mengaktifkan snapshot terjadwal ketika true, menonaktifkan ketika false (default).\nJika nilai diberikan sebagai integer, maka mengaktifkan snapshot terjadwal dengan nilai yang diberikan sebagai interval antara setiap snapshot (dalam detik).",
  "snapshot_dir": "Mengatur direktori tempat Meilisearch akan menyimpan snapshot.",
  "import_snapshot": "Menjalankan Meilisearch setelah mengimpor snapshot yang dibuat sebelumnya di jalur file yang diberikan.",
  "ignore_missing_snapshot": "Mencegah instance Meilisearch menimbulkan error ketika `import_snapshot` tidak menunjuk ke file snapshot yang valid.",
  "ignore_snapshot_if_db_exists": "Mencegah instance Meilisearch dengan database yang ada menimbulkan error saat menggunakan `import_snapshot`.",
  "ssl_auth_path": "Mengaktifkan autentikasi klien di jalur yang ditentukan.",
  "ssl_cert_path": "Mengatur sertifikat SSL server.",
  "ssl_key_path": "Mengatur file kunci SSL server.",
  "ssl_ocsp_path": "Mengatur file OCSP server.",
  "ssl_require_auth": "Membuat autentikasi SSL menjadi wajib.",
  "ssl_resumption": "Mengaktifkan kelanjutan sesi SSL.",
  "ssl_tickets": "Mengaktifkan tiket SSL.",
  "experimental_enable_metrics": "Fitur metrik eksperimental. Mengaktifkan metrik Prometheus di endpoint `GET /metrics`.",
  "experimental_reduce_indexing_memory_usage": "Pengurangan penggunaan memori eksperimental selama pengindeksan, jangan gunakan di produksi.",
  "experimental_max_number_of_batched_tasks": "Secara eksperimental mengurangi jumlah maksimum tugas yang diproses sekaligus."
}
