{
  "working_dir": "Робочий каталог",
  "db_path": "Визначає місце, де будуть створюватися та отримуватися файли бази даних",
  "env": "Налаштовує середовище екземпляра. Значення має бути або `production`, або `development`.",
  "http_addr": "Адреса, яку прослуховуватиме HTTP-сервер.",
  "master_key": "Встановлює головний ключ екземпляра, автоматично захищаючи всі маршрути, крім GET /health.",
  "no_analytics": "Деактивує вбудовану телеметрію Meilisearch, коли вона надається.\nMeilisearch автоматично збирає дані з усіх екземплярів, які не відмовляються від використання цього прапорця.\nУсі зібрані дані використовуються виключно з метою покращення Meilisearch і можуть бути видалені будь-коли.",
  "http_payload_size_limit": "Встановлює максимальний розмір прийнятих корисних навантажень.",
  "log_level": "Визначає, скільки деталей має бути присутнім у журналах Meilisearch.\nMeilisearch наразі підтримує шість рівнів журналів, перелічених у порядку зростання деталізації: `OFF`, `ERROR`, `WARN`, `INFO`, `DEBUG`, `TRACE`",
  "max_indexing_memory": "Встановлює максимальний обсяг оперативної пам'яті, яку Meilisearch може використовувати під час індексації.",
  "max_indexing_threads": "Встановлює максимальну кількість потоків, які Meilisearch може використовувати під час індексації.",
  "dump_dir": "Встановлює каталог, де Meilisearch створюватиме файли дампу.",
  "import_dump": "Імпортує файл дампу, розташований за вказаним шляхом. Шлях має вказувати на файл .dump.",
  "ignore_missing_dump": "Запобігає виникненню помилки Meilisearch, коли `import_dump` не вказує на дійсний файл дампу.",
  "ignore_dump_if_db_exists": "Запобігає виникненню помилки екземпляром Meilisearch з існуючою базою даних під час використання `import_dump`.",
  "schedule_snapshot": "Вмикає заплановані знімки, якщо значення true, вимикає, якщо значення false (за замовчуванням).\nЯкщо значення задано як ціле число, тоді вмикає запланований знімок з переданим значенням як інтервалом між кожним знімком у секундах.",
  "snapshot_dir": "Встановлює каталог, де Meilisearch зберігатиме знімки.",
  "import_snapshot": "Запускає Meilisearch після імпорту попередньо згенерованого знімка за вказаним шляхом до файлу.",
  "ignore_missing_snapshot": "Запобігає виникненню помилки екземпляром Meilisearch, коли `import_snapshot` не вказує на дійсний файл знімка.",
  "ignore_snapshot_if_db_exists": "Запобігає виникненню помилки екземпляром Meilisearch з існуючою базою даних під час використання `import_snapshot`.",
  "ssl_auth_path": "Вмикає автентифікацію клієнта за вказаним шляхом.",
  "ssl_cert_path": "Встановлює SSL-сертифікати сервера.",
  "ssl_key_path": "Встановлює файли ключів SSL сервера.",
  "ssl_ocsp_path": "Встановлює файл OCSP сервера.",
  "ssl_require_auth": "Робить автентифікацію SSL обов'язковою.",
  "ssl_resumption": "Активує відновлення сеансу SSL.",
  "ssl_tickets": "Активує квитки SSL.",
  "experimental_enable_metrics": "Функція експериментальних метрик. Вмикає метрики Prometheus на кінцевій точці `GET /metrics`.",
  "experimental_reduce_indexing_memory_usage": "Експериментальне зменшення оперативної пам'яті під час індексації, не використовувати у виробництві.",
  "experimental_max_number_of_batched_tasks": "Експериментально зменшує максимальну кількість завдань, які будуть оброблені одночасно."
}
