{
  "MINIO_ADDRESS": "Прив'язує процес сервера minio до певної мережевої адреси та номера порту.",
  "MINIO_CONSOLE_ADDRESS": "Вказує статичний порт для вбудованої консолі MinIO.",
  "MINIO_CERTS_DIR": "Вказує шлях до папки, що містить сертифікати, які процес minio використовує для налаштування підключення TLS/SSL.",
  "MINIO_ROOT_USER": "Користувач root. За замовчуванням minioadmin",
  "MINIO_ROOT_PASSWORD": "Пароль користувача root. За замовчуванням minioadmin",
  "MINIO_SITE_NAME": "назва сайту, наприклад, \"cal-rack0\"",
  "MINIO_SITE_REGION": "назва розташування сервера, наприклад, \"us-west-1\"",
  "MINIO_SITE_COMMENT": "за бажанням додайте коментар до цього налаштування",
  "MINIO_STORAGE_CLASS_STANDARD": "встановіть парність кількість для стандартного класу сховища за замовчуванням, наприклад, \"EC:4\"",
  "MINIO_STORAGE_CLASS_RRS": "встановити кількість парності для класу сховища зі зменшеною резервністю, наприклад, \"EC:2\"",
  "MINIO_ETCD_ENDPOINTS": "список кінцевих точок etcd, розділений комами, наприклад, \"http://localhost:2379\"",
  "MINIO_ETCD_PATH_PREFIX": "префікс простору імен для ізоляції орендарів, наприклад, \"customer1/\"",
  "MINIO_API_REQUESTS_MAX": "встановити максимальну кількість одночасних запитів (за замовчуванням: 'auto')",
  "MINIO_API_CLUSTER_DEADLINE": "встановити крайній термін для перевірки готовності кластера (за замовчуванням: '10s')",
  "MINIO_API_CORS_ALLOW_ORIGIN": "встановити список дозволених джерел для запитів CORS, розділених комами (за замовчуванням: '*')",
  "MINIO_API_REMOTE_TRANSPORT_DEADLINE": "встановити кінцевий термін для запитів API на віддалених транспортах під час проксі-з'єднання між федеративними екземплярами, наприклад, \"2 год\" (за замовчуванням: '2 год')",
  "MINIO_API_LIST_QUORUM": "встановити прийнятний кворум, очікуваний для операцій зі списками, наприклад, \"оптимальний\", \"зменшений\", \"диск\", \"суворий\", \"автоматичний\" (за замовчуванням: 'суворий')",
  "MINIO_API_REPLICATION_PRIORITY": "встановити пріоритет реплікації (за замовчуванням: 'автоматичний')",
  "MINIO_API_REPLICATION_MAX_WORKERS": "встановити максимальну кількість працівників реплікації (за замовчуванням: '500')",
  "MINIO_API_TRANSITION_WORKERS": "встановити кількість працівників переходу (за замовчуванням: '100')",
  "MINIO_API_STALE_UPLOADS_EXPIRY": "встановити термін дії застарілих багаточастинкових завантаження, старіші за ці значення (за замовчуванням: '24 год')",
  "MINIO_API_STALE_UPLOADS_CLEANUP_INTERVAL": "встановлено змінювати інтервали, коли термін дії застарілих багаточастинних завантажень закінчується (за замовчуванням: '6 год')",
  "MINIO_API_DELETE_CLEANUP_INTERVAL": "встановлено змінювати інтервали, коли видалені об'єкти остаточно видаляються з папки \".trash\" (за замовчуванням: '5 хв')",
  "MINIO_API_ODIRECT": "встановлено для ввімкнення або вимкнення O_DIRECT для записів за особливих умов. ПРИМІТКА: не вимикайте O_DIRECT без попереднього тестування (за замовчуванням: 'увімкнено')",
  "MINIO_API_ROOT_ACCESS": "вимкнути доступ до облікових даних root для всіх викликів API, включаючи s3, операції адміністратора (за замовчуванням: 'увімкнено')",
  "MINIO_API_SYNC_EVENTS": "встановлено для ввімкнення синхронних сповіщень про корито (за замовчуванням: 'вимкнено')",
  "MINIO_API_OBJECT_MAX_VERSIONS": "встановити максимально дозволену кількість версій на об'єкт (за замовчуванням: '9223372036854775807')",
  "MINIO_BROWSER": "Увімкнути або вимкнути доступ до веб-інтерфейсу консолі. За замовчуванням встановлено значення 'увімкнено'",
  "MINIO_DOMAIN": "увімкнути запити у стилі віртуального хоста, наприклад, \"mydomain.com\" або кілька доменів зі значеннями, розділеними комами, наприклад, \"sub1.mydomain.com,sub2.mydomain.com\""
}
