{
  "working_dir": "Directorio de Trabajo",
  "db_path": "Designa la ubicación donde se crearán y recuperarán los archivos de la base de datos",
  "env": "Configura el entorno de la instancia. El valor debe ser `production` o `development`.",
  "http_addr": "La dirección en la que el servidor HTTP escuchará.",
  "master_key": "Establece la clave maestra de la instancia, protegiendo automáticamente todas las rutas excepto GET /health.",
  "no_analytics": "Desactiva la telemetría integrada de Meilisearch cuando se proporciona.\nMeilisearch recoge datos automáticamente de todas las instancias que no desactivan la opción.\nTodos los datos recopilados se usan únicamente para mejorar Meilisearch y pueden eliminarse en cualquier momento.",
  "http_payload_size_limit": "Establece el tamaño máximo de las cargas útiles aceptadas.",
  "log_level": "Define cuán detallado debe ser el registro en Meilisearch.\nMeilisearch soporta seis niveles de registro, listados en orden de menor a mayor verbosidad: `OFF`, `ERROR`, `WARN`, `INFO`, `DEBUG`, `TRACE`",
  "max_indexing_memory": "Establece la cantidad máxima de RAM que Meilisearch puede usar durante la indexación.",
  "max_indexing_threads": "Establece el número máximo de hilos que Meilisearch puede usar durante la indexación.",
  "dump_dir": "Establece el directorio donde Meilisearch creará archivos de volcado.",
  "import_dump": "Importa el archivo de volcado ubicado en la ruta especificada. La ruta debe apuntar a un archivo .dump.",
  "ignore_missing_dump": "Evita que Meilisearch genere un error cuando `import_dump` no apunta a un archivo de volcado válido.",
  "ignore_dump_if_db_exists": "Evita que una instancia de Meilisearch con una base de datos existente genere un error al usar `import_dump`.",
  "schedule_snapshot": "Habilita instantáneas programadas si es true, deshabilita si es false (valor por defecto).\nSi el valor es un entero, habilita la instantánea programada con ese valor como intervalo entre cada instantánea, en segundos.",
  "snapshot_dir": "Establece el directorio donde Meilisearch almacenará las instantáneas.",
  "import_snapshot": "Inicia Meilisearch después de importar una instantánea generada previamente en la ruta dada.",
  "ignore_missing_snapshot": "Evita que una instancia de Meilisearch genere un error cuando `import_snapshot` no apunta a un archivo de instantánea válido.",
  "ignore_snapshot_if_db_exists": "Evita que una instancia de Meilisearch con base de datos existente genere un error al usar `import_snapshot`.",
  "ssl_auth_path": "Habilita autenticación de cliente en la ruta especificada.",
  "ssl_cert_path": "Establece los certificados SSL del servidor.",
  "ssl_key_path": "Establece los archivos de clave SSL del servidor.",
  "ssl_ocsp_path": "Establece el archivo OCSP del servidor.",
  "ssl_require_auth": "Hace que la autenticación SSL sea obligatoria.",
  "ssl_resumption": "Activa la reanudación de sesión SSL.",
  "ssl_tickets": "Activa los tickets SSL.",
  "experimental_enable_metrics": "Funcionalidad experimental de métricas. Activa métricas Prometheus en el endpoint `GET /metrics`.",
  "experimental_reduce_indexing_memory_usage": "Reducción experimental de uso de RAM durante la indexación, no usar en producción.",
  "experimental_max_number_of_batched_tasks": "Reduce experimentalmente el número máximo de tareas que se procesan simultáneamente."
}
