{
  "MINIO_ADDRESS": "Asocia el proceso del servidor minio a una dirección de red y número de puerto específicos.",
  "MINIO_CONSOLE_ADDRESS": "Especifica un puerto estático para la consola incorporada de MinIO.",
  "MINIO_CERTS_DIR": "Especifica la ruta a la carpeta que contiene certificados que el proceso minio usa para configurar la conectividad TLS/SSL.",
  "MINIO_ROOT_USER": "Usuario root. Por defecto es minioadmin",
  "MINIO_ROOT_PASSWORD": "Contraseña del usuario root. Por defecto es minioadmin",
  "MINIO_SITE_NAME": "Nombre del sitio, por ejemplo \"cal-rack0\"",
  "MINIO_SITE_REGION": "Nombre de la ubicación del servidor, por ejemplo \"us-west-1\"",
  "MINIO_SITE_COMMENT": "Opcionalmente añade un comentario a esta configuración",
  "MINIO_STORAGE_CLASS_STANDARD": "Establece el conteo de paridad para la clase de almacenamiento estándar por defecto, por ejemplo \"EC:4\"",
  "MINIO_STORAGE_CLASS_RRS": "Establece el conteo de paridad para la clase de almacenamiento con redundancia reducida, por ejemplo \"EC:2\"",
  "MINIO_ETCD_ENDPOINTS": "Lista separada por comas de endpoints etcd, por ejemplo \"http://localhost:2379\"",
  "MINIO_ETCD_PATH_PREFIX": "Prefijo de espacio de nombres para aislar inquilinos, por ejemplo \"customer1/\"",
  "MINIO_API_REQUESTS_MAX": "Establece el número máximo de solicitudes concurrentes (por defecto: 'auto')",
  "MINIO_API_CLUSTER_DEADLINE": "Establece el plazo para la verificación de disponibilidad del clúster (por defecto: '10s')",
  "MINIO_API_CORS_ALLOW_ORIGIN": "Establece la lista separada por comas de orígenes permitidos para solicitudes CORS (por defecto: '*')",
  "MINIO_API_REMOTE_TRANSPORT_DEADLINE": "Establece el plazo para solicitudes API en transportes remotos al hacer proxy entre instancias federadas, por ejemplo \"2h\" (por defecto: '2h')",
  "MINIO_API_LIST_QUORUM": "Establece el quórum aceptable esperado para operaciones de lista, por ejemplo \"optimal\", \"reduced\", \"disk\", \"strict\", \"auto\" (por defecto: 'strict')",
  "MINIO_API_REPLICATION_PRIORITY": "Establece la prioridad de replicación (por defecto: 'auto')",
  "MINIO_API_REPLICATION_MAX_WORKERS": "Establece el número máximo de trabajadores de replicación (por defecto: '500')",
  "MINIO_API_TRANSITION_WORKERS": "Establece el número de trabajadores de transición (por defecto: '100')",
  "MINIO_API_STALE_UPLOADS_EXPIRY": "Establece caducidad para cargas multipart obsoletas mayores a este valor (por defecto: '24h')",
  "MINIO_API_STALE_UPLOADS_CLEANUP_INTERVAL": "Establece el intervalo para limpiar cargas multipart obsoletas cuando caducan (por defecto: '6h')",
  "MINIO_API_DELETE_CLEANUP_INTERVAL": "Establece el intervalo para eliminar permanentemente objetos borrados de la carpeta \".trash\" (por defecto: '5m')",
  "MINIO_API_ODIRECT": "Configura para habilitar o deshabilitar O_DIRECT para escrituras en condiciones especiales. NOTA: no deshabilites O_DIRECT sin pruebas previas (por defecto: 'on')",
  "MINIO_API_ROOT_ACCESS": "Desactiva el acceso con credenciales root para todas las llamadas API incluyendo s3 y operaciones administrativas (por defecto: 'on')",
  "MINIO_API_SYNC_EVENTS": "Configura para habilitar notificaciones síncronas de buckets (por defecto: 'off')",
  "MINIO_API_OBJECT_MAX_VERSIONS": "Establece el número máximo permitido de versiones por objeto (por defecto: '9223372036854775807')",
  "MINIO_BROWSER": "Habilita o deshabilita el acceso a la interfaz web de consola. Por defecto está en 'on'",
  "MINIO_DOMAIN": "Habilita solicitudes al estilo virtual-host, por ejemplo \"midominio.com\" o múltiples dominios separados por coma, por ejemplo \"sub1.midominio.com,sub2.midominio.com\""
}
