{
  "MP_DATABASE": "Ange det lokala databasfilnamnet för att lagra beständig data. Standard är en lokal temporär fil som raderas automatiskt när Mailpit avslutas. Du kan valfritt använda en fjärr-rqlite-databas genom att ange en \"http-adress\" (se dokumentation).",
  "MP_LABEL": "Ange en valfri etikett för att identifiera denna Mailpit-instans. Detta lägger till etiketten i webbgränssnittet, SMTP och POP3-servrar.",
  "MP_TENANT_ID": "Ange ett hyres-ID (tabellprefix). Detta används för att isolera data från andra Mailpit-instanser som delar samma datafil (se dokumentation).",
  "MP_MAX_MESSAGES": "Maximalt antal meddelanden att lagra. Mailpit kommer periodiskt att radera de äldsta meddelandena om detta överskrids. Ställ in på 0 för att inaktivera automatisk radering (se dokumentation).",
  "MP_MAX_AGE": "Maximal ålder för meddelanden att lagra i antingen (t)immar eller (d)agar. Mailpit kommer periodiskt att radera de äldsta meddelandena om detta överskrids. Värdet måste vara antingen i timmar (t.ex.: --max-age 36h) eller dagar (t.ex.: --max-age 14d) (se dokumentation).",
  "MP_USE_MESSAGE_DATES": "Använd meddelandehuvudets datum som Mailpits mottagningsdatum och tid istället för SMTP-mottagningsdatum och tid.",
  "MP_IGNORE_DUPLICATE_IDS": "Ignorera dubblettmeddelanden baserat på Message-Ids.",
  "MP_LOG_FILE": "Logga Mailpit-utdata till fil istället för stdout. t.ex.: --log-file /path/to/logfile.log",
  "MP_QUIET": "Tyst loggning (endast fel)",
  "MP_VERBOSE": "Utförlig loggning (felsökning)",
  "MP_UI_BIND_ADDR": "HTTP-bindningsgränssnitt och port för webbgränssnittet.",
  "MP_WEBROOT": "Ange webbroten för webbgränssnittet och API, till exempel mail skulle resultera i http://0.0.0.0:8025/mail/.",
  "MP_UI_AUTH_FILE": "Ange en lösenordsfil för webbgränssnittet och API:s grundläggande autentisering (se dokumentation).",
  "MP_UI_TLS_CERT": "TLS-certifikat för webbgränssnittet och API (dvs: HTTPS). Detta alternativ kräver att argumentet --ui-tls-key eller miljövariabeln MP_UI_TLS_KEY är inställd.",
  "MP_UI_TLS_KEY": "TLS-nyckel för webbgränssnittet och API (dvs: HTTPS). Detta alternativ kräver att argumentet --ui-tls-cert eller miljövariabeln MP_UI_TLS_CERT är inställd.",
  "MP_API_CORS": "Ange API CORS Access-Control-Allow-Origin-header om du behöver webbläsarövergripande förfrågningar.",
  "MP_BLOCK_REMOTE_CSS_AND_FONTS": "Blockera all webbläsaråtkomst till fjärr-CSS och typsnitt som importeras via meddelandestilmallar. Mailpit använder HTTP Content Security Policy (CSP) för att blockera dessa. Detta blockerar inte fjärrbilder eller klick på externa länkar.",
  "MP_ENABLE_SPAMASSASSIN": "Aktivera SpamAssassin-integration för meddelandens spamvärde (se dokumentation).",
  "MP_ALLOW_UNTRUSTED_TLS": "Verifiera inte HTTPS-certifikat för antingen länkgranskare och skärmdumpsgenerering.",
  "MP_SMTP_BIND_ADDR": "SMTP-bindningsgränssnitt och port.",
  "MP_SMTP_AUTH_FILE": "Ange en lösenordsfil för SMTP-autentisering (se dokumentation).",
  "MP_SMTP_AUTH_ACCEPT_ANY": "Acceptera valfritt SMTP-användarnamn och lösenord, inklusive inget. Använd detta för att i princip tillåta allt.",
  "MP_SMTP_TLS_CERT": "TLS-certifikat för SMTP STARTTLS. Detta alternativ kräver att argumentet --smtp-tls-key eller miljövariabeln MP_SMTP_TLS_KEY är inställd.",
  "MP_SMTP_TLS_KEY": "TLS-nyckel för SMTP STARTTLS. Detta alternativ kräver att argumentet --smtp-tls-cert eller miljövariabeln MP_SMTP_TLS_CERT är inställd.",
  "MP_SMTP_REQUIRE_STARTTLS": "Kräv att alla SMTP-klienter använder STARTTLS-kryptering. Om inställt på true är de enda tillåtna kommandona NOOP, EHLO, STARTTLS och QUIT (enligt RFC 4954) tills anslutningen uppgraderas till STARTTLS.",
  "MP_SMTP_REQUIRE_TLS": "Kräv att alla SMTP-klienter använder SSL/TLS-kryptering. Om inställt på true måste alla anslutningar till SMTP-servern hanteras över TLS. Detta skiljer sig från STARTTLS som kräver att den initiala anslutningen är okrypterad. Observera att detta alternativ inaktiverar STARTTLS och kan minska klientkompatibiliteten.",
  "MP_SMTP_AUTH_ALLOW_INSECURE": "Vanligtvis är antingen STARTTLS eller TLS obligatoriskt för all SMTP-autentisering. Detta alternativ tillåter osäker PLAIN & LOGIN SMTP-autentisering när STARTTLS används.",
  "MP_SMTP_STRICT_RFC_HEADERS": "Tvinga Mailpit att returnera ett SMTP-fel om meddelandehuvuden innehåller \\n istället för \\r\\n radbrytningar. Som standard kommer Mailpit tyst att rätta till felaktiga radbrytningar som genereras av vissa trasiga sendmail-klienter (se relaterad Github-fråga).",
  "MP_SMTP_MAX_RECIPIENTS": "Maximalt antal SMTP-mottagare som tillåts per meddelande.",
  "MP_SMTP_ALLOWED_RECIPIENTS": "Tillåt endast SMTP-mottagare som matchar ett reguljärt uttryck. Använd detta för att begränsa inkommande e-post till endast de som skickas till en fördefinierad lista. Ett exempel skulle vara --smtp-allowed-recipients '{'@'}example.com$' för att endast tillåta e-post skickad till mottagare som slutar med {'@'}example.com.",
  "MP_SMTP_DISABLE_RDNS": "Inaktivera SMTP omvänd DNS-uppslagning. SMTP kommer som standard att försöka lösa värdnamnet för IP-adressen till den anslutande klienten, men i testnätverk kan detta ibland vara problematiskt och orsaka förseningar för varje levererat meddelande.",
  "MP_SMTP_RELAY_CONFIG": "SMTP-konfigurationsfil för att aktivera meddelanderelay/utsläpp (se dokumentation). Alternativt kan hela konfigurationen skickas via miljövariabler.",
  "MP_SMTP_RELAY_ALL": "Reläa automatiskt alla inkommande meddelanden via extern SMTP-server (se dokumentation). Använd med extrem försiktighet!",
  "MP_SMTP_RELAY_MATCHING": "Reläa automatiskt vissa inkommande meddelanden till matchande mottagare via extern SMTP-server (se dokumentation).",
  "MP_POP3_BIND_ADDR": "POP3-serverns bindningsgränssnitt och port.",
  "MP_POP3_AUTH_FILE": "Ange en lösenordsfil för POP3-autentisering (se dokumentation).",
  "MP_POP3_TLS_CERT": "TLS-certifikat för POP3 SSL/TLS. Detta alternativ kräver att argumentet --pop3-tls-key eller miljövariabeln MP_POP3_TLS_KEY är inställd.",
  "MP_POP3_TLS_KEY": "TLS-nyckel för POP3 SSL/TLS. Detta alternativ kräver att argumentet --pop3-tls-cert eller miljövariabeln MP_POP3_TLS_CERT är inställd.",
  "MP_TAG": "Automatisk taggning av nya meddelanden som matchar filter (se dokumentation).",
  "MP_TAGS_CONFIG": "Ladda taggfilter från yaml-konfigurationsfil (se dokumentation).",
  "MP_TAGS_TITLE_CASE": "Tvingar TitelCasing för alla nysskapade taggar (se dokumentation).",
  "MP_TAGS_DISABLE": "Inaktivera specifik automatisk taggning. Detta alternativ tar en kommaseparerad lista med alternativ (se dokumentation).",
  "MP_WEBHOOK_URL": "Anropa en webhook när nya meddelanden tas emot (se dokumentation), t.ex.: --webhook-url https://example.com/webhook.php.",
  "MP_WEBHOOK_LIMIT": "Begränsa webhook-förfrågningar per sekund. För att förhindra potentiell överbelastning av webhook-servern är detta som standard begränsat till maximalt 1 förfrågan per sekund (se dokumentation)."
}
