{
  "db_path": "Anger platsen där databasfiler skapas och hämtas",
  "env": "Konfigurerar instansens miljö. Värdet måste vara antingen `production` eller `development`.",
  "http_addr": "Adressen som HTTP-servern kommer att lyssna på.",
  "master_key": "Ställer in instansens huvudnyckel, skyddar automatiskt alla rutter utom GET /health.",
  "no_analytics": "Inaktiverar Meilisearch inbyggda telemetri när den anges.\nMeilisearch samlar automatiskt in data från alla instanser som inte väljer bort denna flagga.\nAll insamlad data används enbart för att förbättra Meilisearch och kan raderas när som helst.",
  "http_payload_size_limit": "Ställer in den maximala storleken för accepterade nyttolaster.",
  "log_level": "Definierar hur mycket detalj som ska finnas i Meilisearch loggar.\nMeilisearch stöder för närvarande sex loggnivåer, listade i ökande ordning av utförlighet: `OFF`, `ERROR`, `WARN`, `INFO`, `DEBUG`, `TRACE`",
  "max_indexing_memory": "Ställer in den maximala mängden RAM som Meilisearch kan använda vid indexering.",
  "max_indexing_threads": "Ställer in det maximala antalet trådar som Meilisearch kan använda under indexering.",
  "dump_dir": "Anger katalogen där Meilisearch kommer att skapa dumpfiler.",
  "import_dump": "Importerar dumpfilen som finns på den angivna sökvägen. Sökvägen måste peka på en .dump-fil.",
  "ignore_missing_dump": "Förhindrar att Meilisearch kastar ett fel när `import_dump` inte pekar på en giltig dumpfil.",
  "ignore_dump_if_db_exists": "Förhindrar att en Meilisearch-instans med en befintlig databas kastar ett fel när `import_dump` används.",
  "schedule_snapshot": "Aktiverar schemalagda ögonblicksbilder när sant, inaktiverar när falskt (standard).\nOm värdet anges som ett heltal aktiveras schemalagd ögonblicksbild med det angivna värdet som intervall mellan varje ögonblicksbild (i sekunder).",
  "snapshot_dir": "Anger katalogen där Meilisearch kommer att lagra ögonblicksbilder.",
  "import_snapshot": "Startar Meilisearch efter import av en tidigare genererad ögonblicksbild på den angivna filsökvägen.",
  "ignore_missing_snapshot": "Förhindrar att en Meilisearch-instans kastar ett fel när `import_snapshot` inte pekar på en giltig ögonblicksbildsfil.",
  "ignore_snapshot_if_db_exists": "Förhindrar att en Meilisearch-instans med en befintlig databas kastar ett fel när `import_snapshot` används.",
  "ssl_auth_path": "Aktiverar klientautentisering på den angivna sökvägen.",
  "ssl_cert_path": "Anger serverns SSL-certifikat.",
  "ssl_key_path": "Anger serverns SSL-nyckelfiler.",
  "ssl_ocsp_path": "Anger serverns OCSP-fil.",
  "ssl_require_auth": "Gör SSL-autentisering obligatorisk.",
  "ssl_resumption": "Aktiverar SSL-sessionsåterupptagning.",
  "ssl_tickets": "Aktiverar SSL-biljetter.",
  "experimental_enable_metrics": "Experimentell mätfunktion. Aktiverar Prometheus-mätvärden på `GET /metrics`-slutpunkten.",
  "experimental_reduce_indexing_memory_usage": "Experimentell minskning av minnesanvändning under indexering, använd inte i produktion.",
  "experimental_max_number_of_batched_tasks": "Experimentellt minskar det maximala antalet uppgifter som bearbetas samtidigt."
}
