{
  "MP_DATABASE": "Daimi veriləri saxlamaq üçün yerli verilənlər bazası faylını göstərin. Standart olaraq Mailpit bağlandıqda avtomatik silinən müvəqqəti fayldan istifadə edir. Əlavə olaraq, sənədlərdə göstərilən 'http ünvanı' ilə uzaqdakı rqlite verilənlər bazasından istifadə edilə bilər.",
  "MP_LABEL": "Bu Mailpit nümunəsini tanımaq üçün istəyə görə etiket təyin edin. Bu etiket veb interfeysinə, SMTP və POP3 serverlərinə əlavə olunur.",
  "MP_TENANT_ID": "Tenant ID (cədvəl prefiksi) təyin edin. Eyni verilənlər bazası faylını paylaşan digər Mailpit nümunələrindən məlumatları ayırmaq üçün istifadə olunur (bax sənədlər).",
  "MP_MAX_MESSAGES": "Saxlanacaq maksimum mesaj sayı. Bu limit keçildikdə Mailpit ən köhnə mesajları dövri olaraq silir. Avtomatik silməni söndürmək üçün 0 olaraq təyin edin (bax sənədlər).",
  "MP_MAX_AGE": "Mesajların saxlanacağı maksimum müddət. Saatla (məs: 36h) və ya günlərlə (məs: 14d) göstərilə bilər. Göstərilən müddətdən köhnə mesajlar silinir (bax sənədlər).",
  "MP_USE_MESSAGE_DATES": "SMTP ilə qəbul edilən tarix/saat əvəzinə mesaj başlığındakı tarix/saat məlumatından istifadə et.",
  "MP_IGNORE_DUPLICATE_IDS": "Message-Id dəyərinə əsasən təkrarlanan mesajları görməzdən gəl.",
  "MP_LOG_FILE": "Mailpit çıxışını stdout əvəzinə göstərilən fayla yaz. Nümunə: --log-file /yol/logfayli.log",
  "MP_QUIET": "Səssiz qeydiyyat (yalnız xətalar)",
  "MP_VERBOSE": "Ətraflı jurnallaşdırma (debug)",
  "MP_UI_BIND_ADDR": "Veb interfeysi üçün HTTP ünvanı və port.",
  "MP_WEBROOT": "Veb interfeysi və API üçün kök qovluğu təyin edin. Məsələn, 'mail' olaraq təyin edilərsə, http://0.0.0.0:8025/mail/ olur.",
  "MP_UI_AUTH_FILE": "Veb interfeysi və API üçün əsas autentifikasiya şifrə faylını göstərin (bax sənədlər).",
  "MP_UI_TLS_CERT": "Veb interfeysi və API üçün TLS sertifikatı. Bu seçim --ui-tls-key parametrini və ya MP_UI_TLS_KEY mühit dəyişənini tələb edir.",
  "MP_UI_TLS_KEY": "Veb interfeysi və API üçün TLS açar faylı. Bu seçim --ui-tls-cert parametrini və ya MP_UI_TLS_CERT mühit dəyişənini tələb edir.",
  "MP_API_CORS": "Çapraz domen brauzer sorğularına icazə vermək üçün API üçün Access-Control-Allow-Origin başlığını təyin edin.",
  "MP_BLOCK_REMOTE_CSS_AND_FONTS": "Mesajlarda xarici CSS və şrift fayllarının yüklənməsini brauzerdə blokla. Mailpit bunu HTTP Məzmun Təhlükəsizlik Siyasəti (CSP) vasitəsilə həyata keçirir. Uzaq şəkillər və bağlantılar bloklanmır.",
  "MP_ENABLE_SPAMASSASSIN": "Mesajların spam balını hesablamaq üçün SpamAssassin inteqrasiyasını aktivləşdir (bax sənədlər).",
  "MP_ALLOW_UNTRUSTED_TLS": "Bağlantı nəzarəti və ekran görüntüsü əməliyyatları üçün HTTPS sertifikatlarının doğrulanmasını söndür.",
  "MP_SMTP_BIND_ADDR": "SMTP üçün bağlantı ünvanı və port.",
  "MP_SMTP_AUTH_FILE": "SMTP autentifikasiyası üçün şifrə faylını göstərin (bax sənədlər).",
  "MP_SMTP_AUTH_ACCEPT_ANY": "İstənilən SMTP istifadəçi adı və şifrəsini qəbul et (boş da daxil). Hər şeyi qəbul etmək üçün istifadə olunur.",
  "MP_SMTP_TLS_CERT": "SMTP STARTTLS üçün TLS sertifikatı. Bu seçim --smtp-tls-key parametrini və ya MP_SMTP_TLS_KEY mühit dəyişənini tələb edir.",
  "MP_SMTP_TLS_KEY": "SMTP STARTTLS üçün TLS açarı. Bu seçim --smtp-tls-cert parametrini və ya MP_SMTP_TLS_CERT mühit dəyişənini tələb edir.",
  "MP_SMTP_REQUIRE_STARTTLS": "Bütün SMTP müştərilərinə STARTTLS şifrələməsini məcburi et. true olduqda yalnız NOOP, EHLO, STARTTLS və QUIT əmrlərinə icazə verilir.",
  "MP_SMTP_REQUIRE_TLS": "Bütün SMTP müştərilərinə SSL/TLS istifadəsini məcburi et. Bu parametr STARTTLS-i deaktiv edir və müştəri uyğunluğunu azalda bilər.",
  "MP_SMTP_AUTH_ALLOW_INSECURE": "Adətən bütün SMTP autentifikasiyası üçün STARTTLS və ya TLS tələb olunur. Bu seçim PLAIN və LOGIN kimi təhlükəsiz olmayan autentifikasiyalara icazə verir.",
  "MP_SMTP_STRICT_RFC_HEADERS": "Mesaj başlıqları \\n ehtiva edirsə SMTP xətası qaytar. Standart olaraq Mailpit bu səhv sətir sonlarını avtomatik düzəldir.",
  "MP_SMTP_MAX_RECIPIENTS": "Mesaj başına icazə verilən maksimum SMTP alıcısı sayı.",
  "MP_SMTP_ALLOWED_RECIPIENTS": "Yalnız müəyyən nümunəyə uyğun gələn SMTP alıcılarına icazə ver. Nümunə: --smtp-allowed-recipients '@example.com$'",
  "MP_SMTP_DISABLE_RDNS": "SMTP reverse DNS sorğularını söndür.",
  "MP_SMTP_RELAY_CONFIG": "Mesaj yönləndirməsini aktivləşdirmək üçün SMTP konfiqurasiya faylı.",
  "MP_SMTP_RELAY_ALL": "Bütün gələn mesajları xarici SMTP serveri üzərindən avtomatik yönləndir. Çox ehtiyatla istifadə edilməlidir!",
  "MP_SMTP_RELAY_MATCHING": "Uyğun gələn alıcılara bəzi mesajları xarici SMTP üzərindən yönləndir.",
  "MP_POP3_BIND_ADDR": "POP3 serveri üçün bağlantı ünvanı və port.",
  "MP_POP3_AUTH_FILE": "POP3 autentifikasiyası üçün şifrə faylını göstərin (bax sənədlər).",
  "MP_POP3_TLS_CERT": "POP3 SSL/TLS üçün TLS sertifikatı. Bu seçim --pop3-tls-key və ya MP_POP3_TLS_KEY mühit dəyişənini tələb edir.",
  "MP_POP3_TLS_KEY": "POP3 SSL/TLS üçün TLS açarı. Bu seçim --pop3-tls-cert və ya MP_POP3_TLS_CERT mühit dəyişənini tələb edir.",
  "MP_TAG": "Filtrlərə uyğun gələn yeni mesajlara avtomatik etiket əlavə et (bax sənədlər).",
  "MP_TAGS_CONFIG": "Etiket filtrlərini yaml konfiqurasiya faylından yüklə (bax sənədlər).",
  "MP_TAGS_TITLE_CASE": "Yeni yaradılan bütün etiketlərdə BaşlıqFormatını məcburi et.",
  "MP_TAGS_DISABLE": "Müəyyən avtomatik etiketləmələri söndür. Vergüllə ayrılmış siyahı qəbul edir.",
  "MP_WEBHOOK_URL": "Yeni mesaj qəbul edildikdə webhook çağır (bax sənədlər). Nümunə: --webhook-url https://example.com/webhook.php",
  "MP_WEBHOOK_LIMIT": "Webhook sorğularını saniyəlik limitlə. Serverin həddindən artıq yüklənməməsi üçün standart olaraq saniyədə 1 sorğu ilə məhdudlaşdırılır."
}
