{
  "MP_DATABASE": "Geben Sie den Dateinamen der lokalen Datenbank an, um persistente Daten zu speichern. Die Standardeinstellung ist eine lokale temporäre Datei, die automatisch gelöscht wird, wenn Mailpit beendet wird. Optional können Sie eine entfernte rqlite Datenbank verwenden, indem Sie eine „http-Adresse“ angeben (siehe docs).",
  "MP_LABEL": "Legen Sie eine optionale Bezeichnung fest, um diese Mailpit-Instanz zu identifizieren. Dies fügt das Label dem Web-UI, SMTP und POP3-Server hinzu.",
  "MP_TENANT_ID": "Legen Sie eine Tenant-ID (Tabellenpräfix) fest, mit der die Daten von anderen Mailpit-Instanzen isoliert werden können (siehe docs).",
  "MP_MAX_MESSAGES": "Maximale Anzahl der zu speichernden Nachrichten. Mailpit löscht in regelmäßigen Abständen die ältesten Nachrichten, wenn diese größer sind. Setzen Sie 0 um die automatische Löschung zu deaktivieren (siehe docs).",
  "MP_MAX_AGE": "Maximales Alter der Nachrichten, die in (h)ours oder (d)ays gespeichert werden sollen. Mailpit löscht in regelmäßigen Abständen die ältesten Nachrichten, wenn diese größer sind. Der Wert muss entweder in Stunden sein (Beispiel: --max-Alter 36h) oder Tagen (Beispiel: --max-Alter 14d) (siehe docs).",
  "MP_USE_MESSAGE_DATES": "Verwenden Sie das Datum des Nachrichtenkopfes als Empfangsdatum und -zeit anstelle des SMTP-Empfangsdatums und -zeiten.",
  "MP_IGNORE_DUPLICATE_IDS": "Ignoriere doppelte Nachrichten basierend auf Nachrichten-Ids.",
  "MP_LOG_FILE": "Mailpit-Ausgabe in Datei statt Stdout protokollieren. Beispiel: --log-file /path/to/logfile.log",
  "MP_QUIET": "Ruhige Protokollierung (nur Fehler)",
  "MP_VERBOSE": "Ausführliches Protokollieren (Debug)",
  "MP_UI_BIND_ADDR": "HTTP-Schnittstelle und Port für die Benutzeroberfläche.",
  "MP_WEBROOT": "Legen Sie den Webroot für die Web-Benutzeroberfläche und die API fest. Für E-Mails würde dies beispielsweise zu http://0.0.0.0:8025/mail/ führen.",
  "MP_UI_AUTH_FILE": "Geben Sie eine Passwortdatei für die Web-UI & API Basis-Authentifizierung an (siehe docs).",
  "MP_UI_TLS_CERT": "TLS-Zertifikat für Web-UI & API (Beispiel: HTTPS). Diese Option setzt das Argument --ui-tls-key oder die Umgebungsvariable MP_UI_TLS_KEY voraus.",
  "MP_UI_TLS_KEY": "TLS-Schlüssel für Web-UI & API (z.B. HTTPS). Diese Option setzt das --ui-tls-cert Argument oder die MP_UI_TLS_CERT Umgebungsvariable voraus.",
  "MP_API_CORS": "Legen Sie API CORS Access-Control-Allow-Origin Header fest, wenn Sie Domain-übergreifende Browseranfragen benötigen.",
  "MP_BLOCK_REMOTE_CSS_AND_FONTS": "Blockieren Sie den Zugriff des Browsers auf Remote CSS und Schriftarten, die über Nachrichtenstile importiert werden. Mailpit verwendet die Methode der HTTP Content Security Policy (CSP), um diese zu blockieren. Dies blockiert keine entfernten Bilder oder klickt auf einen externen Link.",
  "MP_ENABLE_SPAMASSASSIN": "SpamAssassin-Integration für Spamminess-Score aktivieren (siehe docs).",
  "MP_ALLOW_UNTRUSTED_TLS": "Überprüfen Sie die HTTPS-Zertifikate nicht für die Linkprüfung & Screenshot-Generation.",
  "MP_SMTP_BIND_ADDR": "SMTP Bind Schnittstelle und Port.",
  "MP_SMTP_AUTH_FILE": "Geben Sie eine Passwortdatei für die SMTP-Authentifizierung an (siehe docs).",
  "MP_SMTP_AUTH_ACCEPT_ANY": "Akzeptieren Sie jeden SMTP-Benutzernamen und Passwort, einschließlich keiner. Verwenden Sie dies, um im Grunde alles zu erlauben.",
  "MP_SMTP_TLS_CERT": "TLS-Zertifikat für SMTP STARTTLS. Diese Option setzt das Argument --smtp-tls-key oder die Umgebungsvariable MP_SMTP_TLS_KEY voraus.",
  "MP_SMTP_TLS_KEY": "TLS-Schlüssel für SMTP STARTTLS. Diese Option setzt das --smtp-tls-cert Argument oder die MP_SMTP_TLS_CERT Umgebungsvariable voraus.",
  "MP_SMTP_REQUIRE_STARTTLS": "Alle SMTP-Clients müssen STARTTLS-Verschlüsselung verwenden. Wenn auf \"true\" gesetzt, sind die einzigen erlaubten Befehle NOOP, EHLO, STARTTLS und QUIT (wie in RFC 4954) festgelegt, bis die Verbindung auf STARTTLS aktualisiert wird.",
  "MP_SMTP_REQUIRE_TLS": "Alle SMTP-Clients müssen SSL/TLS-Verschlüsselung verwenden. Wenn auf \"true\" gesetzt, müssen alle Verbindungen zum SMTP-Server über TLS abgewickelt werden. Dies unterscheidet sich von STARTTLS und erfordert eine unverschlüsselte Verbindung. Beachten Sie, dass diese Option STARTTLS deaktiviert und die Client-Kompatibilität verringern kann.",
  "MP_SMTP_AUTH_ALLOW_INSECURE": "Normalerweise wird STARTTLS oder TLS für alle SMTP-Authentifizierungen erzwungen. Diese Option ermöglicht eine unsichere PLAIN & LOGIN SMTP Authentifizierung bei der Verwendung von STARTTLS.",
  "MP_SMTP_STRICT_RFC_HEADERS": "Mailpit zwingen, einen SMTP-Fehler zurückzugeben, wenn Nachrichtenheader \\n statt \\r\\n Zeilenumbrüche enthalten. Standardmäßig korrigiert Mailpit fehlerhafte Zeilenumbrüche, die von einigen defekten Sendmail-Clients generiert wurden (siehe das verwandte GitHub Problem).",
  "MP_SMTP_MAX_RECIPIENTS": "Maximale Anzahl von SMTP-Empfängern pro Nachricht.",
  "MP_SMTP_ALLOWED_RECIPIENTS": "Erlauben Sie nur SMTP-Empfängern, die einem regulären Ausdruck entsprechen. Verwenden Sie dies, um eingehende E-Mails nur auf diejenigen zu beschränken, die an eine vordefinierte Liste gesendet werden. Ein Beispiel wäre --smtp-allowed-recipients '{'@'}example.com$', um nur E-Mails an Empfänger zu erlauben, die in {'@'}example.com enden.",
  "MP_SMTP_DISABLE_RDNS": "SMTP Reverse-DNS-Lookups deaktivieren. SMTP wird standardmäßig den Hostnamen der IP-Adresse des verbindenden Clients auflösen, in Testnetzen kann dies jedoch manchmal problematisch sein und Verzögerungen für jede Nachricht verursachen.",
  "MP_SMTP_RELAY_CONFIG": "Die SMTP-Konfigurationsdatei zur Aktivierung des Nachrichtenrelays/Releases (siehe docs). Alternativ kann die gesamte Konfiguration über Umgebungsvariablen übergeben werden.",
  "MP_SMTP_RELAY_ALL": "Alle eingehenden Nachrichten automatisch über einen externen SMTP-Server weiterleiten (siehe docs). Mit äußerster Vorsicht!",
  "MP_SMTP_RELAY_MATCHING": "Automatisch eingehende Nachrichten über einen externen SMTP-Server an passende Empfänger weiterleiten (siehe docs).",
  "MP_POP3_BIND_ADDR": "POP3 Server Bind Schnittstelle und Port.",
  "MP_POP3_AUTH_FILE": "Geben Sie eine Passwortdatei für die POP3-Authentifizierung an (siehe docs).",
  "MP_POP3_TLS_CERT": "TLS Zertifikat für POP3 SSL/TLS. Diese Option setzt das Argument --pop3-tls-key oder die Umgebungsvariable MP_POP3_TLS_KEY voraus.",
  "MP_POP3_TLS_KEY": "TLS-Schlüssel für POP3 SSL/TLS. Diese Option setzt das --pop3-tls-cert Argument oder die MP_POP3_TLS_CERT Umgebungsvariable voraus.",
  "MP_TAG": "Automatische Markierung neuer Nachrichten mit passenden Filtern (siehe docs).",
  "MP_TAGS_CONFIG": "Lade Tag-Filter aus der Konfigurationsdatei yaml (siehe docs).",
  "MP_TAGS_TITLE_CASE": "Erzwingt TitleCasing für alle neu erstellten Tags (siehe docs).",
  "MP_TAGS_DISABLE": "Deaktiviere bestimmte Auto-Taggings. Diese Option benötigt eine durch Kommas getrennte Liste von Optionen (siehe docs).",
  "MP_WEBHOOK_URL": "Aufruf eines Webhooks, wenn neue Nachrichten empfangen werden (siehe docs). Beispiel: --webhook-url https://example.com/webhook.php",
  "MP_WEBHOOK_LIMIT": "Begrenzte Anzahl von Webhook-Anfragen pro Sekunde. Um eine mögliche Überlastung des Webhook-Servers zu verhindern, ist die Anzahl standardmäßig auf maximal 1 Anfrage pro Sekunde begrenzt. (siehe docs)."
}
