{
  "working_dir": "Arbeitsverzeichnis",
  "db_path": "Legt den Speicherort fest, an dem Datenbankdateien erstellt und abgerufen werden sollen",
  "env": "Konfiguriert die Instanzumgebung. Der Wert muss entweder `production` oder `development` sein.",
  "http_addr": "Die Adresse, auf der der HTTP-Server lauschen wird.",
  "master_key": "Legt den Masterschlüssel der Instanz fest und schützt automatisch alle Routen außer GET/Gesundheit.",
  "no_analytics": "Deaktiviert Meilisearchs eingebaute Telemetrie.\nMeilisearch sammelt automatisch Daten von allen Instanzen, die nicht mit dieser Flagge aussteigen.\nAlle gesammelten Daten werden ausschließlich zur Verbesserung der Meilisearch verwendet und können jederzeit gelöscht werden.",
  "http_payload_size_limit": "Legt die maximale Größe der akzeptierten Nutzlast fest.",
  "log_level": "Legt fest, wie viele Details in Meilisearchs Protokollen enthalten sein sollen.\nMeilisearch unterstützt derzeit sechs Log-Levels, die in der Reihenfolge der Erhöhung der Ausführlichkeit aufgelistet sind: `OFF`, `ERROR`, `WARN`, `INFO`, `DEBUG`, `TRACE`",
  "max_indexing_memory": "Legt die maximale Menge an RAM Meilisearch fest, die beim Indizieren verwendet werden kann.",
  "max_indexing_threads": "Legt die maximale Anzahl der Threads fest, die Meilisearch während der Indizierung verwenden kann.",
  "dump_dir": "Legt das Verzeichnis fest, in dem Meilisearch Dump Dateien erstellt.",
  "import_dump": "Importiert die Dump-Datei am angegebenen Pfad. Der Pfad muss auf eine .dump Datei zeigen.",
  "ignore_missing_dump": "Verhindert, dass Meilisearch einen Fehler wirft, wenn `import_dump` nicht auf eine gültige Dump-Datei verweist.",
  "ignore_dump_if_db_exists": "Verhindert, dass eine Meilisearch-Instanz mit einer existierenden Datenbank bei `import_dump` einen Fehler auswirft.",
  "schedule_snapshot": "Aktiviert geplante Snapshots wenn \"true\" ist, deaktivieren wenn \"false\" (der Standard).\nwenn der Wert als Ganzzahl angegeben wird, aktiviert dann den geplanten Schnappschuss mit dem übergebenen Wert als Intervall zwischen jedem Snapshot, in Sekunden.",
  "snapshot_dir": "Legt das Verzeichnis fest, in dem Meilisearch Snapshots speichert.",
  "import_snapshot": "Startet Meilisearch nach dem Importieren eines zuvor generierten Snapshots im angegebenen Dateipfad.",
  "ignore_missing_snapshot": "Verhindert, dass eine Meilisearch-Instanz einen Fehler auswirft, wenn `import_snapshot` nicht auf eine gültige Snapshot-Datei zeigt.",
  "ignore_snapshot_if_db_exists": "Verhindert bei `import_snapshot` eine Meilisearch-Instanz mit einer existierenden Datenbank.",
  "ssl_auth_path": "Aktiviert die Clientauthentifizierung im angegebenen Pfad.",
  "ssl_cert_path": "Legt die SSL-Zertifikate des Servers fest.",
  "ssl_key_path": "Legt die SSL-Schlüsseldateien des Servers fest.",
  "ssl_ocsp_path": "Legt die OCSP-Datei des Servers fest.",
  "ssl_require_auth": "Macht SSL Authentifizierung obligatorisch.",
  "ssl_resumption": "Aktiviert die Wiederaufnahme der SSL-Sitzung.",
  "ssl_tickets": "Aktiviert SSL-Tickets.",
  "experimental_enable_metrics": "Experimentelle Metriken Funktion. Aktiviert die Prometheus-Metriken am 'GET /metrics`-Endpunkt.",
  "experimental_reduce_indexing_memory_usage": "Experimentelle RAM-Reduzierung während der Indizierung, nicht in einer Produktivumgebung verwenden.",
  "experimental_max_number_of_batched_tasks": "Reduziert experimentell die maximale Anzahl von Aufgaben, die gleichzeitig verarbeitet werden."
}
