{
  "MP_DATABASE": "Specificeer de lokale databasebestandsnaam voor het opslaan van persistente gegevens. De standaard is een lokaal tijdelijk bestand dat automatisch wordt verwijderd wanneer Mailpit wordt afgesloten. U kunt optioneel een externe rqlite database gebruiken door een “http adres” op te geven (zie documenten).",
  "MP_LABEL": "Stel een optioneel label in om de mailpit instantie te identificeren. Hiermee wordt het label toegevoegd aan de webUI, SMTP en POP3 servers.",
  "MP_TENANT_ID": "Stel een tenant ID in (tabel voorvoegsel). Dit wordt gebruikt om de gegevens te isoleren van andere Mailpit instanties die dezelfde gegevensbestand delen (zie docs).",
  "MP_MAX_MESSAGES": "Maximum aantal berichten om op te slaan. Mailpit zal periodiek de oudste berichten verwijderen indien groter dan dit. Stel in op 0 om automatisch verwijderen uit te schakelen (zie documenten).",
  "MP_MAX_AGE": "Maximale leeftijd van berichten om op te slaan in (u)onze of (d)ays. Mailpit zal periodiek de oudste berichten verwijderen als deze groter zijn. De waarde moet zijn in uren (Example: --max-leeftijd 36h) of dagen (Example: --max-leeftijd 14d) (zie docs).",
  "MP_USE_MESSAGE_DATES": "Gebruik de datum waarop de mailbox ontvangen is en tijd in plaats van de SMTP-ontvangende datum en tijd.",
  "MP_IGNORE_DUPLICATE_IDS": "Dubbele berichten op basis van berichten-id negeren.",
  "MP_LOG_FILE": "Log Mailpit uitvoer naar bestand in plaats van stdout. Voorbeeld: --log-file /path/to/logfile.log",
  "MP_QUIET": "Stille registratie (alleen fouten)",
  "MP_VERBOSE": "Uitgebreide logboekregistratie (debug)",
  "MP_UI_BIND_ADDR": "HTTP bind interface en poort voor UI.",
  "MP_WEBROOT": "Stel de webroot in voor web UI & API, bijvoorbeeld mail zou resulteren in http://0.0.0:8025/mail/.",
  "MP_UI_AUTH_FILE": "Geef een wachtwoord bestand op voor de basisauthenticatie van de web UI & API (zie documenten).",
  "MP_UI_TLS_CERT": "TLS certificaat voor web UI & API (vb: HTTPS). Deze optie vereist dat de --ui-tls-key argument of MP_UI_TLS_KEY omgeving variabele is ingesteld.",
  "MP_UI_TLS_KEY": "TLS sleutel voor web UI & API (vb: HTTPS). Deze optie vereist dat de --ui-tls-cert argument of MP_UI_TLS_CERT omgeving variabele is ingesteld.",
  "MP_API_CORS": "Stel de API CORS Access-Control-Allow-Origin header in als u cross-domain browser verzoeken vereist.",
  "MP_BLOCK_REMOTE_CSS_AND_FONTS": "Blokkeer alle geimporteerde browsertoegang tot externe CSS en lettertypen die zijn geïmporteerd via berichtstijlbladen. Mailpit maakt gebruik van de HTTP Content Security Policy (CSP) methode om deze te blokkeren. Dit blokkeert geen externe afbeeldingen of klikt op een externe link.",
  "MP_ENABLE_SPAMASSASSIN": "Schakel SpamAssassin integratie in voor spamminess score (zie docs).",
  "MP_ALLOW_UNTRUSTED_TLS": "Verifieer de HTTPS-certificaten niet voor de productie van de link checker en screenshot",
  "MP_SMTP_BIND_ADDR": "SMTP verbinding interface en poort",
  "MP_SMTP_AUTH_FILE": "Geef een wachtwoord bestand op voor SMTP authenticatie (zie documenten).",
  "MP_SMTP_AUTH_ACCEPT_ANY": "Accepteer elke SMTP-gebruikersnaam en wachtwoord, inclusief geen wachtwoord. Gebruik dit om in principe alles toe te staan.",
  "MP_SMTP_TLS_CERT": "TLS certificaat voor SMTP STARTTLS. Deze optie vereist dat de --smtp-tls-sleutelargument of MP_SMTP_TLS_KEY omgevingsvariabele wordt ingesteld.",
  "MP_SMTP_TLS_KEY": "TLS sleutel voor SMTP STARTTLS. Deze optie vereist dat het --smtp-tls-cert argument of MP_SMTP_TLS_CERT omgevingsvariabele wordt ingesteld.",
  "MP_SMTP_REQUIRE_STARTTLS": "Alle SMTP-clients vereisen om STARTTLS encryptie te gebruiken. Indien ingeschakeld zijn de enige toegestane commando's NOOP, EHLO, STARTTLS en QUIT (zoals aangegeven in RFC 4954) totdat de verbinding geüpgraded is naar STARTTLS.",
  "MP_SMTP_REQUIRE_TLS": "Alle SMTP-clients verplichten om SSL/TLS-versleuteling te gebruiken. Indien ingeschakeld moeten alle verbindingen met de SMTP-server via TLS worden afgehandeld. Dit is anders dan STARTTLS waar de initiële verbinding niet gecodeerd moet zijn. Merk op dat deze optie STARTTLS uitschakelt en de compatibiliteit van de client kan verminderen.",
  "MP_SMTP_AUTH_ALLOW_INSECURE": "STARTTLS of TLS wordt meestal afgedwongen voor alle SMTP authenticatie. Deze optie maakt onveilige PLAIN & LOGIN SMTP-authenticatie mogelijk bij het gebruik van STARTTLS.",
  "MP_SMTP_STRICT_RFC_HEADERS": "Forceer Mailpit om een SMTP-fout terug te geven als de berichtheaders \\n bevatten in plaats daarvan \\r\\n regeleinden. Standaard wordt Mailpit zonder meer onjuiste regeleinden hersteld die gegenereerd zijn door sommige kapotte sendmail cliënten (zie gerelateerde GitHub issue).",
  "MP_SMTP_MAX_RECIPIENTS": "Maximum aantal SMTP-ontvangers per bericht toegestaan.",
  "MP_SMTP_ALLOWED_RECIPIENTS": "Alleen SMTP-ontvangers die overeenkomen met een reguliere expressie. Gebruik dit om inkomende mail te beperken tot alleen degenen die naar een vooraf gedefinieerde lijst worden verzonden. Een voorbeeld zou een --smtp-allowed-ontvangers '{'@'}example.com$' zijn om alleen e-mails die naar ontvangers verzonden worden in {'@'}example.com toe te staan.",
  "MP_SMTP_DISABLE_RDNS": "Uitschakelen SMTP reverse DNS lookups. SMTP probeert standaard de hostnaam van het IP-adres van de verbinding op te lossen, In testnetwerken kan dit echter soms problematisch zijn, waardoor vertragingen kunnen ontstaan voor elke verzonden berichten.",
  "MP_SMTP_RELAY_CONFIG": "SMTP-configuratiebestand om bericht-relay/release mogelijk te maken (zie docs). Als alternatief kan de gehele configuratie worden doorgegeven via omgevingsvariabelen.",
  "MP_SMTP_RELAY_ALL": "Automatisch alle inkomende berichten opnieuw afspelen via externe SMTP-server (zie documenten). Gebruik met uiterste voorzichtigheid!",
  "MP_SMTP_RELAY_MATCHING": "Enkele inkomende berichten automatisch doorverwijzen naar overeenkomende geadresseerden via een externe SMTP-server (zie documenten).",
  "MP_POP3_BIND_ADDR": "POP3-server is verbonden met interface en poort",
  "MP_POP3_AUTH_FILE": "Geef een wachtwoord op voor POP3-authenticatie (zie documenten).",
  "MP_POP3_TLS_CERT": "TLS certificaat voor POP3 SSL/TLS. Deze optie vereist dat de --pop3-tls-sleutelargument of MP_POP3_TLS_KEY omgeving variabele is ingesteld.",
  "MP_POP3_TLS_KEY": "TLS sleutel voor POP3 SSL/TLS. Deze optie vereist dat het --pop3-tls-cert argument of MP_POP3_TLS_CERT omgeving variabele is ingesteld.",
  "MP_TAG": "Auto-tag nieuwe berichten die overeenkomen met filters (zie docs).",
  "MP_TAGS_CONFIG": "Tags filters uit yaml configuratiebestand laden (zie documenten).",
  "MP_TAGS_TITLE_CASE": "Forceer TitleCasing voor alle nieuw gecreëerde tags (zie documenten).",
  "MP_TAGS_DISABLE": "Schakel specifieke auto-tags uit. Deze optie vereist een komma gescheiden lijst van opties (zie docs).",
  "MP_WEBHOOK_URL": "Bel een webhook wanneer nieuwe berichten worden ontvangen (zie docs). Voorbeeld: --webhook-url https://example.com/webhook.php",
  "MP_WEBHOOK_LIMIT": "Beoordeel beperkte webhook aanvragen per seconde. Om te voorkomen dat de webhook server mogelijk overbelast kan worden, is deze snelheid standaard beperkt tot maximaal 1 verzoek per seconde (zie documenten)."
}
