{
  "working_dir": "Werken Map",
  "db_path": "Noteert de locatie waar databasebestanden worden gemaakt en opgehaald",
  "env": "Configureert de instance's omgeving. Waarde moet `productie` of `development` zijn.",
  "http_addr": "Het adres waarop de HTTP-server zal luisteren.",
  "master_key": "Stelt de hoofdsleutel van de instantie in, beschermt automatisch alle routes behalve GET /gezondheid.",
  "no_analytics": "Deactiveert Meilisearch's ingebouwde telemetrie wanneer beschikbaar.\nMeilisdeficiëntie verzamelt automatisch gegevens van alle instanties die zich niet afmelden met behulp van deze vlag.\nAlle verzamelde gegevens worden uitsluitend gebruikt om de Meilisearch te verbeteren, en kunnen op elk moment worden verwijderd.",
  "http_payload_size_limit": "Stelt de maximale grootte in van geaccepteerde payloads.",
  "log_level": "Definieert hoeveel details er aanwezig moeten zijn in Meilisearch's logs.\nMeilis！ ondersteunt momenteel zes logniveaus, in volgorde van vermeerdering van groot: `OFF`, `ERROR`, `WAARSCHU`, `INFO`, `DEBUG`, `TRACE`",
  "max_indexing_memory": "Stelt het maximum aantal RAM Meilis！ kan worden gebruikt tijdens indexering.",
  "max_indexing_threads": "Stelt het maximum aantal threads Meilissolving in tijdens het indexeren.",
  "dump_dir": "Stelt de map in waar Meilis dump bestanden zal maken.",
  "import_dump": "Importeert het dumpen bestand op het opgegeven pad. Pad moet naar een .dump bestand wijzen.",
  "ignore_missing_dump": "Voorkomt dat Meilishus een fout gooit wanneer `import_dump` niet wijst naar een geldig dump bestand.",
  "ignore_dump_if_db_exists": "Voorkomt dat een Meilis instantie met een bestaande database een fout gooit bij het gebruik van `import_dump`.",
  "schedule_snapshot": "Schakelt geplande snapshots in wanneer waar, uitschakelen wanneer niet waar (de standaard)\nAls de waarde als een geheel getal wordt gegeven, zet vervolgens de geplande momentopname met de doorgegeven waarde als het interval tussen elke snapshot, in seconden.",
  "snapshot_dir": "Stelt de map in waar Meilist snapshots zal opslaan.",
  "import_snapshot": "Lanceert Meilis！ na het importeren van een eerder gegenereerde snapshot op het gegeven bestandspad.",
  "ignore_missing_snapshot": "Voorkomt dat een Meilissolving instance een fout gooit wanneer `import_snapshot` niet verwijst naar een geldig snapshot bestand.",
  "ignore_snapshot_if_db_exists": "Voorkomt dat een Meilis instantie met een bestaande database een fout gooit bij het gebruik van `import_snapshot`.",
  "ssl_auth_path": "Maakt client-authenticatie in het opgegeven pad mogelijk.",
  "ssl_cert_path": "Stelt de SSL van de server certificaten in.",
  "ssl_key_path": "Stelt de SSL key bestanden van de server in.",
  "ssl_ocsp_path": "Stelt het OCSP-bestand van de server in.",
  "ssl_require_auth": "Maakt SSL authenticatie verplicht.",
  "ssl_resumption": "Activeert SSL sessie hervatten.",
  "ssl_tickets": "Activeert SSL tickets.",
  "experimental_enable_metrics": "Experimentele metrieken functie. Schakelt de Prometheus statistieken in op het 'GET /metrics' eindpunt.",
  "experimental_reduce_indexing_memory_usage": "Experimentele RAM reductie tijdens het indexeren, niet gebruiken in productie.",
  "experimental_max_number_of_batched_tasks": "Experimenteel reduceert het maximum aantal taken dat tegelijk zal worden verwerkt."
}
