{
  "MINIO_ADDRESS": "Bindt het minio serverproces aan een specifiek netwerkadres en poortnummer.",
  "MINIO_CONSOLE_ADDRESS": "Specificeert een statische poort voor de ingesloten MinIO Console.",
  "MINIO_CERTS_DIR": "Specificeert het pad naar de map met certificaten die het minio-proces gebruikt om TLS/SSL-verbinding te configureren.",
  "MINIO_ROOT_USER": "Root-gebruiker. Standaard ingesteld op minioadmin",
  "MINIO_ROOT_PASSWORD": "Root user wachtwoord. Standaard ingesteld op minioadmin",
  "MINIO_SITE_NAME": "naam voor de site b.v. \"cal-rack0\"",
  "MINIO_SITE_REGION": "naam van de locatie van de server, bijv. \"us-west-1\"",
  "MINIO_SITE_COMMENT": "Optioneel een opmerking aan deze instelling toevoegen",
  "MINIO_STORAGE_CLASS_STANDARD": "stel het parity aantal in voor standaard opslag klasse bijv. \"EC:4\"",
  "MINIO_STORAGE_CLASS_RRS": "stel het parity aantal in voor verminderde redundantie opslag klasse b.v. \"EC:2\"",
  "MINIO_ETCD_ENDPOINTS": "komma gescheiden lijst van etcd eindpunten b.v. \"http://localhost:2379\"",
  "MINIO_ETCD_PATH_PREFIX": "namespace prefix om de tenants te isoleren, bijvoorbeeld \"customer1/\"",
  "MINIO_API_REQUESTS_MAX": "stel het maximale aantal gelijktijdige verzoeken in (standaard: 'auto')",
  "MINIO_API_CLUSTER_DEADLINE": "de deadline voor clustergereedschapcontrole instellen (standaard: '10s')",
  "MINIO_API_CORS_ALLOW_ORIGIN": "stel een door komma's gescheiden lijst van herkomst in (standaard: '*')",
  "MINIO_API_REMOTE_TRANSPORT_DEADLINE": "de deadline voor API-aanvragen voor externe transporten instellen tijdens proxying tussen federated instanties (standaard: '2u')",
  "MINIO_API_LIST_QUORUM": "het aanvaardbare quorum voor de werking van de lijst (bijv. \"optimal\", \"reduceerd\", \"schijf\", \"strict\", \"auto\" (standaard: 'strict')",
  "MINIO_API_REPLICATION_PRIORITY": "stel replicatieprioriteit in (standaard: 'auto')",
  "MINIO_API_REPLICATION_MAX_WORKERS": "stel het maximale aantal replicatie werknemers in (standaard: '500')",
  "MINIO_API_TRANSITION_WORKERS": "stel het aantal overgangswerkers in (standaard: '100')",
  "MINIO_API_STALE_UPLOADS_EXPIRY": "maak vervallen van meerdelige uploads ouder dan deze waarden (standaard: '24u')",
  "MINIO_API_STALE_UPLOADS_CLEANUP_INTERVAL": "verander intervallen wanneer verouderde multipart uploads verlopen zijn (standaard: '6u')",
  "MINIO_API_DELETE_CLEANUP_INTERVAL": "verander intervallen wanneer verwijderde objecten permanent uit de map \".trash\" worden verwijderd (standaard: '5m')",
  "MINIO_API_ODIRECT": "inschakelen of uitschakelen O_DIRECT voor schrijvingen onder speciale omstandigheden. Opmerking: schakel O_DIRECT niet uit zonder voorafgaande test (standaard: 'op')",
  "MINIO_API_ROOT_ACCESS": "schakel 'uit' root-toegang voor alle API-oproepen uit, inclusief s3, beheer bewerkingen (standaard: 'aan')",
  "MINIO_API_SYNC_EVENTS": "zet om synchrone bucket meldingen in te schakelen (standaard: 'off')",
  "MINIO_API_OBJECT_MAX_VERSIONS": "stel het maximale aantal versies per object in (standaard: '9223372036854775807')",
  "MINIO_BROWSER": "In- of uitschakelen van toegang tot de console web UI. Standaard is deze ingesteld op 'aan'",
  "MINIO_DOMAIN": "schakel virtueel-host-stijl verzoeken in, bijv. \"mijndomein.com\" of meerdere domeinen met door komma's gescheiden waarden, bijv. \"sub1.mijndomein.com,sub2.mydomain.com\""
}
