{
  "MINIO_ADDRESS": "Vincula o processo do servidor minio a um endereço de rede e número de porta específicos.",
  "MINIO_CONSOLE_ADDRESS": "Especifica uma porta estática para o Console MinIO incorporado.",
  "MINIO_CERTS_DIR": "Especifica o caminho para a pasta contendo certificados que o processo minio usa para configurar conectividade TLS/SSL.",
  "MINIO_ROOT_USER": "Usuário root. Padrão é minioadmin",
  "MINIO_ROOT_PASSWORD": "Senha do usuário root. Padrão é minioadmin",
  "MINIO_SITE_NAME": "nome para o site ex. \"cal-rack0\"",
  "MINIO_SITE_REGION": "nome da localização do servidor ex. \"us-west-1\"",
  "MINIO_SITE_COMMENT": "opcionalmente adicione um comentário a esta configuração",
  "MINIO_STORAGE_CLASS_STANDARD": "defina a contagem de paridade para classe de armazenamento padrão ex. \"EC:4\"",
  "MINIO_STORAGE_CLASS_RRS": "defina a contagem de paridade para classe de armazenamento de redundância reduzida ex. \"EC:2\"",
  "MINIO_STORAGE_CLASS_COMMENT": "opcionalmente adicione um comentário a esta configuração",
  "MINIO_ETCD_ENDPOINTS": "lista separada por vírgulas de endpoints etcd ex. \"http://localhost:2379\"",
  "MINIO_ETCD_PATH_PREFIX": "prefixo de namespace para isolar inquilinos ex. \"customer1/\"",
  "MINIO_ETCD_COREDNS_PATH": "registros DNS de bucket compartilhado, padrão é \"/skydns\"",
  "MINIO_ETCD_CLIENT_CERT": "certificado de cliente para autenticação mTLS",
  "MINIO_ETCD_CLIENT_CERT_KEY": "chave do certificado de cliente para autenticação mTLS",
  "MINIO_ETCD_COMMENT": "opcionalmente adicione um comentário a esta configuração",
  "MINIO_API_REQUESTS_MAX": "defina o número máximo de solicitações concorrentes (padrão: 'auto')",
  "MINIO_API_CLUSTER_DEADLINE": "defina o prazo para verificação de prontidão do cluster (padrão: '10s')",
  "MINIO_API_CORS_ALLOW_ORIGIN": "defina lista separada por vírgulas de origens permitidas para solicitações CORS (padrão: '*')",
  "MINIO_API_REMOTE_TRANSPORT_DEADLINE": "defina o prazo para solicitações API em transportes remotos ao fazer proxy entre instâncias federadas ex. \"2h\" (padrão: '2h')",
  "MINIO_API_LIST_QUORUM": "defina o quorum aceitável esperado para operações de lista ex. \"optimal\", \"reduced\", \"disk\", \"strict\", \"auto\" (padrão: 'strict')",
  "MINIO_API_REPLICATION_PRIORITY": "defina prioridade de replicação (padrão: 'auto')",
  "MINIO_API_REPLICATION_MAX_WORKERS": "defina o número máximo de workers de replicação (padrão: '500')",
  "MINIO_API_TRANSITION_WORKERS": "defina o número de workers de transição (padrão: '100')",
  "MINIO_API_STALE_UPLOADS_EXPIRY": "defina para expirar uploads multipart obsoletos mais antigos que estes valores (padrão: '24h')",
  "MINIO_API_STALE_UPLOADS_CLEANUP_INTERVAL": "defina para alterar intervalos quando uploads multipart obsoletos são expirados (padrão: '6h')",
  "MINIO_API_DELETE_CLEANUP_INTERVAL": "defina para alterar intervalos quando objetos excluídos são permanentemente excluídos da pasta \".trash\" (padrão: '5m')",
  "MINIO_API_ODIRECT": "defina para habilitar ou desabilitar O_DIRECT para escritas sob condições especiais. NOTA: não desabilite O_DIRECT sem testes prévios (padrão: 'on')",
  "MINIO_API_ROOT_ACCESS": "desative o acesso de credencial root para todas as chamadas API incluindo s3, operações admin (padrão: 'on')",
  "MINIO_API_SYNC_EVENTS": "defina para habilitar notificações de bucket síncronas (padrão: 'off')",
  "MINIO_API_OBJECT_MAX_VERSIONS": "defina número máximo permitido de versões por objeto (padrão: '9223372036854775807')",
  "MINIO_BROWSER": "Habilite ou desabilite acesso à interface web do console. Por padrão está definido como 'on'",
  "MINIO_DOMAIN": "habilite solicitações estilo virtual-host ex. \"mydomain.com\" ou múltiplos domínios com valores separados por vírgula ex. \"sub1.mydomain.com,sub2.mydomain.com\""
}
