{
  "MP_DATABASE": "Angiv det lokale databasefilnavn til lagring af vedvarende data. Standard er en lokal midlertidig fil som slettes automatisk når Mailpit afsluttes. Du kan eventuelt bruge en ekstern rqlite database ved at angive en “http adresse” (se docs).",
  "MP_LABEL": "Angiv en valgfri etiket til at identificere denne Mailpit instans. Dette tilføjer etiketten til web- UI-, SMTP - og POP3- servere.",
  "MP_TENANT_ID": "Angiv et leje- ID (tabelpræfiks). Dette bruges til at isolere data fra andre Mailpit forekomster, der deler den samme datafil (se dokumenter).",
  "MP_MAX_MESSAGES": "Maksimalt antal breve der skal gemmes. Mailpit sletter periodisk de ældste breve, hvis større end denne. Sæt til 0 for at deaktivere autosletning (se dokumenter).",
  "MP_MAX_AGE": "Maksimal alder for breve der skal gemmes i enten h)ours eller (d)ays. Mailpit vil periodisk slette de ældste breve, hvis større end dette. Værdien skal enten være i timer (Eksempel: --max-alder 36h) eller dage (Eksempel: --max-alder 14d) (se docs).",
  "MP_USE_MESSAGE_DATES": "Brug breveheader- dato som den modtagne e- mail- dato & tid i stedet for den SMTP- modtagne dato & tid.",
  "MP_IGNORE_DUPLICATE_IDS": "Ignorer dublerede breve baseret på meddelelses-Ids.",
  "MP_LOG_FILE": "Log Mailpit output til fil i stedet for stdout. Eksempel: --log-file /path/to/logfile.log",
  "MP_QUIET": "Stille logning (kun fejl)",
  "MP_VERBOSE": "Verbose logning (debug)",
  "MP_UI_BIND_ADDR": "HTTP bind interface og port til UI.",
  "MP_WEBROOT": "Set the webroot for web UI & API, for eksempel mail would result in http://0.0.0.0.0:8025/mail/. (Automatic Copy)",
  "MP_UI_AUTH_FILE": "Angiv en adgangskodefil til web- UI & API grundlæggende godkendelse (se dokumenter).",
  "MP_UI_TLS_CERT": "TLS- certifikat for web- UI & API (ie: HTTPS). Denne indstilling kræver -- ui- tls- key argumentet eller MP_ UI_ TLS_ KEY miljøvariablen skal indstilles.",
  "MP_UI_TLS_KEY": "TLS- nøgle til web- UI & API (ie: HTTPS). Dette kræver at -- ui- tls- cert- argumentet eller MP_ UI_ TLS_ CERT miljøvariablen skal indstilles.",
  "MP_API_CORS": "Sæt API CORS Access-Control-Allow-Origin header hvis du har brug for cross-domain browser anmodninger.",
  "MP_BLOCK_REMOTE_CSS_AND_FONTS": "Blokér al browseradgang til ekstern CSS og skrifttyper importeret via meddelelsesstylesheets. Mailpit bruger HTTP Content Security Policy (CSP) metoden til at blokere disse. Dette blokerer ikke fjernbilleder eller klikker på eksternt link.",
  "MP_ENABLE_SPAMASSASSIN": "Aktiver SpamAssassin integration for besked spamminess score (se docs).",
  "MP_ALLOW_UNTRUSTED_TLS": "Kontroller ikke HTTPS-certifikater for enten link checker & skærmbillede generation.",
  "MP_SMTP_BIND_ADDR": "SMTP bind interface og port.",
  "MP_SMTP_AUTH_FILE": "Angiv en adgangskodefil til SMTP godkendelse (se dokumenter).",
  "MP_SMTP_AUTH_ACCEPT_ANY": "Accepter ethvert SMTP brugernavn og adgangskode, herunder ingen. Brug dette til grundlæggende at tillade noget.",
  "MP_SMTP_TLS_CERT": "TLS-certifikat for SMTP STARTTLS. Denne indstilling kræver -- smtp-tls-key argumentet eller MP_SMTP_TLS_KEY miljøvariablen skal indstilles.",
  "MP_SMTP_TLS_KEY": "TLS-nøgle for SMTP STARTTLS. Denne indstilling kræver -- smtp-tls-cert argument eller MP_SMTP_TLS_CERT miljøvariablen skal indstilles.",
  "MP_SMTP_REQUIRE_STARTTLS": "Kræv alle SMTP-klienter for at bruge STARTTLS-kryptering. Hvis sat til sand, er de eneste tilladte kommandoer NOOP, EHLO, STARTTLS og QUIT (som specificeret i RFC 4954), indtil forbindelsen opgraderes til STARTTLS.",
  "MP_SMTP_REQUIRE_TLS": "Kræv at alle SMTP-klienter bruger SSL/TLS-kryptering. Hvis sat til sand, skal alle forbindelser til SMTP-serveren håndteres over TLS. Dette er forskelligt fra STARTTLS som kræver at den indledende forbindelse ikke er krypteret. Bemærk at denne indstilling deaktiverer STARTTLS og kan reducere klientens kompatibilitet.",
  "MP_SMTP_AUTH_ALLOW_INSECURE": "Typisk håndhæves enten STARTTLS eller TLS for alle SMTP godkendelser. Denne indstilling tillader usikker PLAIN og LOGIN SMTP godkendelse når STARTTLS bruges.",
  "MP_SMTP_STRICT_RFC_HEADERS": "Tving Mailpit til at returnere en SMTP fejl, hvis beskedoverskrifter indeholder \\n i stedet for \\r\\n linjeskift. Som standard vil Mailpit lydløst rette forkerte linjeskift genereret af nogle brudte sendmail klienter (se relateret GitHub problem).",
  "MP_SMTP_MAX_RECIPIENTS": "Maksimalt antal SMTP-modtagere tilladt pr. besked.",
  "MP_SMTP_ALLOWED_RECIPIENTS": "Tillad kun SMTP modtagere der matcher et regulært udtryk. Brug dette til at begrænse indgående post til kun dem der sendes til en foruddefineret liste. Et eksempel ville være --smtp-allowed-recipients '{'@'}example.com$' for kun at tillade e-mails sendt til modtagere, der ender på {'@'}example.com.",
  "MP_SMTP_DISABLE_RDNS": "Deaktivér SMTP reverse DNS opslag. SMTP vil som standard forsøge at løse værtsnavnet for IP-adressen på den forbinder klient, dog i test netværk kan dette undertiden være problematisk forårsager forsinkelser for hver meddelelse leveret.",
  "MP_SMTP_RELAY_CONFIG": "SMTP konfigurationsfil til at aktivere meddelelsesrelæ/udgivelse (se docs). Alternativt kan hele konfigurationen overføres via miljøvariabler.",
  "MP_SMTP_RELAY_ALL": "Genlæg automatisk alle indgående beskeder via ekstern SMTP server (se docs). Brug med yderste forsigtighed!",
  "MP_SMTP_RELAY_MATCHING": "Send automatisk nogle indgående beskeder til matchende modtagere via ekstern SMTP server (se dokumenter).",
  "MP_POP3_BIND_ADDR": "POP3 server binder interface og port.",
  "MP_POP3_AUTH_FILE": "Angiv en adgangskodefil til POP3 godkendelse (se dokumenter).",
  "MP_POP3_TLS_CERT": "TLS-certifikat for POP3 SSL/TLS. Denne indstilling kræver --pop3-tls-key argumentet eller MP_POP3_TLS_KEY miljøvariablen skal indstilles.",
  "MP_POP3_TLS_KEY": "TLS-nøgle til POP3 SSL/TLS. Denne indstilling kræver --pop3-tls-cert argument eller MP_POP3_TLS_CERT miljøvariablen skal indstilles.",
  "MP_TAG": "Auto-tag nye breve matchende filtre (se docs).",
  "MP_TAGS_CONFIG": "Indlæs tags filtre fra yaml konfigurationsfil (se docs).",
  "MP_TAGS_TITLE_CASE": "Enforces TitleCasing for alle nyoprettede tags (se docs).",
  "MP_TAGS_DISABLE": "Deaktivér specifik auto-tagging. Denne indstilling tager en kommasepareret liste med tilvalg (se docs).",
  "MP_WEBHOOK_URL": "Ring til en webhook når nye beskeder modtages (se docs). Eksempel: --webhook-url https://example.com/webhook.php",
  "MP_WEBHOOK_LIMIT": "Bedøm begrænsede webhook anmodninger pr. sekund. For at forhindre potentielt overbelastning af webhook server, dette er normalt begrænset til et maksimum på 1 anmodning per sekund (se docs)."
}
