{
  "working_dir": "Arbejdsmappe",
  "db_path": "Underskriver den placering, hvor databasefiler vil blive oprettet og hentet",
  "env": "Konfigurerer instansens miljø. Værdien skal være enten 'produktion' eller 'udvikling'.",
  "http_addr": "Adressen på hvilken HTTP-serveren vil lytte.",
  "master_key": "Sætter instansens hovednøgle, der automatisk beskytter alle ruter undtagen FÅ / sundhed.",
  "no_analytics": "Deaktiverer Meilisearch's indbyggede telemetri.\nMeilisearch indsamler automatisk data fra alle instanser, der ikke fravælger at bruge dette flag.\nAlle indsamlede data bruges udelukkende til at forbedre Meilisearch, og kan slettes når som helst.",
  "http_payload_size_limit": "Sætter den maksimale størrelse af accepterede nyttelast.",
  "log_level": "Definerer hvor meget detalje der skal være til stede i Meilisearch's logs.\nMeilisearch understøtter i øjeblikket seks log-niveauer, der er opført i rækkefølge for at øge verbositet: `OFF`, `ERROR`, `WARN`, `INFO`, `DEBUG`, `TRACE`",
  "max_indexing_memory": "Sætter det maksimale antal RAM Meilisearch kan bruge når du indekserer.",
  "max_indexing_threads": "Sætter det maksimale antal tråde Meilisearch kan bruges under indeksering.",
  "dump_dir": "Angiver mappen hvor Meilisearch vil oprette dump filer.",
  "import_dump": "Importerer dump filen der er placeret på den angivne sti. Sti skal pege på en .dump fil.",
  "ignore_missing_dump": "Forhindrer Meilisearch i at smide en fejl når `import_dump` ikke peger på en gyldig dump fil.",
  "ignore_dump_if_db_exists": "Forhindrer en Meilisearch instans med en eksisterende database i at kaste en fejl, når du bruger `import_dump`.",
  "schedule_snapshot": "Aktiverer planlagte snapshots når sand, deaktiver når falsk (standard).\nHvis værdien er angivet som et heltal, aktiverer derefter det planlagte øjebliksbillede med den beståede værdi som intervallet mellem hvert øjebliksbillede på få sekunder.",
  "snapshot_dir": "Indstiller mappen hvor Meilisearch vil gemme snapshots.",
  "import_snapshot": "Åbner Meilisearch efter import af et tidligere genereret øjebliksbillede på den givne filsti.",
  "ignore_missing_snapshot": "Forhindrer en Meilisearch instans i at smide en fejl når `import_snapshot` ikke peger på en gyldig snapshot fil.",
  "ignore_snapshot_if_db_exists": "Forhindrer en Meilisearch instans med en eksisterende database i at kaste en fejl, når du bruger `import_snapshot`.",
  "ssl_auth_path": "Aktiverer klientgodkendelse i den angivne sti.",
  "ssl_cert_path": "Sætter serverens SSL-certifikater.",
  "ssl_key_path": "Sætter serverens SSL-nøglefiler.",
  "ssl_ocsp_path": "Sætter serverens OCSP- fil.",
  "ssl_require_auth": "Gør SSL autentificering obligatorisk.",
  "ssl_resumption": "Aktiverer SSL-sessions genoptagelse.",
  "ssl_tickets": "Aktiverer SSL-bestillinger.",
  "experimental_enable_metrics": "Eksperimentelle målinger funktion. Aktiverer Prometheus målinger på 'GET /metrics'-endepunktet.",
  "experimental_reduce_indexing_memory_usage": "Reduktion af eksperimentel RAM under indeksering, må ikke anvendes i produktionen.",
  "experimental_max_number_of_batched_tasks": "Eksperimentelt reducerer det maksimale antal opgaver, der vil blive behandlet på én gang."
}
