{
  "MP_DATABASE": "Укажите имя файла локальной базы данных для хранения постоянных данных. По умолчанию это локальный временный файл, который автоматически удаляется при выходе Mailpit. Вы можете использовать удаленную базу данных rqlite путем указания “http address” (см. документы).",
  "MP_LABEL": "Задайте дополнительную метку, чтобы идентифицировать этот экземпляр Mailpit. Это добавляет метку на веб-серверах UI, SMTP и POP3.",
  "MP_TENANT_ID": "Задайте идентификатор арендатора (префикс таблицы), который используется для изоляции данных от других экземпляров Mailpit, обмениваясь тем же файлом данных (см. документы).",
  "MP_MAX_MESSAGES": "Максимальное количество сообщений для магазина. Mailpit будет периодически удалять старые сообщения, если они больше, чем это. Установите в 0, чтобы отключить автоматическое удаление (см. документы).",
  "MP_MAX_AGE": "Максимальный возраст сообщений для хранения в одном из (h)ours или (d)ays. Mailpit будет периодически удалять самые старые сообщения, если больше, чем это. Значение должно быть в часах (например: --max-age 36h) или в днях (например: --max-age 14d) (см. документы).",
  "MP_USE_MESSAGE_DATES": "Использовать дату заголовка сообщения в качестве Mailpit полученной даты и времени вместо даты и времени SMTP.",
  "MP_IGNORE_DUPLICATE_IDS": "Игнорировать повторяющиеся сообщения на основе идентификаторов сообщений.",
  "MP_LOG_FILE": "Записывать вывод Mailpit в файл вместо stdout. Пример: --log-file /path/to/logfile.log",
  "MP_QUIET": "Тихие журналы (только ошибки)",
  "MP_VERBOSE": "Подробное журналирование (отладка)",
  "MP_UI_BIND_ADDR": "Интерфейс HTTP привязки и порт для UI.",
  "MP_WEBROOT": "Установите webroot для веб-интерфейса и API, например, почта приведет к http://0.0.0.0:8025/mail/.",
  "MP_UI_AUTH_FILE": "Укажите файл с паролем для веб-интерфейса и базовой аутентификации API (см. документа).",
  "MP_UI_TLS_CERT": "TLS сертификат для веб-UI & API (например: HTTPS). Эта опция требует параметр --ui-tls-key или значение переменной среды MP_UI_TLS_KEY.",
  "MP_UI_TLS_KEY": "Ключ TLS для веб-UI & API (например: HTTPS). Эта опция требует аргумента --ui-tls-cert или MP_UI_TLS_CERT переменной.",
  "MP_API_CORS": "Установите API CORS Access-Control-Allow-Origin заголовок, если требуется кросс-доменные запросы браузера.",
  "MP_BLOCK_REMOTE_CSS_AND_FONTS": "Блокировать доступ ко всем удаленным CSS и шрифтам, импортированным через таблицы стилей сообщений. Mailpit использует метод HTTP Content Security Policy (CSP) для их блокирования. Это не блокирует удаленные изображения и не кликает на внешнюю ссылку.",
  "MP_ENABLE_SPAMASSASSIN": "Включить интеграцию SpamAssassin для оценки спама сообщений (см. документа).",
  "MP_ALLOW_UNTRUSTED_TLS": "Не проверяйте сертификаты HTTPS для проверки ссылок и создания скриншотов.",
  "MP_SMTP_BIND_ADDR": "Интерфейс и порт SMTP.",
  "MP_SMTP_AUTH_FILE": "Укажите файл пароля для аутентификации SMTP (см. документы).",
  "MP_SMTP_AUTH_ACCEPT_ANY": "Принимайте любые SMTP имя пользователя и пароль, включая ничего. Используйте это, чтобы разрешить всё.",
  "MP_SMTP_TLS_CERT": "TLS сертификат для SMTP STARTTLS. Эта опция требует задать аргумент --smtp-tls-key или MP_SMTP_TLS_KEY окружения.",
  "MP_SMTP_TLS_KEY": "TLS для SMTP STARTTLS. Эта опция требует задать параметр --smtp-tls-cert или MP_SMTP_TLS_CERT окружения.",
  "MP_SMTP_REQUIRE_STARTTLS": "Требовать шифрования STARTTLS для всех клиентов SMTP. Если установлено значение true, то единственными допустимыми командами являются NOOP, EHLO, STARTTLS и QUIT (как указано в RFC 4954) до обновления соединения до STARTTLS.",
  "MP_SMTP_REQUIRE_TLS": "Требовать от всех клиентов SMTP использовать шифрование SSL/TLS. Если установлено значение true, все соединения к SMTP серверу должны быть обработаны через TLS. Это отличается от STARTTLS, который требует незашифрованного начального подключения. Обратите внимание, что этот параметр отключает STARTTLS и может снизить совместимость с клиентом.",
  "MP_SMTP_AUTH_ALLOW_INSECURE": "Обычно STARTTLS или TLS применяются для всей аутентификации SMTP. Эта опция позволяет небезопасную аутентификацию PLAIN & LOGIN SMTP при использовании STARTTLS.",
  "MP_SMTP_STRICT_RFC_HEADERS": "Принудительно возвращать ошибку SMTP, если заголовки сообщений содержат \\n вместо \\r\\n в разрывы строки. По умолчанию Mailpit будет без предупреждений исправлять некорректные разрывы строк, создаваемые некоторыми клиентами sendmail (см. связанную с этим проблему GitHub).",
  "MP_SMTP_MAX_RECIPIENTS": "Максимальное количество SMTP получателей, разрешенных на одно сообщение.",
  "MP_SMTP_ALLOWED_RECIPIENTS": "Разрешить только SMTP получателям, совпадающим с регулярным выражением. Используйте это для ограничения входящей почты только тем, которые посылаются в заранее определенный список. Примером может быть --smtp-allowed-recipients '{'@'}example.com$' разрешить только отправлять письма получателям, заканчивающимся на {'@'}example.com.",
  "MP_SMTP_DISABLE_RDNS": "Отключить SMTP обратные запросы DNS. SMTP по умолчанию попытается разрешить имя хоста IP адреса подключаемого клиента, Однако в тестовых сетях иногда это может быть проблематичным, вызывающим задержки в работе каждого отправленного сообщения.",
  "MP_SMTP_RELAY_CONFIG": "Конфигурационный файл SMTP для включения ретрансляции/релиза сообщений (см. документы). Кроме того, вся конфигурация может быть передана через переменные среды.",
  "MP_SMTP_RELAY_ALL": "Автоматически пересылать все входящие сообщения через внешний SMTP сервер (см. документы). Используйте с крайней осторожностью!",
  "MP_SMTP_RELAY_MATCHING": "Автоматически пересылать некоторые входящие сообщения получателям через внешний SMTP сервер (см. документы).",
  "MP_POP3_BIND_ADDR": "Интерфейс и порт привязки POP3 сервера.",
  "MP_POP3_AUTH_FILE": "Укажите файл пароля для POP3 аутентификации (см. документы).",
  "MP_POP3_TLS_CERT": "TLS сертификат для POP3 SSL/TLS. Этот параметр требует задать параметр --pop3-tls-key или MP_POP3_TLS_KEY окружения.",
  "MP_POP3_TLS_KEY": "Ключ TLS для POP3 SSL/TLS. Этот параметр требует задать параметр --pop3-tls-cert или MP_POP3_TLS_CERT окружения.",
  "MP_TAG": "Автоматическая метка фильтров для новых сообщений (см. документы).",
  "MP_TAGS_CONFIG": "Загрузить фильтры тегов из файла конфигурации yaml (см. документы).",
  "MP_TAGS_TITLE_CASE": "Добавляет титул для всех новых тегов (см. документы).",
  "MP_TAGS_DISABLE": "Отключить автоматическую отметку. Эта опция принимает список опций, разделенных запятыми (см. документы).",
  "MP_WEBHOOK_URL": "Вызывать webhook при получении новых сообщений (см. документы). Пример: --webhook-url https://example.com/webhook.php",
  "MP_WEBHOOK_LIMIT": "Оцените ограниченные запросы вебхуков в секунду. Для предотвращения потенциально перезагрузки сервера webhook, эта частота по умолчанию ограничена 1 запросом в секунду (см. документы)."
}
