{
  "working_dir": "Рабочая папка",
  "db_path": "Определяет местоположение, в котором будут создаваться и загружаться файлы базы данных",
  "env": "Настраивает окружение экземпляра. Значение должно быть `production` или `development`.",
  "http_addr": "Адрес, на котором будет прослушиваться HTTP-сервер.",
  "master_key": "Устанавливает главный ключ экземпляра, автоматически защищает все маршруты, кроме GET /health.",
  "no_analytics": "Отключает встроенную телеметрию Meilisearch при её наличии.\nMeilisearch автоматически собирает данные со всех объектов, которые не отказались от использования этого флага.\nВсе собранные данные используются исключительно для улучшения Meilisearch и могут быть удалены в любое время.",
  "http_payload_size_limit": "Устанавливает максимальный размер принятых полезных грузов.",
  "log_level": "Определяет, сколько деталей должно присутствовать в бревнах Meilisearch.\nМейлипоиск в настоящее время поддерживает шесть уровней журнала, перечисленные в порядке возрастания детализации: `OFF`, `ERROR`, `WARN`, `INFO`, `DEBUG`, `TRACE`",
  "max_indexing_memory": "Устанавливает максимальное количество RAM MeilisSearch, которое может использоваться при индексации.",
  "max_indexing_threads": "Устанавливает максимальное количество потоков MeilisSearch, которые могут использоваться в процессе индексации.",
  "dump_dir": "Устанавливает каталог, в котором MeilisSearch создаст дамп файлы.",
  "import_dump": "Импортирует дамп файл, расположенный по указанному пути. Путь должен указывать на .dump файл.",
  "ignore_missing_dump": "Предотвращает публикацию MeilisSearch, когда `import_dump` не указывает на допустимый дамп файл.",
  "ignore_dump_if_db_exists": "Предотвращает запуск экземпляра Meilis с существующей базой данных при использовании `import_dump`.",
  "schedule_snapshot": "Включает запланированные снимки при истинном значении, отключить, если нет (по умолчанию).\nЕсли значение задано в виде целого числа, затем включает запланированный снимок с передаваемым значением как интервал между каждым снимком, в секундах.",
  "snapshot_dir": "Устанавливает каталог, в котором MeilisSearch, будут храниться снимки.",
  "import_snapshot": "Запускает MeilisSearch, импортируя созданный ранее снимок в указанном файле.",
  "ignore_missing_snapshot": "Предотвращает запуск экземпляра MeilisSearch, когда `import_snapshot` не указывает на допустимый файл со снимком.",
  "ignore_snapshot_if_db_exists": "Предотвращает запуск экземпляра Meilis\u0002 с существующей базой данных при использовании `import_snapshot`.",
  "ssl_auth_path": "Включает аутентификацию клиента в указанном пути.",
  "ssl_cert_path": "Устанавливает SSL-сертификаты сервера.",
  "ssl_key_path": "Устанавливает SSL-файлы ключа сервера.",
  "ssl_ocsp_path": "Устанавливает OCSP-файл сервера.",
  "ssl_require_auth": "Делает аутентификацию SSL обязательной.",
  "ssl_resumption": "Активирует сброс сеанса SSL.",
  "ssl_tickets": "Активирует SSL-заявки.",
  "experimental_enable_metrics": "Экспериментальная функция метрики. Включает метрики Прометрики на конечной точке «GET /metrics».",
  "experimental_reduce_indexing_memory_usage": "Экспериментальное сокращение ОЗУ при индексации, не использовать в производстве.",
  "experimental_max_number_of_batched_tasks": "Экспериментально уменьшает максимальное количество задач, которые будут выполняться одновременно."
}
