{
  "MINIO_ADDRESS": "Привязывает сервер minio к определенному сетевому адресу и номеру порта.",
  "MINIO_CONSOLE_ADDRESS": "Определяет статический порт для встроенных MinIO консолей.",
  "MINIO_CERTS_DIR": "Указан путь к папке, содержащей сертификаты, которые используется для настройки соединения TLS/SSL.",
  "MINIO_ROOT_USER": "Корневой пользователь. По умолчанию minioadmin",
  "MINIO_ROOT_PASSWORD": "Пароль пользователя root. По умолчанию для minioadmin",
  "MINIO_SITE_NAME": "название сайта, например \"cal-rack0\"",
  "MINIO_SITE_REGION": "имя местоположения сервера, например \"us-west-1\"",
  "MINIO_SITE_COMMENT": "при желании добавить комментарий к этому параметру",
  "MINIO_STORAGE_CLASS_STANDARD": "задание количества четности для стандартного класса хранения по умолчанию, например \"EC:4\"",
  "MINIO_STORAGE_CLASS_RRS": "задание количества четности для уменьшенного класса резервирования, например \"EC:2\"",
  "MINIO_ETCD_ENDPOINTS": "через запятую список конечных точек etcd, например \"http://localhost:2379\"",
  "MINIO_ETCD_PATH_PREFIX": "префикс пространства имён для изоляции арендаторов, например \"клиент1/\"",
  "MINIO_API_REQUESTS_MAX": "установить максимальное количество одновременных запросов (по умолчанию: 'Авто')",
  "MINIO_API_CLUSTER_DEADLINE": "установить срок проверки готовности кластера (по умолчанию: '10s')",
  "MINIO_API_CORS_ALLOW_ORIGIN": "задать список источников, разделенных запятыми, которые разрешены для CORS запросов (по умолчанию: '*')",
  "MINIO_API_REMOTE_TRANSPORT_DEADLINE": "установить срок для API запросов на удаленном транспорте при проксировании между федеративными экземплярами, например \"2h\" (по умолчанию: '2h')",
  "MINIO_API_LIST_QUORUM": "установить допустимый кворум, ожидаемый для списка операций, например \"optimal\", \"reduced\", \"disk\", \"strict\", \"auto\" (по умолчанию: 'strict')",
  "MINIO_API_REPLICATION_PRIORITY": "задать приоритет репликации (по умолчанию: 'auto')",
  "MINIO_API_REPLICATION_MAX_WORKERS": "задать максимальное количество репликационных рабочих (по умолчанию: '500')",
  "MINIO_API_TRANSITION_WORKERS": "задать количество переходных рабочих процессов (по умолчанию: '100')",
  "MINIO_API_STALE_UPLOADS_EXPIRY": "установлено в устаревшие многокомпонентные выгрузки старше чем это значение (по умолчанию: '24ч')",
  "MINIO_API_STALE_UPLOADS_CLEANUP_INTERVAL": "параметр для изменения интервалов, когда устаревшие мультипликации истекают (по умолчанию: '6h')",
  "MINIO_API_DELETE_CLEANUP_INTERVAL": "изменяет интервалы, когда удаленные объекты навсегда удаляются из папки \".корзина\" (по умолчанию: '5м')",
  "MINIO_API_ODIRECT": ", чтобы включить или отключить O_DIRECT для записи в специальных условиях. ПРИМЕЧАНИЕ: не отключайте O_DIRECT без предварительного тестирования (по умолчанию: 'в')",
  "MINIO_API_ROOT_ACCESS": "выключите 'off' доступ к учетным данным для всех вызовов API, включая s3, операции администратора (по умолчанию: 'в')",
  "MINIO_API_SYNC_EVENTS": "параметр для включения уведомлений синхронных сегментов (по умолчанию: 'выкл')",
  "MINIO_API_OBJECT_MAX_VERSIONS": "задать максимально допустимое количество версий на объект (по умолчанию: '9223372036854775807')",
  "MINIO_BROWSER": "Включение или отключение доступа к консольному веб-интерфейсу. По умолчанию это значение установлено в 'on'",
  "MINIO_DOMAIN": "разрешить запросы виртуального хоста например \"mydomain.com\" или несколько доменов с запятыми значениями, например \"sub1.mydomain.com,sub2.mydomain.com\""
}
