{
  "binNoFound": "Tệp khởi động không tồn tại, thao tác không thành công.",
  "confNoFound": "Tệp cấu hình không tồn tại, máy chủ không khởi động được",
  "apacheLogPathErr": "Đường dẫn nhật ký của tệp cấu hình không đúng, và việc chuyển đổi không thành công",
  "switchFail": "Chuyển đổi không thành công",
  "needPassWord": "Sudo cần mật khẩu máy tính, vui lòng nhập",
  "versionError": "Phiên bản không đúng, vui lòng chọn lại",
  "needSelectVersion": "Vui lòng chọn phiên bản trước",
  "serviceNoRun": "Dịch vụ không chạy",
  "brewNoFound": "Không tìm thấy Brew",
  "getVersionNumFail": "Không lấy được số phiên bản",
  "hostsFileNoFound": "Tệp hosts không tồn tại",
  "hostsWriteFail": "Không ghi được tệp /private/etc/hosts",
  "hostsReadFail": "Không đọc được tệp /private/etc/hosts",
  "startFail": "Khởi động không thành công, vui lòng kiểm tra tệp nhật ký",
  "command": "Lệnh",
  "nvmDirNoFound": "Không tìm thấy NVM_DIR",
  "phpiniNoFound": "Không tìm thấy tệp php.ini",
  "ExtensionInstallFail": "Cài đặt tiện ích mở rộng không thành công",
  "phpStopFail": "Không dừng được PHP{version}, vui lòng thử dừng nó theo cách thủ công",
  "ExtensionInstallFailTips": "Cài đặt tiện ích mở rộng và thực thi lệnh:\n{command}\nNếu cài đặt không thành công, bạn có thể thử sao chép lệnh và tự cài đặt\n",
  "versionNoFound": "Không lấy được phiên bản phần mềm, thao tác không thành công.",
  "postgresqlInit": "Dịch vụ đã khởi động thành công\nData Dir là {dir}\nNgười dùng ban đầu là root, Mật khẩu là root",
  "toolFileNotExist": "File does not exist",
  "downFileFail": "Tải xuống tệp không thành công!",
  "noPowerShell": "Không tìm thấy PowerShell trong các biến môi trường, vui lòng định cấu hình PowerShell trong các biến môi trường trước và khởi động lại PWS để thử lại",
  "noEPMD": "Không tìm thấy quy trình epmd. Vui lòng đặt lại các biến môi trường Erlang",
  "licenseTips": "Nếu không có giấy phép, chỉ có thể tạo ba trang web",
  "trialEnd": "Thời gian dùng thử đã hết. Để tiếp tục sử dụng tính năng này, vui lòng mua giấy phép"
}
