{
  "MP_DATABASE": "Chỉ định tên tệp cơ sở dữ liệu cục bộ để lưu trữ dữ liệu liên tục. Mặc định là một tệp tạm thời cục bộ sẽ tự động bị xóa khi Mailpit thoát. Bạn có thể tùy chọn sử dụng cơ sở dữ liệu rqlite từ xa bằng cách chỉ định một “địa chỉ http” (xem tài liệu).",
  "MP_LABEL": "Đặt một nhãn tùy chọn để xác định phiên bản Mailpit này. Điều này thêm nhãn vào giao diện web, máy chủ SMTP và POP3.",
  "MP_TENANT_ID": "Đặt ID người thuê (tiền tố bảng). Điều này được sử dụng để cô lập dữ liệu khỏi các phiên bản Mailpit khác dùng chung cùng một tệp dữ liệu (xem tài liệu).",
  "MP_MAX_MESSAGES": "Số lượng tin nhắn tối đa để lưu trữ. Mailpit sẽ định kỳ xóa các tin nhắn cũ nhất nếu lớn hơn số này. Đặt thành 0 để tắt tự động xóa (xem tài liệu).",
  "MP_MAX_AGE": "Tuổi tối đa của tin nhắn để lưu trữ theo (h) giờ hoặc (d) ngày. Mailpit sẽ định kỳ xóa các tin nhắn cũ nhất nếu lớn hơn số này. Giá trị phải ở dạng giờ (ví dụ: --max-age 36h) hoặc ngày (ví dụ: --max-age 14d) (xem tài liệu).",
  "MP_USE_MESSAGE_DATES": "Sử dụng ngày tiêu đề tin nhắn làm ngày & giờ nhận được của Mailpit thay vì ngày & giờ nhận được của SMTP.",
  "MP_IGNORE_DUPLICATE_IDS": "Bỏ qua các tin nhắn trùng lặp dựa trên Message-Ids.",
  "MP_LOG_FILE": "Ghi đầu ra của Mailpit vào tệp thay vì stdout. ví dụ: --log-file /path/to/logfile.log",
  "MP_QUIET": "Ghi nhật ký yên tĩnh (chỉ lỗi)",
  "MP_VERBOSE": "Ghi nhật ký chi tiết (gỡ lỗi)",
  "MP_UI_BIND_ADDR": "Giao diện và cổng liên kết HTTP cho giao diện người dùng.",
  "MP_WEBROOT": "Đặt webroot cho giao diện web & API, ví dụ: mail sẽ dẫn đến http://0.0.0.0:8025/mail/.",
  "MP_UI_AUTH_FILE": "Chỉ định một tệp mật khẩu cho xác thực cơ bản của giao diện web & API (xem tài liệu).",
  "MP_UI_TLS_CERT": "Chứng chỉ TLS cho giao diện web & API (tức là: HTTPS). Tùy chọn này yêu cầu đối số --ui-tls-key hoặc biến môi trường MP_UI_TLS_KEY phải được đặt.",
  "MP_UI_TLS_KEY": "Khóa TLS cho giao diện web & API (tức là: HTTPS). Tùy chọn này yêu cầu đối số --ui-tls-cert hoặc biến môi trường MP_UI_TLS_CERT phải được đặt.",
  "MP_API_CORS": "Đặt tiêu đề API CORS Access-Control-Allow-Origin nếu bạn yêu cầu các yêu cầu trình duyệt đa miền.",
  "MP_BLOCK_REMOTE_CSS_AND_FONTS": "Chặn tất cả truy cập của trình duyệt vào CSS và phông chữ từ xa được nhập qua biểu định kiểu tin nhắn. Mailpit sử dụng phương pháp Chính sách bảo mật nội dung (CSP) của HTTP để chặn những thứ này. Điều này không chặn hình ảnh từ xa hoặc nhấp vào liên kết bên ngoài.",
  "MP_ENABLE_SPAMASSASSIN": "Bật tích hợp SpamAssassin để tính điểm spam của tin nhắn (xem tài liệu).",
  "MP_ALLOW_UNTRUSTED_TLS": "Không xác minh chứng chỉ HTTPS cho cả trình kiểm tra liên kết & tạo ảnh chụp màn hình.",
  "MP_SMTP_BIND_ADDR": "Giao diện và cổng liên kết SMTP.",
  "MP_SMTP_AUTH_FILE": "Chỉ định một tệp mật khẩu cho xác thực SMTP (xem tài liệu).",
  "MP_SMTP_AUTH_ACCEPT_ANY": "Chấp nhận bất kỳ tên người dùng và mật khẩu SMTP nào, kể cả không có. Sử dụng điều này để về cơ bản cho phép mọi thứ.",
  "MP_SMTP_TLS_CERT": "Chứng chỉ TLS cho SMTP STARTTLS. Tùy chọn này yêu cầu đối số --smtp-tls-key hoặc biến môi trường MP_SMTP_TLS_KEY phải được đặt.",
  "MP_SMTP_TLS_KEY": "Khóa TLS cho SMTP STARTTLS. Tùy chọn này yêu cầu đối số --smtp-tls-cert hoặc biến môi trường MP_SMTP_TLS_CERT phải được đặt.",
  "MP_SMTP_REQUIRE_STARTTLS": "Yêu cầu tất cả máy khách SMTP sử dụng mã hóa STARTTLS. Nếu được đặt thành true, các lệnh được phép duy nhất là NOOP, EHLO, STARTTLS và QUIT (như được chỉ định trong RFC 4954) cho đến khi kết nối được nâng cấp lên STARTTLS.",
  "MP_SMTP_REQUIRE_TLS": "Yêu cầu tất cả máy khách SMTP sử dụng mã hóa SSL/TLS. Nếu được đặt thành true, tất cả các kết nối đến máy chủ SMTP phải được xử lý qua TLS. Điều này khác với STARTTLS, yêu cầu kết nối ban đầu phải không được mã hóa. Lưu ý rằng tùy chọn này tắt STARTTLS và có thể làm giảm khả năng tương thích của máy khách.",
  "MP_SMTP_AUTH_ALLOW_INSECURE": "Thông thường, STARTTLS hoặc TLS được thực thi cho tất cả xác thực SMTP. Tùy chọn này cho phép xác thực SMTP PLAIN & LOGIN không an toàn khi sử dụng STARTTLS.",
  "MP_SMTP_STRICT_RFC_HEADERS": "Buộc Mailpit trả về lỗi SMTP nếu các tiêu đề tin nhắn chứa \\n thay vì \\r\\n ngắt dòng. Theo mặc định, Mailpit sẽ âm thầm sửa các ngắt dòng không chính xác do một số máy khách sendmail bị hỏng tạo ra (xem sự cố liên quan trên GitHub).",
  "MP_SMTP_MAX_RECIPIENTS": "Số lượng người nhận SMTP tối đa được phép cho mỗi tin nhắn.",
  "MP_SMTP_ALLOWED_RECIPIENTS": "Chỉ cho phép người nhận SMTP khớp với biểu thức chính quy. Sử dụng điều này để hạn chế thư đến chỉ những thư được gửi đến một danh sách được xác định trước. Một ví dụ là --smtp-allowed-recipients '{'@'}example.com$' để chỉ cho phép các email được gửi đến những người nhận kết thúc bằng {'@'}example.com.",
  "MP_SMTP_DISABLE_RDNS": "Tắt tra cứu DNS ngược SMTP. Theo mặc định, SMTP sẽ cố gắng phân giải tên máy chủ của địa chỉ IP của máy khách đang kết nối, tuy nhiên trong các mạng thử nghiệm, điều này đôi khi có thể gây ra sự cố gây ra sự chậm trễ cho mọi tin nhắn được gửi.",
  "MP_SMTP_RELAY_CONFIG": "Tệp cấu hình SMTP để bật chuyển tiếp/phát hành tin nhắn (xem tài liệu). Ngoài ra, toàn bộ cấu hình có thể được truyền qua các biến môi trường.",
  "MP_SMTP_RELAY_ALL": "Tự động chuyển tiếp tất cả các tin nhắn đến qua máy chủ SMTP bên ngoài (xem tài liệu). Sử dụng hết sức thận trọng!",
  "MP_SMTP_RELAY_MATCHING": "Tự động chuyển tiếp một số tin nhắn đến cho những người nhận phù hợp qua máy chủ SMTP bên ngoài (xem tài liệu).",
  "MP_POP3_BIND_ADDR": "Giao diện và cổng liên kết máy chủ POP3.",
  "MP_POP3_AUTH_FILE": "Chỉ định một tệp mật khẩu cho xác thực POP3 (xem tài liệu).",
  "MP_POP3_TLS_CERT": "Chứng chỉ TLS cho POP3 SSL/TLS. Tùy chọn này yêu cầu đối số --pop3-tls-key hoặc biến môi trường MP_POP3_TLS_KEY phải được đặt.",
  "MP_POP3_TLS_KEY": "Khóa TLS cho POP3 SSL/TLS. Tùy chọn này yêu cầu đối số --pop3-tls-cert hoặc biến môi trường MP_POP3_TLS_CERT phải được đặt.",
  "MP_TAG": "Tự động gắn thẻ các tin nhắn mới khớp với bộ lọc (xem tài liệu).",
  "MP_TAGS_CONFIG": "Tải bộ lọc thẻ từ tệp cấu hình yaml (xem tài liệu).",
  "MP_TAGS_TITLE_CASE": "Thực thi TitleCasing cho tất cả các thẻ mới được tạo (xem tài liệu).",
  "MP_TAGS_DISABLE": "Tắt tự động gắn thẻ cụ thể. Tùy chọn này lấy một danh sách các tùy chọn được phân tách bằng dấu phẩy (xem tài liệu).",
  "MP_WEBHOOK_URL": "Gọi một webhook khi nhận được tin nhắn mới (xem tài liệu), ví dụ: --webhook-url https://example.com/webhook.php.",
  "MP_WEBHOOK_LIMIT": "Giới hạn tốc độ các yêu cầu webhook mỗi giây. Để ngăn chặn khả năng quá tải máy chủ webhook, điều này được giới hạn tốc độ theo mặc định là tối đa 1 yêu cầu mỗi giây (xem tài liệu)."
}
