{
  "db_path": "Chỉ định vị trí tạo và truy xuất các tệp cơ sở dữ liệu",
  "env": "Cấu hình môi trường của instance. Giá trị phải là `production` hoặc `development`.",
  "http_addr": "Địa chỉ mà máy chủ HTTP sẽ lắng nghe.",
  "master_key": "Đặt khóa chính của instance, tự động bảo vệ tất cả các route ngoại trừ GET /health.",
  "no_analytics": "Tắt tính năng telemetry tích hợp của Meilisearch.\nMeilisearch tự động thu thập dữ liệu từ tất cả các instance không từ chối bằng cờ này.\nTất cả dữ liệu thu thập chỉ nhằm mục đích cải thiện Meilisearch và có thể bị xóa bất cứ lúc nào.",
  "http_payload_size_limit": "Đặt kích thước tối đa của payload được chấp nhận.",
  "log_level": "Xác định mức độ chi tiết trong nhật ký của Meilisearch.\nMeilisearch hiện hỗ trợ sáu mức nhật ký, được liệt kê theo thứ tự tăng dần về độ chi tiết: `OFF`, `ERROR`, `WARN`, `INFO`, `DEBUG`, `TRACE`",
  "max_indexing_memory": "Đặt lượng RAM tối đa mà Meilisearch có thể sử dụng khi lập chỉ mục.",
  "max_indexing_threads": "Đặt số lượng luồng tối đa mà Meilisearch có thể sử dụng trong quá trình lập chỉ mục.",
  "dump_dir": "Đặt thư mục nơi Meilisearch sẽ tạo các tệp dump.",
  "import_dump": "Nhập tệp dump nằm tại đường dẫn được chỉ định. Đường dẫn phải trỏ đến tệp .dump.",
  "ignore_missing_dump": "Ngăn Meilisearch ném lỗi khi `import_dump` không trỏ đến tệp dump hợp lệ.",
  "ignore_dump_if_db_exists": "Ngăn instance Meilisearch có cơ sở dữ liệu hiện có ném lỗi khi sử dụng `import_dump`.",
  "schedule_snapshot": "Bật snapshot theo lịch trình khi là true, tắt khi là false (mặc định).\nNếu giá trị là số nguyên, thì bật snapshot theo lịch trình với giá trị đã truyền làm khoảng thời gian giữa các snapshot (tính bằng giây).",
  "snapshot_dir": "Đặt thư mục nơi Meilisearch sẽ lưu trữ snapshot.",
  "import_snapshot": "Khởi chạy Meilisearch sau khi nhập snapshot đã tạo trước đó tại đường dẫn tệp đã cho.",
  "ignore_missing_snapshot": "Ngăn instance Meilisearch ném lỗi khi `import_snapshot` không trỏ đến tệp snapshot hợp lệ.",
  "ignore_snapshot_if_db_exists": "Ngăn instance Meilisearch có cơ sở dữ liệu hiện có ném lỗi khi sử dụng `import_snapshot`.",
  "ssl_auth_path": "Bật xác thực client tại đường dẫn được chỉ định.",
  "ssl_cert_path": "Đặt chứng chỉ SSL của máy chủ.",
  "ssl_key_path": "Đặt tệp khóa SSL của máy chủ.",
  "ssl_ocsp_path": "Đặt tệp OCSP của máy chủ.",
  "ssl_require_auth": "Bắt buộc xác thực SSL.",
  "ssl_resumption": "Kích hoạt tiếp tục phiên SSL.",
  "ssl_tickets": "Kích hoạt vé SSL.",
  "experimental_enable_metrics": "Tính năng metrics thử nghiệm. Bật metrics Prometheus tại endpoint `GET /metrics`.",
  "experimental_reduce_indexing_memory_usage": "Giảm sử dụng bộ nhớ trong khi lập chỉ mục thử nghiệm, không sử dụng trong môi trường production.",
  "experimental_max_number_of_batched_tasks": "Giảm thử nghiệm số lượng tác vụ tối đa được xử lý cùng một lúc."
}
