{
  "working_dir": "Thư mục làm việc",
  "db_path": "Chỉ định vị trí nơi các tệp cơ sở dữ liệu sẽ được tạo và truy xuất",
  "env": "Cấu hình môi trường của instance. Giá trị phải là `production` hoặc `development`.",
  "http_addr": "Địa chỉ mà máy chủ HTTP sẽ lắng nghe.",
  "master_key": "Thiết lập khóa chính (master key) cho instance, tự động bảo vệ tất cả các route trừ GET /health.",
  "no_analytics": "Tắt tính năng thu thập dữ liệu tích hợp của Meilisearch khi bật cờ này.\nMeilisearch tự động thu thập dữ liệu từ tất cả các instance không từ chối (opt out) bằng cờ này.\nTất cả dữ liệu thu thập chỉ được sử dụng nhằm mục đích cải thiện Meilisearch và có thể bị xóa bất kỳ lúc nào.",
  "http_payload_size_limit": "Thiết lập kích thước tối đa của payload được chấp nhận.",
  "log_level": "Xác định mức độ chi tiết trong log của Meilisearch.\nMeilisearch hiện hỗ trợ sáu mức log, theo thứ tự tăng dần độ chi tiết: `OFF`, `ERROR`, `WARN`, `INFO`, `DEBUG`, `TRACE`",
  "max_indexing_memory": "Thiết lập lượng RAM tối đa mà Meilisearch có thể sử dụng khi lập chỉ mục.",
  "max_indexing_threads": "Thiết lập số luồng tối đa mà Meilisearch có thể sử dụng khi lập chỉ mục.",
  "dump_dir": "Thiết lập thư mục nơi Meilisearch sẽ tạo các tệp dump.",
  "import_dump": "Nhập tệp dump tại đường dẫn chỉ định. Đường dẫn phải trỏ tới tệp có phần mở rộng .dump.",
  "ignore_missing_dump": "Ngăn Meilisearch báo lỗi khi `import_dump` không trỏ tới một tệp dump hợp lệ.",
  "ignore_dump_if_db_exists": "Ngăn instance Meilisearch có sẵn cơ sở dữ liệu báo lỗi khi sử dụng `import_dump`.",
  "schedule_snapshot": "Bật tính năng tạo snapshot theo lịch khi giá trị là true, tắt khi là false (mặc định).\nNếu giá trị là số nguyên, sẽ bật snapshot theo lịch với khoảng thời gian giữa các snapshot tính bằng giây.",
  "snapshot_dir": "Thiết lập thư mục nơi Meilisearch sẽ lưu các snapshot.",
  "import_snapshot": "Khởi động Meilisearch sau khi nhập snapshot đã tạo trước đó tại đường dẫn chỉ định.",
  "ignore_missing_snapshot": "Ngăn instance Meilisearch báo lỗi khi `import_snapshot` không trỏ tới tệp snapshot hợp lệ.",
  "ignore_snapshot_if_db_exists": "Ngăn instance Meilisearch có sẵn cơ sở dữ liệu báo lỗi khi sử dụng `import_snapshot`.",
  "ssl_auth_path": "Bật xác thực client tại đường dẫn chỉ định.",
  "ssl_cert_path": "Thiết lập chứng chỉ SSL của máy chủ.",
  "ssl_key_path": "Thiết lập tệp khóa SSL của máy chủ.",
  "ssl_ocsp_path": "Thiết lập tệp OCSP của máy chủ.",
  "ssl_require_auth": "Bắt buộc xác thực SSL.",
  "ssl_resumption": "Bật tính năng khôi phục phiên SSL.",
  "ssl_tickets": "Bật tính năng SSL tickets.",
  "experimental_enable_metrics": "Tính năng metrics thử nghiệm. Bật Prometheus metrics tại endpoint `GET /metrics`.",
  "experimental_reduce_indexing_memory_usage": "Tính năng thử nghiệm giảm sử dụng RAM khi lập chỉ mục, không dùng trong môi trường production.",
  "experimental_max_number_of_batched_tasks": "Tính năng thử nghiệm giảm số lượng tác vụ tối đa được xử lý cùng lúc."
}
