{
  "MINIO_ADDRESS": "Gán tiến trình máy chủ MinIO vào một địa chỉ mạng và số cổng cụ thể.",
  "MINIO_CONSOLE_ADDRESS": "Chỉ định một cổng cố định cho MinIO Console tích hợp.",
  "MINIO_CERTS_DIR": "Chỉ định đường dẫn đến thư mục chứa chứng chỉ mà tiến trình MinIO sử dụng để cấu hình kết nối TLS/SSL.",
  "MINIO_ROOT_USER": "Người dùng root. Mặc định là minioadmin",
  "MINIO_ROOT_PASSWORD": "Mật khẩu người dùng root. Mặc định là minioadmin",
  "MINIO_SITE_NAME": "Tên cho site, ví dụ: \"cal-rack0\"",
  "MINIO_SITE_REGION": "Tên vị trí của máy chủ, ví dụ: \"us-west-1\"",
  "MINIO_SITE_COMMENT": "Tùy chọn: thêm ghi chú cho thiết lập này",
  "MINIO_STORAGE_CLASS_STANDARD": "Thiết lập số parity cho lớp lưu trữ tiêu chuẩn mặc định, ví dụ: \"EC:4\"",
  "MINIO_STORAGE_CLASS_RRS": "Thiết lập số parity cho lớp lưu trữ giảm dư thừa, ví dụ: \"EC:2\"",
  "MINIO_ETCD_ENDPOINTS": "Danh sách endpoint của etcd, cách nhau bằng dấu phẩy, ví dụ: \"http://localhost:2379\"",
  "MINIO_ETCD_PATH_PREFIX": "Tiền tố namespace để tách biệt tenant, ví dụ: \"customer1/\"",
  "MINIO_API_REQUESTS_MAX": "Thiết lập số lượng yêu cầu đồng thời tối đa (mặc định: 'auto')",
  "MINIO_API_CLUSTER_DEADLINE": "Thiết lập thời hạn kiểm tra trạng thái sẵn sàng của cluster (mặc định: '10s')",
  "MINIO_API_CORS_ALLOW_ORIGIN": "Thiết lập danh sách origin cho phép CORS, cách nhau bằng dấu phẩy (mặc định: '*')",
  "MINIO_API_REMOTE_TRANSPORT_DEADLINE": "Thiết lập thời hạn cho các yêu cầu API trên kết nối remote khi proxy giữa các instance liên kết, ví dụ: \"2h\" (mặc định: '2h')",
  "MINIO_API_LIST_QUORUM": "Thiết lập mức quorum chấp nhận được cho thao tác liệt kê, ví dụ: \"optimal\", \"reduced\", \"disk\", \"strict\", \"auto\" (mặc định: 'strict')",
  "MINIO_API_REPLICATION_PRIORITY": "Thiết lập độ ưu tiên replication (mặc định: 'auto')",
  "MINIO_API_REPLICATION_MAX_WORKERS": "Thiết lập số lượng tối đa worker thực hiện replication (mặc định: '500')",
  "MINIO_API_TRANSITION_WORKERS": "Thiết lập số lượng worker thực hiện transition (mặc định: '100')",
  "MINIO_API_STALE_UPLOADS_EXPIRY": "Thiết lập thời gian hết hạn cho các multipart upload không hoạt động quá giá trị này (mặc định: '24h')",
  "MINIO_API_STALE_UPLOADS_CLEANUP_INTERVAL": "Thiết lập khoảng thời gian kiểm tra và xóa các multipart upload không hoạt động (mặc định: '6h')",
  "MINIO_API_DELETE_CLEANUP_INTERVAL": "Thiết lập khoảng thời gian xóa vĩnh viễn các đối tượng đã xóa khỏi thư mục \".trash\" (mặc định: '5m')",
  "MINIO_API_ODIRECT": "Bật hoặc tắt O_DIRECT cho ghi dữ liệu trong điều kiện đặc biệt. LƯU Ý: Không tắt O_DIRECT nếu chưa thử nghiệm kỹ (mặc định: 'on')",
  "MINIO_API_ROOT_ACCESS": "Tắt ('off') quyền truy cập root cho tất cả các API call bao gồm s3 và thao tác admin (mặc định: 'on')",
  "MINIO_API_SYNC_EVENTS": "Bật tính năng thông báo bucket đồng bộ (mặc định: 'off')",
  "MINIO_API_OBJECT_MAX_VERSIONS": "Thiết lập số phiên bản tối đa được phép cho mỗi đối tượng (mặc định: '9223372036854775807')",
  "MINIO_BROWSER": "Bật hoặc tắt quyền truy cập giao diện web console. Mặc định là 'on'",
  "MINIO_DOMAIN": "Bật yêu cầu kiểu virtual-host, ví dụ: \"mydomain.com\" hoặc nhiều domain cách nhau bằng dấu phẩy, ví dụ: \"sub1.mydomain.com,sub2.mydomain.com\""
}
