{
  "working_dir": "Working Directory",
  "db_path": "Designates the location where database files will be created and retrieved",
  "env": "Configures the instance's environment. Value must be either `production` or `development`.",
  "http_addr": "The address on which the HTTP server will listen.",
  "master_key": "Sets the instance's master key, automatically protecting all routes except GET /health.",
  "no_analytics": "Deactivates Meilisearch's built-in telemetry when provided.\nMeilisearch automatically collects data from all instances that do not opt out using this flag.\nAll gathered data is used solely for the purpose of improving Meilisearch, and can be deleted at any time.",
  "http_payload_size_limit": "Sets the maximum size of accepted payloads.",
  "log_level": "Defines how much detail should be present in Meilisearch's logs.\nMeilisearch currently supports six log levels, listed in order of increasing verbosity:  `OFF`, `ERROR`, `WARN`, `INFO`, `DEBUG`, `TRACE`",
  "max_indexing_memory": "Sets the maximum amount of RAM Meilisearch can use when indexing.",
  "max_indexing_threads": "Sets the maximum number of threads Meilisearch can use during indexing.",
  "dump_dir": "Sets the directory where Meilisearch will create dump files.",
  "import_dump": "Imports the dump file located at the specified path. Path must point to a .dump file.",
  "ignore_missing_dump": "Prevents Meilisearch from throwing an error when `import_dump` does not point to a valid dump file.",
  "ignore_dump_if_db_exists": "Prevents a Meilisearch instance with an existing database from throwing an error when using `import_dump`.",
  "schedule_snapshot": "Enables scheduled snapshots when true, disable when false (the default).\nIf the value is given as an integer, then enables the scheduled snapshot with the passed value as the interval between each snapshot, in seconds.",
  "snapshot_dir": "Sets the directory where Meilisearch will store snapshots.",
  "import_snapshot": "Launches Meilisearch after importing a previously-generated snapshot at the given filepath.",
  "ignore_missing_snapshot": "Prevents a Meilisearch instance from throwing an error when `import_snapshot` does not point to a valid snapshot file.",
  "ignore_snapshot_if_db_exists": "Prevents a Meilisearch instance with an existing database from throwing an error when using `import_snapshot`.",
  "ssl_auth_path": "Enables client authentication in the specified path.",
  "ssl_cert_path": "Sets the server's SSL certificates.",
  "ssl_key_path": "Sets the server's SSL key files.",
  "ssl_ocsp_path": "Sets the server's OCSP file.",
  "ssl_require_auth": "Makes SSL authentication mandatory.",
  "ssl_resumption": "Activates SSL session resumption.",
  "ssl_tickets": "Activates SSL tickets.",
  "experimental_enable_metrics": "Experimental metrics feature. Enables the Prometheus metrics on the `GET /metrics` endpoint.",
  "experimental_reduce_indexing_memory_usage": "Experimental RAM reduction during indexing, do not use in production.",
  "experimental_max_number_of_batched_tasks": "Experimentally reduces the maximum number of tasks that will be processed at once."
}
