{
  "MP_DATABASE": "Spécifiez le nom de fichier de la base de données locale pour stocker les données persistantes. Par défaut, il s'agit d'un fichier temporaire local qui est automatiquement supprimé lorsque Mailpit se ferme. Vous pouvez éventuellement utiliser une base de données rqlite distante en spécifiant une \"adresse http\" (voir la documentation).",
  "MP_LABEL": "Définissez une étiquette facultative pour identifier cette instance de Mailpit. Cela ajoute l'étiquette à l'interface utilisateur Web, aux serveurs SMTP et POP3.",
  "MP_TENANT_ID": "Définissez un ID de locataire (préfixe de table). Cela est utilisé pour isoler les données des autres instances de Mailpit partageant le même fichier de données (voir la documentation).",
  "MP_MAX_MESSAGES": "Nombre maximum de messages à stocker. Mailpit supprimera périodiquement les messages les plus anciens si ce nombre est dépassé. Réglez sur 0 pour désactiver la suppression automatique (voir la documentation).",
  "MP_MAX_AGE": "Âge maximum des messages à stocker en (h)heures ou (j)jours. Mailpit supprimera périodiquement les messages les plus anciens si ce nombre est dépassé. La valeur doit être en heures (ex : --max-age 36h) ou en jours (ex : --max-age 14j) (voir la documentation).",
  "MP_USE_MESSAGE_DATES": "Utilisez la date d'en-tête du message comme date et heure de réception de Mailpit au lieu de la date et heure de réception SMTP.",
  "MP_IGNORE_DUPLICATE_IDS": "Ignorez les messages en double basés sur les identifiants de message.",
  "MP_LOG_FILE": "Journalisez la sortie de Mailpit dans un fichier au lieu de stdout. ex : --log-file /chemin/vers/logfile.log",
  "MP_QUIET": "Journalisation silencieuse (erreurs uniquement)",
  "MP_VERBOSE": "Journalisation détaillée (debug)",
  "MP_UI_BIND_ADDR": "Interface de liaison HTTP et port pour l'interface utilisateur.",
  "MP_WEBROOT": "Définissez la racine Web pour l'interface utilisateur Web et l'API, par exemple mail entraînerait http://0.0.0.0:8025/mail/.",
  "MP_UI_AUTH_FILE": "Spécifiez un fichier de mot de passe pour l'authentification de base de l'interface utilisateur Web et de l'API (voir la documentation).",
  "MP_UI_TLS_CERT": "Certificat TLS pour l'interface utilisateur Web et l'API (c'est-à-dire HTTPS). Cet argument nécessite que l'argument --ui-tls-key ou la variable d'environnement MP_UI_TLS_KEY soit défini.",
  "MP_UI_TLS_KEY": "Clé TLS pour l'interface utilisateur Web et l'API (c'est-à-dire HTTPS). Cet argument nécessite que l'argument --ui-tls-cert ou la variable d'environnement MP_UI_TLS_CERT soit défini.",
  "MP_API_CORS": "Définissez l'en-tête API CORS Access-Control-Allow-Origin si vous avez besoin de requêtes de navigateur inter-domaines.",
  "MP_BLOCK_REMOTE_CSS_AND_FONTS": "Bloquez tout accès du navigateur aux CSS et polices distants importés via les feuilles de style des messages. Mailpit utilise la méthode HTTP Content Security Policy (CSP) pour les bloquer. Cela ne bloque pas les images distantes ou les clics sur des liens externes.",
  "MP_ENABLE_SPAMASSASSIN": "Activez l'intégration SpamAssassin pour le score de spam des messages (voir la documentation).",
  "MP_ALLOW_UNTRUSTED_TLS": "Ne vérifiez pas les certificats HTTPS pour le vérificateur de liens et la génération de captures d'écran.",
  "MP_SMTP_BIND_ADDR": "Interface de liaison SMTP et port.",
  "MP_SMTP_AUTH_FILE": "Spécifiez un fichier de mot de passe pour l'authentification SMTP (voir la documentation).",
  "MP_SMTP_AUTH_ACCEPT_ANY": "Acceptez tout nom d'utilisateur et mot de passe SMTP, y compris aucun. Utilisez ceci pour autoriser pratiquement tout.",
  "MP_SMTP_TLS_CERT": "Certificat TLS pour SMTP STARTTLS. Cet argument nécessite que l'argument --smtp-tls-key ou la variable d'environnement MP_SMTP_TLS_KEY soit défini.",
  "MP_SMTP_TLS_KEY": "Clé TLS pour SMTP STARTTLS. Cet argument nécessite que l'argument --smtp-tls-cert ou la variable d'environnement MP_SMTP_TLS_CERT soit défini.",
  "MP_SMTP_REQUIRE_STARTTLS": "Exigez que tous les clients SMTP utilisent le chiffrement STARTTLS. Si défini sur true, les seules commandes autorisées sont NOOP, EHLO, STARTTLS et QUIT (comme spécifié dans la RFC 4954) jusqu'à ce que la connexion soit mise à niveau vers STARTTLS.",
  "MP_SMTP_REQUIRE_TLS": "Exigez que tous les clients SMTP utilisent le chiffrement SSL/TLS. Si défini sur true, toutes les connexions au serveur SMTP doivent être gérées via TLS. Cela est différent de STARTTLS qui nécessite que la connexion initiale ne soit pas chiffrée. Notez que cette option désactive STARTTLS et peut réduire la compatibilité des clients.",
  "MP_SMTP_AUTH_ALLOW_INSECURE": "En général, STARTTLS ou TLS est imposé pour toute authentification SMTP. Cette option permet une authentification SMTP PLAIN et LOGIN non sécurisée lors de l'utilisation de STARTTLS.",
  "MP_SMTP_STRICT_RFC_HEADERS": "Forcez Mailpit à renvoyer une erreur SMTP si les en-têtes de message contiennent \n au lieu de \r\n comme sauts de ligne. Par défaut, Mailpit corrigera silencieusement les sauts de ligne incorrects générés par certains clients sendmail défectueux (voir le problème Github connexe).",
  "MP_SMTP_MAX_RECIPIENTS": "Nombre maximum de destinataires SMTP autorisés par message.",
  "MP_SMTP_ALLOWED_RECIPIENTS": "Autorisez uniquement les destinataires SMTP correspondant à une expression régulière. Utilisez ceci pour restreindre les courriels entrants uniquement à ceux envoyés à une liste prédéfinie. Un exemple serait --smtp-allowed-recipients '{'@'}example.com$' pour n'autoriser que les courriels envoyés à des destinataires se terminant par {'@'}example.com.",
  "MP_SMTP_DISABLE_RDNS": "Désactivez les recherches DNS inversées SMTP. SMTP essaiera par défaut de résoudre le nom d'hôte de l'adresse IP du client connecté, mais dans les réseaux de test, cela peut parfois poser problème en provoquant des retards pour chaque message livré.",
  "MP_SMTP_RELAY_CONFIG": "Fichier de configuration SMTP pour activer le relais/libération des messages (voir la documentation). Alternativement, toute la configuration peut être transmise via des variables d'environnement.",
  "MP_SMTP_RELAY_ALL": "Relayer automatiquement tous les messages entrants via un serveur SMTP externe (voir la documentation). Utilisez avec une extrême prudence !",
  "MP_SMTP_RELAY_MATCHING": "Relayer automatiquement certains messages entrants vers des destinataires correspondants via un serveur SMTP externe (voir la documentation).",
  "MP_POP3_BIND_ADDR": "Interface de liaison et port du serveur POP3.",
  "MP_POP3_AUTH_FILE": "Spécifiez un fichier de mot de passe pour l'authentification POP3 (voir la documentation).",
  "MP_POP3_TLS_CERT": "Certificat TLS pour POP3 SSL/TLS. Cet argument nécessite que l'argument --pop3-tls-key ou la variable d'environnement MP_POP3_TLS_KEY soit défini.",
  "MP_POP3_TLS_KEY": "Clé TLS pour POP3 SSL/TLS. Cet argument nécessite que l'argument --pop3-tls-cert ou la variable d'environnement MP_POP3_TLS_CERT soit défini.",
  "MP_TAG": "Ajoutez automatiquement des étiquettes aux nouveaux messages correspondant à des filtres (voir la documentation).",
  "MP_TAGS_CONFIG": "Chargez les filtres d'étiquettes à partir d'un fichier de configuration yaml (voir la documentation).",
  "MP_TAGS_TITLE_CASE": "Imposez la casse des titres pour toutes les nouvelles étiquettes créées (voir la documentation).",
  "MP_TAGS_DISABLE": "Désactivez l'étiquetage automatique spécifique. Cette option prend une liste d'options séparées par des virgules (voir la documentation).",
  "MP_WEBHOOK_URL": "Appelez un webhook lorsque de nouveaux messages sont reçus (voir la documentation), ex : --webhook-url https://example.com/webhook.php.",
  "MP_WEBHOOK_LIMIT": "Limitez le taux des requêtes webhook par seconde. Pour éviter de potentiellement surcharger le serveur webhook, cela est limité par défaut à un maximum de 1 requête par seconde (voir la documentation)."
}