{
  "MINIO_ADDRESS": "Lie le processus du serveur MinIO à une adresse réseau et un numéro de port spécifiques.",
  "MINIO_CONSOLE_ADDRESS": "Spécifie un port statique pour la console MinIO intégrée.",
  "MINIO_CERTS_DIR": "Spécifie le chemin vers le dossier contenant les certificats utilisés par le processus MinIO pour configurer la connectivité TLS/SSL.",
  "MINIO_ROOT_USER": "Utilisateur root. Par défaut : minioadmin",
  "MINIO_ROOT_PASSWORD": "Mot de passe de l'utilisateur root. Par défaut : minioadmin",
  "MINIO_SITE_NAME": "Nom du site, par exemple \"cal-rack0\"",
  "MINIO_SITE_REGION": "Nom de l'emplacement du serveur, par exemple \"us-west-1\"",
  "MINIO_SITE_COMMENT": "Ajoutez éventuellement un commentaire à ce paramètre",
  "MINIO_STORAGE_CLASS_STANDARD": "Définissez le nombre de parités pour la classe de stockage standard par défaut, par exemple \"EC:4\"",
  "MINIO_STORAGE_CLASS_RRS": "Définissez le nombre de parités pour la classe de stockage à redondance réduite, par exemple \"EC:2\"",
  "MINIO_ETCD_ENDPOINTS": "liste des points de terminaison etcd séparés par des virgules, par exemple \"http://localhost:2379\"",
  "MINIO_ETCD_PATH_PREFIX": "préfixe d'espace de noms pour isoler les locataires, par exemple \"customer1/\"",
  "MINIO_API_REQUESTS_MAX": "définir le nombre maximum de requêtes simultanées (par défaut : 'auto')",
  "MINIO_API_CLUSTER_DEADLINE": "définir la date limite pour la vérification de l'état de préparation du cluster (par défaut : '10s')",
  "MINIO_API_CORS_ALLOW_ORIGIN": "définir une liste séparée par des virgules des origines autorisées pour les requêtes CORS (par défaut : '*')",
  "MINIO_API_REMOTE_TRANSPORT_DEADLINE": "Définir la date limite pour les requêtes API sur les transports distants lors du proxy entre les instances fédérées, par exemple \"2h\" (par défaut : '2h').",
  "MINIO_API_LIST_QUORUM": "Définir le quorum acceptable attendu pour les opérations de liste, par exemple \"optimal\", \"reduced\", \"disk\", \"strict\", \"auto\" (par défaut : 'strict').",
  "MINIO_API_REPLICATION_PRIORITY": "Définir la priorité de réplication (par défaut : 'auto').",
  "MINIO_API_REPLICATION_MAX_WORKERS": "Définir le nombre maximum de travailleurs de réplication (par défaut : '500').",
  "MINIO_API_TRANSITION_WORKERS": "Définir le nombre de travailleurs de transition (par défaut : '100').",
  "MINIO_API_STALE_UPLOADS_EXPIRY": "Définir l'expiration des téléchargements multipartites obsolètes plus anciens que cette valeur (par défaut : '24h').",
  "MINIO_API_STALE_UPLOADS_CLEANUP_INTERVAL": "Définir les intervalles de changement lorsque les téléchargements multipartites obsolètes sont expirés (par défaut : '6h').",
  "MINIO_API_DELETE_CLEANUP_INTERVAL": "Définir les intervalles de changement lorsque les objets supprimés sont définitivement supprimés du dossier \".trash\" (par défaut : '5m').",
  "MINIO_API_ODIRECT": "Activer ou désactiver O_DIRECT pour les écritures dans des conditions spéciales. REMARQUE : ne désactivez pas O_DIRECT sans tests préalables (par défaut : 'on').",
  "MINIO_API_ROOT_ACCESS": "Désactiver l'accès aux informations d'identification root pour tous les appels API, y compris s3, les opérations d'administration (par défaut : 'on').",
  "MINIO_API_SYNC_EVENTS": "Activer les notifications de compartiment synchrones (par défaut : 'off').",
  "MINIO_API_OBJECT_MAX_VERSIONS": "Définir le nombre maximum de versions autorisées par objet (par défaut : '9223372036854775807').",
  "MINIO_BROWSER": "Activer ou désactiver l'accès à l'interface utilisateur Web de la console. Par défaut, il est activé ('on').",
  "MINIO_DOMAIN": "Activer les requêtes de type hôte virtuel ex : \"mydomain.com\" ou plusieurs domaines avec des valeurs séparées par des virgules. ex : \"sub1.mydomain.com,sub2.mydomain.com\""
}
