{
  "MINIO_ADDRESS": "Lie le processus du serveur MinIO à une adresse réseau et un numéro de port spécifiques.",
  "MINIO_CONSOLE_ADDRESS": "Spécifie un port statique pour la console MinIO intégrée.",
  "MINIO_CERTS_DIR": "Spécifie le chemin vers le dossier contenant les certificats utilisés par le processus MinIO pour configurer la connectivité TLS/SSL.",
  "MINIO_ROOT_USER": "Utilisateur root. Par défaut : minioadmin",
  "MINIO_ROOT_PASSWORD": "Mot de passe de l'utilisateur root. Par défaut : minioadmin",
  "MINIO_SITE_NAME": "Nom du site, par exemple \"cal-rack0\"",
  "MINIO_SITE_REGION": "Nom de l'emplacement du serveur, par exemple \"us-west-1\"",
  "MINIO_SITE_COMMENT": "Ajoutez éventuellement un commentaire à ce paramètre",
  "MINIO_STORAGE_CLASS_STANDARD": "Définissez le nombre de parités pour la classe de stockage standard par défaut, par exemple \"EC:4\"",
  "MINIO_STORAGE_CLASS_RRS": "Définissez le nombre de parités pour la classe de stockage à redondance réduite, par exemple \"EC:2\"",
  "MINIO_STORAGE_CLASS_COMMENT": "Ajoutez éventuellement un commentaire à ce paramètre",
  "MINIO_ETCD_ENDPOINTS": "Liste séparée par des virgules des points de terminaison etcd, par exemple \"http://localhost:2379\"",
  "MINIO_ETCD_PATH_PREFIX": "Préfixe de l'espace de noms pour isoler les locataires, par exemple \"customer1/\"",
  "MINIO_ETCD_COREDNS_PATH": "Enregistrements DNS de bucket partagés, par défaut \"/skydns\"",
  "MINIO_ETCD_CLIENT_CERT": "Certificat client pour l'authentification mTLS",
  "MINIO_ETCD_CLIENT_CERT_KEY": "Clé de certificat client pour l'authentification mTLS",
  "MINIO_ETCD_COMMENT": "Ajoutez éventuellement un commentaire à ce paramètre",
  "MINIO_API_REQUESTS_MAX": "Définissez le nombre maximum de requêtes simultanées (par défaut : 'auto')",
  "MINIO_API_CLUSTER_DEADLINE": "Définissez la date limite pour la vérification de l'état de préparation du cluster (par défaut : '10s')",
  "MINIO_API_CORS_ALLOW_ORIGIN": "Définissez une liste séparée par des virgules des origines autorisées pour les requêtes CORS (par défaut : '*')",
  "MINIO_API_REMOTE_TRANSPORT_DEADLINE": "Définissez la date limite pour les requêtes API sur les transports distants lors du proxy entre les instances fédérées, par exemple \"2h\" (par défaut : '2h')",
  "MINIO_API_LIST_QUORUM": "Définissez le quorum acceptable attendu pour les opérations de liste, par exemple \"optimal\", \"reduced\", \"disk\", \"strict\", \"auto\" (par défaut : 'strict')",
  "MINIO_API_REPLICATION_PRIORITY": "Définissez la priorité de réplication (par défaut : 'auto')",
  "MINIO_API_REPLICATION_MAX_WORKERS": "Définissez le nombre maximum de travailleurs de réplication (par défaut : '500')",
  "MINIO_API_TRANSITION_WORKERS": "Définissez le nombre de travailleurs de transition (par défaut : '100')",
  "MINIO_API_STALE_UPLOADS_EXPIRY": "Définissez l'expiration des téléchargements multipartites obsolètes plus anciens que cette valeur (par défaut : '24h')",
  "MINIO_API_STALE_UPLOADS_CLEANUP_INTERVAL": "Définissez les intervalles de nettoyage des téléchargements multipartites obsolètes (par défaut : '6h')",
  "MINIO_API_DELETE_CLEANUP_INTERVAL": "Définissez les intervalles de nettoyage des objets supprimés définitivement du dossier \".trash\" (par défaut : '5m')",
  "MINIO_API_ODIRECT": "Activez ou désactivez O_DIRECT pour les écritures dans des conditions spéciales. REMARQUE : ne désactivez pas O_DIRECT sans tests préalables (par défaut : 'on')",
  "MINIO_API_ROOT_ACCESS": "Désactivez l'accès aux informations d'identification root pour toutes les appels API, y compris s3, opérations d'administration (par défaut : 'on')",
  "MINIO_API_SYNC_EVENTS": "Activez la synchronisation des notifications de bucket (par défaut : 'off')",
  "MINIO_API_OBJECT_MAX_VERSIONS": "Définissez le nombre maximal de versions autorisées par objet (par défaut : '9223372036854775807')",
  "MINIO_BROWSER": "Activez ou désactivez l'accès à l'interface utilisateur Web de la console. Par défaut, il est défini sur 'on'",
  "MINIO_DOMAIN": "Activez les requêtes de style hôte virtuel, par exemple \"mydomain.com\" ou plusieurs domaines avec des valeurs séparées par des virgules, par exemple \"sub1.mydomain.com,sub2.mydomain.com\""
}
