{
  "working_dir": "Katalog roboczy",
  "db_path": "Określa lokalizację, w której pliki bazy danych będą tworzone i pobierane",
  "env": "Konfiguruje środowisko instancji. Wartością musi być `produkcja` lub `development`.",
  "http_addr": "Adres, na którym będzie słuchany serwer HTTP.",
  "master_key": "Ustawia główny klucz instancji, automatycznie chroniąc wszystkie trasy poza GET /zdrowie.",
  "no_analytics": "Dezaktywuje wbudowaną telemetrię Meilisearch.\nMeilisearch automatycznie zbiera dane ze wszystkich instancji, które nie rezygnują z użycia tej flagi.\nWszystkie zgromadzone dane są wykorzystywane wyłącznie w celu ulepszenia Meilisesearch i mogą być w każdej chwili usuwane.",
  "http_payload_size_limit": "Ustawia maksymalny rozmiar zaakceptowanych ładunków.",
  "log_level": "Określa ile szczegółów powinno być obecne w dziennikach Meilisearch.\nMeilisearch obsługuje obecnie sześć poziomów logów, wymienionych w kolejności rosnącej werbosity: `OFF`, `ERROR`, `WARN`, `INFO`, `DEBUG`, `TRACE`",
  "max_indexing_memory": "Ustawia maksymalną ilość Meilisearch RAM podczas indeksowania.",
  "max_indexing_threads": "Ustawia maksymalną liczbę wątków, które Meilisearch może używać podczas indeksowania.",
  "dump_dir": "Ustawia katalog, w którym Meilisearch utworzy pliki zrzutów.",
  "import_dump": "Importuje plik zrzutu znajdujący się w określonej ścieżce. Ścieżka musi wskazywać plik .zrzut.",
  "ignore_missing_dump": "Zapobiega wyrzucaniu przez Meilisearch błędu, gdy `import_dump` nie wskazuje na poprawny plik zrzutu.",
  "ignore_dump_if_db_exists": "Zapobiega wyrzucaniu błędu podczas używania `import_dump` przez instancję Meilisearch z istniejącą bazą danych.",
  "schedule_snapshot": "Włącza zaplanowane migawki gdy prawda, wyłącz gdy fałsz (domyślnie).\nJeśli wartość jest podana jako liczba całkowita, następnie włącza zaplanowany migawkę z przekazaną wartością jako odstęp pomiędzy każdym zrzutem, w sekundach.",
  "snapshot_dir": "Ustawia katalog, w którym Meilisearch będzie przechowywać zrzuty.",
  "import_snapshot": "Uruchamia Meilisearch po imporcie wcześniej wygenerowanego migawki na danej ścieżce pliku.",
  "ignore_missing_snapshot": "Zapobiega wyrzucaniu błędu przez instancję Meilisearch gdy `import_snapshot` nie wskazuje na poprawny plik migawki.",
  "ignore_snapshot_if_db_exists": "Zapobiega wyrzucaniu błędu podczas używania `import_snapshot` przez instancję Meilisearch z istniejącą bazą danych.",
  "ssl_auth_path": "Włącza uwierzytelnianie klienta w określonej ścieżce.",
  "ssl_cert_path": "Ustawia certyfikaty SSL serwera.",
  "ssl_key_path": "Ustawia pliki klucza SSL serwera.",
  "ssl_ocsp_path": "Ustawia plik OCSP serwera.",
  "ssl_require_auth": "Uwierzytelnianie SSL jest obowiązkowe.",
  "ssl_resumption": "Aktywuje wznowienie sesji SSL.",
  "ssl_tickets": "Aktywuje zgłoszenia SSL.",
  "experimental_enable_metrics": "Eksperymentalna funkcja metryki. Włącza metryki Prometheus w punkcie końcowym `GET /metrics`.",
  "experimental_reduce_indexing_memory_usage": "Eksperymentalne zmniejszenie RAM podczas indeksowania nie stosuje się w produkcji.",
  "experimental_max_number_of_batched_tasks": "Eksperymentalnie zmniejsza maksymalną liczbę zadań, które będą przetwarzane jednocześnie."
}
