{
  "MP_DATABASE": "Angi filnavnet til databasen for å lagre vedvarende data. Standard er en lokal, midlertidig fil som automatisk slettes når Mailpit avslutter. Du kan eventuelt bruke en ekstern rqlite database ved å angi en “http address” (se dokumenter).",
  "MP_LABEL": "Angi en valgfri etikett for å identifisere denne E-post instansen. Dette legger etiketten til webUI, SMTP og POP3 serverne. (Automatic Translation)",
  "MP_TENANT_ID": "Angi en bedrifts-ID (tabellprefiks). Dette brukes til å isolere dataene fra andre Mailpit instanser deler samme datafil (se docs).",
  "MP_MAX_MESSAGES": "Maksimalt antall meldinger til butikken. Mailpit vil periodevis slette de eldste meldingene hvis høyere enn dette. Sett til 0 for å deaktivere automatisk sletting (se docs).",
  "MP_MAX_AGE": "Maksimal alder på meldinger som skal lagres i (h)ours eller (d)ays. Mailpit vil periodevis slette de eldste meldingene hvis større enn dette. Verdien må være enten i timer (Eksempel: --max-age 36h) eller dager (Eksempel: --max-age 14d) (se docs).",
  "MP_USE_MESSAGE_DATES": "Bruk meldingshoveddato som postadressen mottok dato og klokkeslett i stedet for SMTP-mottatt dato og klokkeslett.",
  "MP_IGNORE_DUPLICATE_IDS": "Ignorer dupliserte meldinger basert på meldinge-Ids.",
  "MP_LOG_FILE": "Logg utdata til Mailpit i stedet for stdout. Eksempel: --log-file /path/to/logfile.log",
  "MP_QUIET": "Stille logging (kun feil)",
  "MP_VERBOSE": "Detaljert logging (debug)",
  "MP_UI_BIND_ADDR": "HTTP bind grensesnitt og port for brukergrensesnitt.",
  "MP_WEBROOT": "Sett webroot for webUI & API, for eksempel mail, vil resultere i http://0.0.0.0:8025/mail/.",
  "MP_UI_AUTH_FILE": "Oppgi en passordfil for brukergrensesnittet og API grunnleggende godkjenning (se dokumentasjoner).",
  "MP_UI_TLS_CERT": "TLS-sertifikat for web UI & API (da: HTTPS). Dette valget krever at --ui-tls-key argument eller MP_UI_TLS_KEY miljøvariabelen er satt.",
  "MP_UI_TLS_KEY": "TLS-nøkkel for web UI & API ((ie: HTTPS). Dette alternativet krever at --ui-tls-cert argument eller MP_UI_TLS_CERT miljøvariabelen er satt.",
  "MP_API_CORS": "Sett API CORS Access-Control-Allow-Origin header hvis du krever forespørsel fra nettlesere via forskjellige domener.",
  "MP_BLOCK_REMOTE_CSS_AND_FONTS": "Blokker alle nettlesere tilgang til eksterne CSS og skrifter importert via meldingsstilark. Mailpit bruker HTTP Content Security Policy (CSP) metoden for å blokkere disse. Dette blokkerer ikke eksterne bilder eller klikker på ekstern lenke.",
  "MP_ENABLE_SPAMASSASSIN": "Aktiver Spamaslite integrasjon for meldingsspamminess-score (se dokumenter).",
  "MP_ALLOW_UNTRUSTED_TLS": "Ikke verifiser HTTPS-sertifikater for noen lenke sjekker & skjermdump-generasjon.",
  "MP_SMTP_BIND_ADDR": "SMTP bind grensesnitt og port.",
  "MP_SMTP_AUTH_FILE": "Oppgi en passordfil for SMTP-autentisering (se dokumentasjoner).",
  "MP_SMTP_AUTH_ACCEPT_ANY": "Godta hvilket som helst SMTP brukernavn og passord, inkludert ingen. Bruk dette til å grunnleggende tillate noe.",
  "MP_SMTP_TLS_CERT": "TLS-sertifikat for SMTP STARTTLS. Dette valget krever at --smtp-tls-tasten argument eller MP_SMTP_TLS_KEY miljøvariabelen skal settes.",
  "MP_SMTP_TLS_KEY": "TLS-nøkkel for SMTP STARTTLS. Dette valget krever at --smtp-tls-cert argument eller MP_SMTP_TLS_CERT-miljøvariabelen skal settes.",
  "MP_SMTP_REQUIRE_STARTTLS": "Krev at alle SMTP-klienter bruker STARTTLS kryptering. Hvis satt til sann, er de eneste tillatte kommandoene NOOP, EHLO, STARTTLS og QUIT (som spesifisert i RFC 4954) til forbindelsen er oppgradert til STARTTLS.",
  "MP_SMTP_REQUIRE_TLS": "Krev at alle SMTP-klienter bruker SSL/TLS kryptering. Hvis satt til sant, må alle tilkoblinger til SMTP-serveren håndteres over TLS. Dette er forskjellig fra STARTTLS, som krever at den første tilkoblingen ikke krypteres. Vær oppmerksom på at dette alternativet deaktiverer STARTTLS og kan redusere klientkompatibiliteten.",
  "MP_SMTP_AUTH_ALLOW_INSECURE": "Typisk er enten STARTTLS eller TLS tvunget for all SMTP-autentisering. Dette alternativet tillater usikker PLAIN og LOGIN SMTP-autentisering ved bruk av STARTTLS.",
  "MP_SMTP_STRICT_RFC_HEADERS": "Tving Mailpit til å returnere en SMTP-feil hvis meldingsoverskriftene inneholder \\n i stedet for \\r\\n -linjeskruer. Som standard vil Mailpit fremdeles fikse feil linjeskift generert av noen ødelagte sendmailklienter (se beslektede GitHub problemer).",
  "MP_SMTP_MAX_RECIPIENTS": "Maksimalt antall SMTP-mottakere tillatt per melding.",
  "MP_SMTP_ALLOWED_RECIPIENTS": "Kun tillat SMTP-mottakere som inneholder et regulært uttrykk. Bruk dette til å begrense innkommende e-postmeldinger kun til de som er sendt til en forhåndsdefinert liste. Et eksempel på dette vil være --smtp-allowed-recipients '{'@'}example.com$' for å bare tillate e-post sendt til mottakere som slutter på {'@'}example.com.",
  "MP_SMTP_DISABLE_RDNS": "Deaktivere SMTP omvendt DNS-oppslag. SMTP vil som standard prøve å løse vertsnavnet til IP-adressen til koblingsklienten, men i testnettverk kan dette noen ganger være problematisk og forårsake forsinkelser for alle meldinger levert.",
  "MP_SMTP_RELAY_CONFIG": "SMTP-konfigurasjonsfilen for å aktivere meldingsrelé/-utgivelse (se docs). Alternativt kan hele konfigurasjonen sendes via miljøvariabler.",
  "MP_SMTP_RELAY_ALL": "Automatisk formidle alle innkommende meldinger via ekstern SMTP-tjener (se dokumentene). Bruk med stor forsiktighet!",
  "MP_SMTP_RELAY_MATCHING": "Sender automatisk noen innkommende meldinger til å matche mottakere via ekstern SMTP-tjener (se dokumentasjoner).",
  "MP_POP3_BIND_ADDR": "POP3 server bind interface og port.",
  "MP_POP3_AUTH_FILE": "Oppgi en passordfil for POP3-autentisering (se dokumentasjoner).",
  "MP_POP3_TLS_CERT": "TLS-sertifikat for POP3 SSL/TLS. Dette valget krever at --pop3-tls-nøkkelargument eller MP_POP3_TLS_KEY miljøvariabelen skal angis.",
  "MP_POP3_TLS_KEY": "TLS-nøkkel for POP3 SSL/TLS. Dette alternativet krever at --pop3-tls-cert argument eller MP_POP3_TLS_CERT-miljøvariabelen skal settes.",
  "MP_TAG": "Auto-tag nye meldinger som matcher filtre (se dokumenter).",
  "MP_TAGS_CONFIG": "Last tags filtre fra yaml konfigurasjonsfil (se docs).",
  "MP_TAGS_TITLE_CASE": "Krev TitleCasing for alle nyopprettede tagger (se dokumentene).",
  "MP_TAGS_DISABLE": "Deaktiver spesifikk auto-tagging. Dette alternativet tar en kommadelt liste over alternativer (se dokumenter).",
  "MP_WEBHOOK_URL": "Ring en webhook når nye meldinger blir mottatt (se docs). Eksempel: --webhook-url https://example.com/webhook.php",
  "MP_WEBHOOK_LIMIT": "Vurder begrenset webhook-forespørsler per sekund. For å forhindre mulig overbelastning av webhook-serveren, er denne satsen begrenset som standard til maksimalt 1 forespørsel per sekund (se dokumenter)."
}
