{
  "working_dir": "Arbeidskatalog (arbeid)",
  "db_path": "Designaterer hvor databasefilene vil bli opprettet og hentet",
  "env": "Konfigurerer instansens miljø. Verdien må være enten 'produksjon' eller 'utvikles'.",
  "http_addr": "Adressen som HTTP serveren vil lytte til.",
  "master_key": "Setter instansens hovednøkkel, beskytter automatisk alle ruter unntatt GET /health.",
  "no_analytics": "Deaktiverer Meilis） sin innebygde telemetri når de er oppgitt.\nMeilismas automatisk samler inn data fra alle tilfeller som ikke velger å bruke dette flagget.\nAlle innsamlede data brukes bare til å forbedre meilisling, og kan slettes når som helst.",
  "http_payload_size_limit": "Angir maksimal størrelse for aksepterte nyttelaster.",
  "log_level": "Definerer hvor mye detaljer som skal finnes i Meilistikasonsine logger.\nMeilisemål støtter for tiden seks loggnivåer, listet opp i forkant av økende versjon: `OFF`, `ERROR`, `WARN`, `INFO`, `DEBUG`, `TRACE`",
  "max_indexing_memory": "Angir maksimal mengde RAM Meilis″kan brukes ved indeksering.",
  "max_indexing_threads": "Angir maksimalt antall tråder Meilispril kan brukes under indeksering.",
  "dump_dir": "Angir mappen hvor MeilisGen skal opprette dumpfiler.",
  "import_dump": "Importerer dumpefilen til angitt sti. Sti må peke til en .dump fil.",
  "ignore_missing_dump": "Prevents Meilisbacked fra å kaste en feil når `import_dump` ikke peker til en gyldig dumpefil.",
  "ignore_dump_if_db_exists": "Hindrer en meilisforskningsinstans med en eksisterende database fra å kaste en feil ved bruk av `import_dump`.",
  "schedule_snapshot": "Aktiverer planlagte skjermbilder når sant, deaktiver når falsk (standard).\nHvis verdien er angitt som et heltall, gjør det mulig for det planlagte øyeblikksbildet med den passerte verdien som er mellom hver øyeblikksfot, i løpet av sekunder.",
  "snapshot_dir": "Angir mappen hvor Meilisparcten skal lagre øyeblikksbilder.",
  "import_snapshot": "Starter Meilisthorough etter å ha importert et allerede generert øyeblikksbilde på det gitte filen.",
  "ignore_missing_snapshot": "Forhindrer en Meilisforskningsinstans fra å kaste en feil når `import_snapshot` ikke peker til en gyldig øyeblikksbildefil.",
  "ignore_snapshot_if_db_exists": "Forhindrer en Meilisforskningsinstans med en eksisterende database fra å kaste en feil ved bruk av `import_snapshot`.",
  "ssl_auth_path": "Aktiverer klientautentisering i den angitte banen.",
  "ssl_cert_path": "Angir serverens SSL-sertifikater.",
  "ssl_key_path": "Angir serverens SSL-nøkkelfiler.",
  "ssl_ocsp_path": "Angir serverens OCSP-fil.",
  "ssl_require_auth": "Gjør SSL autentisering obligatorisk.",
  "ssl_resumption": "Aktiverer resumping av SSL.",
  "ssl_tickets": "Aktiverer SSL-saker.",
  "experimental_enable_metrics": "Eksperimentelle måltallsfunksjonen. Aktiverer Prometheus måltall på endelig `GET /måltall`-poeng.",
  "experimental_reduce_indexing_memory_usage": "Eksperimentell RAM- reduksjon under indeksering skal ikke brukes i produksjon.",
  "experimental_max_number_of_batched_tasks": "Eksperimentelt sett reduserer man maksimalt antall oppgaver som skal behandles samtidig."
}
