{
  "working_dir": "دليل العمل",
  "db_path": "يحدد الموقع الذي سيتم فيه إنشاء واسترداد ملفات قاعدة البيانات",
  "env": "يُكوّن بيئة المُستخدم. يجب أن تكون القيمة إما `production` (إنتاج) أو `development` (تطوير).",
  "http_addr": "العنوان الذي سيستمع إليه خادم HTTP.",
  "master_key": "يُعيّن مفتاح الماستر للمُستخدم، ويحمي تلقائيًا جميع المسارات باستثناء GET /health.",
  "no_analytics": "يُعطّل القياس عن بُعد (telemetry) المدمج في Meilisearch عند توفيره.\nيجمع Meilisearch البيانات تلقائيًا من جميع المُستخدمين الذين لم يختاروا الانسحاب باستخدام هذه العلامة.\nتُستخدم جميع البيانات المجمعة فقط لغرض تحسين Meilisearch، ويمكن حذفها في أي وقت.",
  "http_payload_size_limit": "يُعيّن الحد الأقصى لحجم حمولات HTTP المقبولة.",
  "log_level": "يُحدد مقدار التفاصيل التي يجب أن تكون موجودة في سجلات Meilisearch.\nيدعم Meilisearch حاليًا ستة مستويات للسجل، مُدرجة بترتيب زيادة الإسهاب: `OFF`, `ERROR`, `WARN`, `INFO`, `DEBUG`, `TRACE`",
  "max_indexing_memory": "يُعيّن الحد الأقصى لكمية ذاكرة الوصول العشوائي (RAM) التي يمكن لـ Meilisearch استخدامها عند الفهرسة.",
  "max_indexing_threads": "يُعيّن الحد الأقصى لعدد سلاسل المعالجة (threads) التي يمكن لـ Meilisearch استخدامها أثناء الفهرسة.",
  "dump_dir": "يُعيّن الدليل الذي سيقوم Meilisearch بإنشاء ملفات النسخ الاحتياطي (dump) فيه.",
  "import_dump": "يستورد ملف النسخ الاحتياطي الموجود في المسار المحدد. يجب أن يشير المسار إلى ملف بامتداد .dump.",
  "ignore_missing_dump": "يمنع Meilisearch من إظهار خطأ عندما لا يشير `import_dump` إلى ملف نسخ احتياطي صالح.",
  "ignore_dump_if_db_exists": "يمنع مُستخدم Meilisearch الذي لديه قاعدة بيانات موجودة من إظهار خطأ عند استخدام `import_dump`.",
  "schedule_snapshot": "يُمكّن اللقطات المجدولة (scheduled snapshots) عندما تكون القيمة صحيحة (true)، ويُعطّلها عندما تكون خاطئة (false) (وهو الافتراضي).\nإذا أُعطيت القيمة كرقم صحيح، فإنه يُمكّن اللقطة المجدولة بالقيمة المُمررة كفاصل زمني بين كل لقطة، بالثواني.",
  "snapshot_dir": "يُعيّن الدليل الذي سيقوم Meilisearch بتخزين اللقطات فيه.",
  "import_snapshot": "يُطلق Meilisearch بعد استيراد لقطة تم إنشاؤها مسبقًا في مسار الملف المُعطى.",
  "ignore_missing_snapshot": "يمنع مُستخدم Meilisearch من إظهار خطأ عندما لا يشير `import_snapshot` إلى ملف لقطة صالح.",
  "ignore_snapshot_if_db_exists": "يمنع مُستخدم Meilisearch الذي لديه قاعدة بيانات موجودة من إظهار خطأ عند استخدام `import_snapshot`.",
  "ssl_auth_path": "يُمكّن مصادقة العميل في المسار المحدد.",
  "ssl_cert_path": "يُعيّن شهادات SSL الخاصة بالخادم.",
  "ssl_key_path": "يُعيّن ملفات مفتاح SSL الخاصة بالخادم.",
  "ssl_ocsp_path": "يُعيّن ملف OCSP الخاص بالخادم.",
  "ssl_require_auth": "يجعل مصادقة SSL إلزامية.",
  "ssl_resumption": "يُنشّط استئناف جلسة SSL.",
  "ssl_tickets": "يُنشّط تذاكر SSL.",
  "experimental_enable_metrics": "ميزة المقاييس التجريبية. تُمكن مقاييس Prometheus على نقطة النهاية `GET /metrics`.",
  "experimental_reduce_indexing_memory_usage": "تقليل تجريبي لذاكرة الوصول العشوائي (RAM) أثناء الفهرسة، لا تستخدمه في بيئة الإنتاج.",
  "experimental_max_number_of_batched_tasks": "يُقلل بشكل تجريبي الحد الأقصى لعدد المهام التي سيتم معالجتها دفعة واحدة."
}
