{
  "MINIO_ADDRESS": "يربط عملية خادم MinIO بعنوان شبكة ورقم منفذ محدد.",
  "MINIO_CONSOLE_ADDRESS": "يحدد منفذًا ثابتًا لوحدة تحكم MinIO المضمنة (MinIO Console).",
  "MINIO_CERTS_DIR": "يحدد المسار إلى المجلد الذي يحتوي على الشهادات التي تستخدمها عملية MinIO لتكوين اتصال TLS/SSL.",
  "MINIO_ROOT_USER": "مستخدم الجذر (الروت). القيمة الافتراضية هي minioadmin",
  "MINIO_ROOT_PASSWORD": "كلمة مرور مستخدم الجذر. القيمة الافتراضية هي minioadmin",
  "MINIO_SITE_NAME": "اسم الموقع، على سبيل المثال \"cal-rack0\"",
  "MINIO_SITE_REGION": "اسم موقع الخادم، على سبيل المثال \"us-west-1\"",
  "MINIO_SITE_COMMENT": "إضافة تعليق اختياري لهذا الإعداد",
  "MINIO_STORAGE_CLASS_STANDARD": "تعيين عدد التكافؤ لفئة التخزين القياسية الافتراضية، على سبيل المثال \"EC:4\"",
  "MINIO_STORAGE_CLASS_RRS": "تعيين عدد التكافؤ لفئة التخزين ذات التكرار المنخفض (Reduced Redundancy Storage)، على سبيل المثال \"EC:2\"",
  "MINIO_ETCD_ENDPOINTS": "قائمة مفصولة بفواصل لنقاط نهاية etcd، على سبيل المثال \"http://localhost:2379\"",
  "MINIO_ETCD_PATH_PREFIX": "بادئة مساحة الاسم (namespace prefix) لعزل المستأجرين (tenants)، على سبيل المثال \"customer1/\"",
  "MINIO_API_REQUESTS_MAX": "تعيين الحد الأقصى لعدد الطلبات المتزامنة (القيمة الافتراضية: 'auto')",
  "MINIO_API_CLUSTER_DEADLINE": "تعيين الموعد النهائي لفحص جاهزية التكتل (cluster readiness check) (القيمة الافتراضية: '10s')",
  "MINIO_API_CORS_ALLOW_ORIGIN": "تعيين قائمة مفصولة بفواصل من الأصول المسموح بها لطلبات CORS (القيمة الافتراضية: '*')",
  "MINIO_API_REMOTE_TRANSPORT_DEADLINE": "تعيين الموعد النهائي لطلبات API على عمليات النقل عن بُعد أثناء الوكالة (proxying) بين المُستخدمين الموحدين (federated instances)، على سبيل المثال \"2h\" (القيمة الافتراضية: '2h')",
  "MINIO_API_LIST_QUORUM": "تعيين النصاب المقبول المتوقع لعمليات الإدراج (list operations)، على سبيل المثال \"optimal\"، \"reduced\"، \"disk\"، \"strict\"، \"auto\" (القيمة الافتراضية: 'strict')",
  "MINIO_API_REPLICATION_PRIORITY": "تعيين أولوية النسخ المتماثل (replication priority) (القيمة الافتراضية: 'auto')",
  "MINIO_API_REPLICATION_MAX_WORKERS": "تعيين الحد الأقصى لعدد عمال النسخ المتماثل (القيمة الافتراضية: '500')",
  "MINIO_API_TRANSITION_WORKERS": "تعيين عدد عمال الانتقال (transition workers) (القيمة الافتراضية: '100')",
  "MINIO_API_STALE_UPLOADS_EXPIRY": "التعيين لانتهاء صلاحية عمليات تحميل الأجزاء المتعددة (multipart uploads) القديمة التي مضى عليها وقت أطول من هذه القيمة (القيمة الافتراضية: '24h')",
  "MINIO_API_STALE_UPLOADS_CLEANUP_INTERVAL": "التعيين لتغيير الفواصل الزمنية التي تنتهي عندها صلاحية عمليات تحميل الأجزاء المتعددة القديمة (القيمة الافتراضية: '6h')",
  "MINIO_API_DELETE_CLEANUP_INTERVAL": "التعيين لتغيير الفواصل الزمنية التي يتم فيها حذف الكائنات المحذوفة بشكل دائم من مجلد \".trash\" (القيمة الافتراضية: '5m')",
  "MINIO_API_ODIRECT": "التعيين لتمكين أو تعطيل O_DIRECT لعمليات الكتابة في ظل ظروف خاصة. ملاحظة: لا تقم بتعطيل O_DIRECT دون اختبار مسبق (القيمة الافتراضية: 'on')",
  "MINIO_API_ROOT_ACCESS": "قم بإيقاف تشغيل ('off') الوصول ببيانات اعتماد الجذر لجميع استدعاءات API، بما في ذلك عمليات s3 وعمليات المسؤول (admin) (القيمة الافتراضية: 'on')",
  "MINIO_API_SYNC_EVENTS": "التعيين لتمكين إشعارات السلة المتزامنة (synchronous bucket notifications) (القيمة الافتراضية: 'off')",
  "MINIO_API_OBJECT_MAX_VERSIONS": "تعيين الحد الأقصى لعدد الإصدارات المسموح بها لكل كائن (القيمة الافتراضية: '9223372036854775807')",
  "MINIO_BROWSER": "تمكين أو تعطيل الوصول إلى واجهة الويب الخاصة بوحدة التحكم (console web UI). الإعداد الافتراضي هو 'on'",
  "MINIO_DOMAIN": "تمكين طلبات نمط المضيف الافتراضي (virtual-host-style requests)، على سبيل المثال \"mydomain.com\" أو نطاقات متعددة بقيم مفصولة بفواصل، على سبيل المثال \"sub1.mydomain.com,sub2.mydomain.com\""
}
