{
  "MP_DATABASE": "Kalıcı verileri depolamak için yerel veritabanı dosyasını belirtin. Varsayılan olarak geçici bir yerel dosya kullanılır ve Mailpit kapandığında otomatik olarak silinir. İsteğe bağlı olarak bir 'http adresi' belirterek uzak bir rqlite veritabanı da kullanılabilir (belgelere bakın).",
  "MP_LABEL": "Bu Mailpit örneğini tanımlamak için isteğe bağlı bir etiket belirleyin. Bu etiket web arayüzüne, SMTP ve POP3 sunucularına eklenir.",
  "MP_TENANT_ID": "Bir tenant ID (tablo ön eki) belirleyin. Aynı veri dosyasını paylaşan diğer Mailpit örneklerinden verileri izole etmek için kullanılır (belgelere bakın).",
  "MP_MAX_MESSAGES": "Saklanacak maksimum mesaj sayısı. Mailpit, bu sayıyı aşarsa en eski mesajları periyodik olarak siler. Otomatik silmeyi devre dışı bırakmak için 0 olarak ayarlayın (belgelere bakın).",
  "MP_MAX_AGE": "Mesajların saklanabileceği maksimum yaş (saat veya gün cinsinden). Aşılırsa en eski mesajlar silinir. Değer saat olarak (örneğin: --max-age 36h) veya gün olarak (örneğin: --max-age 14d) belirtilmelidir (belgelere bakın).",
  "MP_USE_MESSAGE_DATES": "Mailpit’in alım tarihi olarak SMTP tarafından alınan tarih yerine mesaj başlığındaki tarihi kullan.",
  "MP_IGNORE_DUPLICATE_IDS": "Message-ID'ye göre yinelenen mesajları yoksay.",
  "MP_LOG_FILE": "Mailpit çıktısını stdout yerine bir dosyaya kaydet. Örnek: --log-file /yol/kayit.log",
  "MP_QUIET": "Sessiz kayıt (sadece hatalar)",
  "MP_VERBOSE": "Ayrıntılı kayıt (debug)",
  "MP_UI_BIND_ADDR": "Web arayüzü için HTTP bağlanma arayüzü ve portu.",
  "MP_WEBROOT": "Web UI ve API için kök yolu belirleyin, örneğin 'mail' kullanılırsa adres şu olur: http://0.0.0.0:8025/mail/",
  "MP_UI_AUTH_FILE": "Web UI ve API için temel kimlik doğrulama dosyası belirtin (belgelere bakın).",
  "MP_UI_TLS_CERT": "Web UI & API için TLS sertifikası (HTTPS). Bu seçeneğin çalışması için --ui-tls-key veya MP_UI_TLS_KEY değişkeninin de ayarlanması gerekir.",
  "MP_UI_TLS_KEY": "Web UI & API için TLS anahtarı (HTTPS). Bu seçeneğin çalışması için --ui-tls-cert veya MP_UI_TLS_CERT değişkeninin de ayarlanması gerekir.",
  "MP_API_CORS": "Tarayıcılar arası istek gerekiyorsa API için CORS Access-Control-Allow-Origin başlığını ayarlayın.",
  "MP_BLOCK_REMOTE_CSS_AND_FONTS": "Mesaj stilleriyle içe aktarılan uzaktaki CSS ve yazı tiplerine tarayıcı erişimini engelle. Mailpit bunu HTTP CSP yöntemi ile yapar. Bu ayar uzaktaki görselleri veya bağlantı tıklamalarını engellemez.",
  "MP_ENABLE_SPAMASSASSIN": "Mesajların spam puanlaması için SpamAssassin entegrasyonunu etkinleştir (belgelere bakın).",
  "MP_ALLOW_UNTRUSTED_TLS": "Bağlantı denetleyici ve ekran görüntüsü oluşturma işlemlerinde HTTPS sertifikalarını doğrulama.",
  "MP_SMTP_BIND_ADDR": "SMTP bağlanma arayüzü ve portu.",
  "MP_SMTP_AUTH_FILE": "SMTP kimlik doğrulaması için parola dosyası belirtin (belgelere bakın).",
  "MP_SMTP_AUTH_ACCEPT_ANY": "Her türlü SMTP kullanıcı adı ve parolasını (veya hiç girmemeyi) kabul et. Temel olarak tüm bağlantılara izin vermek için kullanılır.",
  "MP_SMTP_TLS_CERT": "SMTP STARTTLS için TLS sertifikası. Bu seçeneğin çalışması için --smtp-tls-key veya MP_SMTP_TLS_KEY ayarlanmalıdır.",
  "MP_SMTP_TLS_KEY": "SMTP STARTTLS için TLS anahtarı. Bu seçeneğin çalışması için --smtp-tls-cert veya MP_SMTP_TLS_CERT ayarlanmalıdır.",
  "MP_SMTP_REQUIRE_STARTTLS": "Tüm SMTP istemcilerinin STARTTLS şifrelemesi kullanmasını zorunlu kıl. 'true' olarak ayarlanırsa bağlantı STARTTLS’ye yükseltilene kadar yalnızca NOOP, EHLO, STARTTLS ve QUIT komutlarına izin verilir (RFC 4954'e göre).",
  "MP_SMTP_REQUIRE_TLS": "Tüm SMTP istemcilerinin doğrudan SSL/TLS bağlantısı kurmasını zorunlu kıl. Bu, STARTTLS’den farklı olarak ilk bağlantının şifreli olmasını gerektirir. Bu seçenek STARTTLS’yi devre dışı bırakır ve istemci uyumluluğunu azaltabilir.",
  "MP_SMTP_AUTH_ALLOW_INSECURE": "Genelde SMTP kimlik doğrulaması için STARTTLS veya TLS zorunludur. Bu seçenek, STARTTLS kullanılırken güvensiz PLAIN & LOGIN yöntemlerine izin verir.",
  "MP_SMTP_STRICT_RFC_HEADERS": "Mesaj başlıkları \\n içeriyorsa (doğrusu \\r\\n olmalı) SMTP hatası döndür. Varsayılan olarak Mailpit bu hatayı sessizce düzeltir (bozuk sendmail istemcilerinden kaynaklanan yaygın bir sorun).",
  "MP_SMTP_MAX_RECIPIENTS": "Mesaj başına izin verilen maksimum SMTP alıcısı sayısı.",
  "MP_SMTP_ALLOWED_RECIPIENTS": "Yalnızca belirli bir regex ile eşleşen SMTP alıcılarına izin ver. Örn: --smtp-allowed-recipients '@example.com$' sadece example.com’a gidenleri kabul eder.",
  "MP_SMTP_DISABLE_RDNS": "SMTP ters DNS çözümlemeyi devre dışı bırak. Varsayılan olarak Mailpit istemci IP adresinin ana bilgisayar adını çözmeye çalışır, ancak bu bazı test ağlarında gecikmelere neden olabilir.",
  "MP_SMTP_RELAY_CONFIG": "Mesaj yönlendirme/serbest bırakma özelliğini etkinleştirmek için SMTP yapılandırma dosyası (belgelere bakın). Alternatif olarak tüm yapılandırmalar ortam değişkenleri ile iletilebilir.",
  "MP_SMTP_RELAY_ALL": "Tüm gelen mesajları harici SMTP sunucusu üzerinden otomatik olarak yönlendir. Çok dikkatli kullanın! (belgelere bakın).",
  "MP_SMTP_RELAY_MATCHING": "Yalnızca belirli alıcılarla eşleşen mesajları otomatik olarak harici SMTP sunucusu üzerinden yönlendir (belgelere bakın).",
  "MP_POP3_BIND_ADDR": "POP3 sunucu bağlanma arayüzü ve portu.",
  "MP_POP3_AUTH_FILE": "POP3 kimlik doğrulaması için parola dosyası belirtin (belgelere bakın).",
  "MP_POP3_TLS_CERT": "POP3 SSL/TLS için TLS sertifikası. Bu seçeneğin çalışması için --pop3-tls-key veya MP_POP3_TLS_KEY ayarlanmalıdır.",
  "MP_POP3_TLS_KEY": "POP3 SSL/TLS için TLS anahtarı. Bu seçeneğin çalışması için --pop3-tls-cert veya MP_POP3_TLS_CERT ayarlanmalıdır.",
  "MP_TAG": "Filtrelerle eşleşen yeni mesajlara otomatik etiketleme uygula (belgelere bakın).",
  "MP_TAGS_CONFIG": "Etiket filtrelerini yaml yapılandırma dosyasından yükle (belgelere bakın).",
  "MP_TAGS_TITLE_CASE": "Yeni oluşturulan tüm etiketlere Baş Harfleri Büyük yapısı uygula (belgelere bakın).",
  "MP_TAGS_DISABLE": "Belirli otomatik etiketlemeleri devre dışı bırak. Virgülle ayrılmış liste olarak girilir (belgelere bakın).",
  "MP_WEBHOOK_URL": "Yeni mesaj alındığında bir webhook çağır (belgelere bakın), örn: --webhook-url https://example.com/webhook.php",
  "MP_WEBHOOK_LIMIT": "Webhook istekleri için saniyelik hız sınırı. Webhook sunucusunun aşırı yüklenmesini önlemek için varsayılan olarak saniyede 1 istek sınırı uygulanır (belgelere bakın)."
}
