{
  "MP_DATABASE": "Kalıcı verileri saklamak için yerel veritabanı dosyasını belirtin. Varsayılan olarak Mailpit kapandığında otomatik silinen geçici bir dosya kullanılır. Alternatif olarak, belgelerde belirtilen bir 'http adresi' ile uzaktaki bir rqlite veritabanı kullanılabilir.",
  "MP_LABEL": "Bu Mailpit örneğini tanımlamak için isteğe bağlı bir etiket ayarlayın. Bu etiket, web arayüzü, SMTP ve POP3 sunucularına eklenir.",
  "MP_TENANT_ID": "Tenant ID (tablo ön eki) ayarlayın. Aynı veri dosyasını paylaşan diğer Mailpit örneklerinden verileri izole etmek için kullanılır (bkz. belgeler).",
  "MP_MAX_MESSAGES": "Saklanacak maksimum mesaj sayısı. Bu sayı aşıldığında Mailpit en eski mesajları periyodik olarak siler. Otomatik silmeyi devre dışı bırakmak için 0 olarak ayarlayın (bkz. belgeler).",
  "MP_MAX_AGE": "Mesajların saklanacağı maksimum süre. Saat (örnek: 36h) veya gün (örnek: 14d) cinsinden olmalıdır. Belirtilen süreden daha eski mesajlar silinir (bkz. belgeler).",
  "MP_USE_MESSAGE_DATES": "SMTP ile alınan tarih/saat yerine mesaj başlığındaki tarih/saat bilgisini kullan.",
  "MP_IGNORE_DUPLICATE_IDS": "Message-Id değerine göre yinelenen mesajları yoksay.",
  "MP_LOG_FILE": "Mailpit çıktısını stdout yerine belirtilen dosyaya kaydet. Örnek: --log-file /yol/logdosyasi.log",
  "MP_QUIET": "Sessiz kayıt (sadece hatalar)",
  "MP_VERBOSE": "Ayrıntılı günlükleme (debug)",
  "MP_UI_BIND_ADDR": "Web arayüzü için HTTP bağlantı arayüzü ve port.",
  "MP_WEBROOT": "Web arayüzü ve API için kök dizini ayarlayın. Örneğin mail olarak ayarlandığında http://0.0.0.0:8025/mail/ olur.",
  "MP_UI_AUTH_FILE": "Web arayüzü ve API için temel kimlik doğrulama şifresi dosyasını belirtin (bkz. belgeler).",
  "MP_UI_TLS_CERT": "Web arayüzü ve API için TLS sertifikası. Bu seçenek, --ui-tls-key bağımsız değişkeninin veya MP_UI_TLS_KEY ortam değişkeninin ayarlanmasını gerektirir.",
  "MP_UI_TLS_KEY": "Web arayüzü ve API için TLS anahtarı. Bu seçenek, --ui-tls-cert bağımsız değişkeninin veya MP_UI_TLS_CERT ortam değişkeninin ayarlanmasını gerektirir.",
  "MP_API_CORS": "Çapraz alan tarayıcı isteklerine izin vermek istiyorsanız, API için Access-Control-Allow-Origin başlığını ayarlayın.",
  "MP_BLOCK_REMOTE_CSS_AND_FONTS": "Mesaj stil sayfaları üzerinden yüklenen uzak CSS ve fontlara tarayıcı erişimini engelle. Mailpit bu işlemi HTTP İçerik Güvenliği Politikası (CSP) ile gerçekleştirir. Uzak resimler ve dış bağlantılar engellenmez.",
  "MP_ENABLE_SPAMASSASSIN": "Mesajların spam skoru için SpamAssassin entegrasyonunu etkinleştir (bkz. belgeler).",
  "MP_ALLOW_UNTRUSTED_TLS": "Bağlantı denetleyici ve ekran görüntüsü oluşturma işlemleri için HTTPS sertifikalarının doğrulanmasını devre dışı bırak.",
  "MP_SMTP_BIND_ADDR": "SMTP için bağlantı arayüzü ve port.",
  "MP_SMTP_AUTH_FILE": "SMTP kimlik doğrulama için şifre dosyasını belirtin (bkz. belgeler).",
  "MP_SMTP_AUTH_ACCEPT_ANY": "Herhangi bir SMTP kullanıcı adı ve şifresini kabul et (boş dahil). Her şeyi kabul etmek için kullanılır.",
  "MP_SMTP_TLS_CERT": "SMTP STARTTLS için TLS sertifikası. Bu seçenek --smtp-tls-key bağımsız değişkenini veya MP_SMTP_TLS_KEY ortam değişkenini gerektirir.",
  "MP_SMTP_TLS_KEY": "SMTP STARTTLS için TLS anahtarı. Bu seçenek --smtp-tls-cert bağımsız değişkenini veya MP_SMTP_TLS_CERT ortam değişkenini gerektirir.",
  "MP_SMTP_REQUIRE_STARTTLS": "Tüm SMTP istemcilerinin STARTTLS şifrelemesini kullanmasını zorunlu kıl. true olarak ayarlandığında yalnızca NOOP, EHLO, STARTTLS ve QUIT komutlarına izin verilir.",
  "MP_SMTP_REQUIRE_TLS": "Tüm SMTP istemcilerinin SSL/TLS kullanmasını zorunlu kıl. Bu ayar, STARTTLS'yi devre dışı bırakır ve istemci uyumluluğunu azaltabilir.",
  "MP_SMTP_AUTH_ALLOW_INSECURE": "Genellikle tüm SMTP kimlik doğrulamaları için STARTTLS veya TLS zorunludur. Bu seçenek, PLAIN ve LOGIN gibi güvensiz kimlik doğrulamalarına izin verir.",
  "MP_SMTP_STRICT_RFC_HEADERS": "Mesaj başlıkları \\n içerdiğinde SMTP hatası döndür. Varsayılan olarak Mailpit bozuk satır sonlarını otomatik olarak düzeltir.",
  "MP_SMTP_MAX_RECIPIENTS": "Mesaj başına izin verilen maksimum SMTP alıcısı sayısı.",
  "MP_SMTP_ALLOWED_RECIPIENTS": "Yalnızca belirli desenle eşleşen SMTP alıcılarına izin ver. Örnek: --smtp-allowed-recipients '@example.com$'",
  "MP_SMTP_DISABLE_RDNS": "SMTP ters DNS sorgularını devre dışı bırak.",
  "MP_SMTP_RELAY_CONFIG": "Mesaj yönlendirme/salımı etkinleştirmek için SMTP yapılandırma dosyası.",
  "MP_SMTP_RELAY_ALL": "Tüm gelen mesajları harici SMTP sunucusu üzerinden otomatik olarak yönlendir. Çok dikkatli kullanılmalıdır!",
  "MP_SMTP_RELAY_MATCHING": "Eşleşen alıcılara gelen bazı mesajları harici SMTP üzerinden yönlendir.",
  "MP_POP3_BIND_ADDR": "POP3 sunucusu için bağlantı arayüzü ve port.",
  "MP_POP3_AUTH_FILE": "POP3 kimlik doğrulama için şifre dosyasını belirtin (bkz. belgeler).",
  "MP_POP3_TLS_CERT": "POP3 SSL/TLS için TLS sertifikası. Bu seçenek --pop3-tls-key veya MP_POP3_TLS_KEY ortam değişkenini gerektirir.",
  "MP_POP3_TLS_KEY": "POP3 SSL/TLS için TLS anahtarı. Bu seçenek --pop3-tls-cert veya MP_POP3_TLS_CERT ortam değişkenini gerektirir.",
  "MP_TAG": "Filtrelere uyan yeni mesajlara otomatik etiket ekle (bkz. belgeler).",
  "MP_TAGS_CONFIG": "Etiket filtrelerini yaml yapılandırma dosyasından yükle (bkz. belgeler).",
  "MP_TAGS_TITLE_CASE": "Yeni oluşturulan tüm etiketlerde BaşlıkBiçimini zorunlu kıl.",
  "MP_TAGS_DISABLE": "Belirli otomatik etiketlemeleri devre dışı bırak. Virgülle ayrılmış liste alır.",
  "MP_WEBHOOK_URL": "Yeni mesaj alındığında webhook çağır (bkz. belgeler). Örnek: --webhook-url https://example.com/webhook.php",
  "MP_WEBHOOK_LIMIT": "Webhook isteklerini saniyede sınırla. Sunucunun aşırı yüklenmesini önlemek için varsayılan olarak saniyede 1 isteğe sınırlandırılmıştır."
}
