{
  "MP_DATABASE": "Zadejte název lokálního databázového souboru pro ukládání trvalých dat. Výchozí hodnota je místní dočasný soubor, který je automaticky odstraněn při ukončení poštovního pitu. Volitelně můžete použít vzdálenou databázi rqlite zadáním „http adresy“ (viz dokumenty).",
  "MP_LABEL": "Nastavte volitelný štítek pro identifikaci této instance mailpit. Toto přidá štítek k webovému uživatelskému rozhraní, SMTP a POP3.",
  "MP_TENANT_ID": "Nastavte ID nájemce (předponu tabulky). Používá se k izolaci dat z jiných instancí Mailpit, které sdílejí stejný datový soubor (viz dokumenty).",
  "MP_MAX_MESSAGES": "Maximální počet zpráv k uložení. Poštovní pit pravidelně smaže nejstarší zprávy, pokud jsou větší. Nastavte 0 pro vypnutí automatického mazání (viz dokumenty).",
  "MP_MAX_AGE": "Maximální stáří zpráv, které se mají ukládat buď v (h)našich nebo d)ayech. Poštovní pit pravidelně smaže nejstarší zprávy, pokud jsou větší. Hodnota musí být buď v hodinách (Example: --max-age 36h) nebo dnech (Example: --max-age 14d) (viz dokumenty).",
  "MP_USE_MESSAGE_DATES": "Použít datum a čas obdržení zprávy v záhlaví zprávy jako datum a čas obdržení SMTP.",
  "MP_IGNORE_DUPLICATE_IDS": "Ignorovat duplicitní zprávy založené na Id zpráv.",
  "MP_LOG_FILE": "Zaznamenat poštovní pit výstup do souboru namísto stdout. Příklad: --log-file /path/to/logfile.log",
  "MP_QUIET": "Tiché logování (pouze chyby)",
  "MP_VERBOSE": "Podrobné protokolování (ladění)",
  "MP_UI_BIND_ADDR": "HTTP vazba rozhraní a port pro UI.",
  "MP_WEBROOT": "Nastavte webroot pro webové uživatelské rozhraní a API, například mail by měl za následek http://0.0.0.0:8025/mail/.",
  "MP_UI_AUTH_FILE": "Zadejte soubor s heslem pro základní ověření webového UI & API (viz dokumenty).",
  "MP_UI_TLS_CERT": "TLS certifikát pro web UI & API (ie: HTTPS). Tato volba vyžaduje nastavení parametru --ui-tls-key nebo MP_UI_TLS_KEY proměnné prostředí.",
  "MP_UI_TLS_KEY": "TLS klíč pro web UI & API (ie: HTTPS). Tato volba vyžaduje nastavení --ui-tls-cert argumentu nebo MP_UI_TLS_CERT proměnné prostředí.",
  "MP_API_CORS": "Nastavte záhlaví API CORS Access-Control-Allow-Origin, pokud potřebujete požadavky napříč doménami.",
  "MP_BLOCK_REMOTE_CSS_AND_FONTS": "Blokovat přístup prohlížeče ke vzdáleným CSS a fontům importovaným přes styly zpráv. Poštovní pit používá metodu HTTP Content Security Policy (CSP) k blokování tohoto obsahu. Toto neblokuje vzdálené obrázky ani nekliká na externí odkaz.",
  "MP_ENABLE_SPAMASSASSIN": "Povolit integraci SpamAssassin pro skóre spamminess zpráv (viz dokumenty).",
  "MP_ALLOW_UNTRUSTED_TLS": "Neověřujte HTTPS certifikáty pro vytváření odkazů a snímků obrazovky.",
  "MP_SMTP_BIND_ADDR": "SMTP vazba rozhraní a port.",
  "MP_SMTP_AUTH_FILE": "Zadejte soubor s heslem pro SMTP ověření (viz dokumenty).",
  "MP_SMTP_AUTH_ACCEPT_ANY": "Přijmout jakékoli SMTP uživatelské jméno a heslo, včetně žádné. Použijte to pro povolení čehokoliv.",
  "MP_SMTP_TLS_CERT": "TLS certifikát pro SMTP STARTTLS. Tato volba vyžaduje, aby byl nastaven parametr --smtp-tls-key nebo MP_SMTP_TLS_KEY prostředí.",
  "MP_SMTP_TLS_KEY": "TLS klíč pro SMTP STARTTLS. Tato volba vyžaduje, aby byl nastaven parametr --smtp-tls-cert nebo MP_SMTP_TLS_CERT prostředí.",
  "MP_SMTP_REQUIRE_STARTTLS": "Vyžaduje všechny SMTP klienty pro použití STARTTLS šifrování. Je-li nastaveno na hodnotu true, jedinými povolenými příkazy jsou NOOP, EHLO, STARTTLS a QUIT (specifikované v RFC 4954) do doby, než bude připojení aktualizováno na STARTTLS.",
  "MP_SMTP_REQUIRE_TLS": "Vyžaduje aby všechny SMTP klienty používaly SSL/TLS šifrování. Je-li nastaveno na hodnotu true, všechna připojení k SMTP serveru musí být zpracována přes TLS. Toto je jiné než STARTTLS, které vyžaduje, aby bylo počáteční připojení nešifrováno. Všimněte si, že tato možnost zakáže STARTTLS a může snížit kompatibilitu klienta.",
  "MP_SMTP_AUTH_ALLOW_INSECURE": "Obvykle je STARTTLS nebo TLS vynucen pro všechny SMTP ověřování. Tato volba umožňuje nezabezpečené PLAIN & LOGIN SMTP ověření při použití STARTTLS.",
  "MP_SMTP_STRICT_RFC_HEADERS": "Vynutit mailpit vrátit chybu SMTP, pokud záhlaví zprávy obsahují \\n místo \\r\\n přerušení řádků. Ve výchozím nastavení Mailpit tiše opraví nesprávné přerušení řádků generované některými rozbitými klienty sendmail (viz související GitHub problém).",
  "MP_SMTP_MAX_RECIPIENTS": "Maximální počet povolených SMTP příjemců na zprávu.",
  "MP_SMTP_ALLOWED_RECIPIENTS": "Povolit pouze SMTP příjemcům odpovídající regulárnímu výrazu. Použijte toto pro omezení příchozích e-mailů pouze na ty, kteří jsou odesláni do předem definovaného seznamu. Příkladem by byl --smtp-allowed-recipients '{'@'}example.com$' pro povolení e-mailů odesílaných příjemcům končícím na {'@'}example.com.",
  "MP_SMTP_DISABLE_RDNS": "Zakázat SMTP reverzní DNS vyhledávání. SMTP se ve výchozím nastavení pokusí vyřešit název hostitele IP adresy připojujícího klienta, Ve zkušebních sítích to však může být někdy problematické a způsobovat zpoždění pro každou doručenou zprávu.",
  "MP_SMTP_RELAY_CONFIG": "Konfigurační soubor SMTP, který umožňuje relay/release zpráv (viz dokumenty). Alternativně může být celá konfigurace předána přes proměnné prostředí.",
  "MP_SMTP_RELAY_ALL": "Automaticky přenášet všechny příchozí zprávy přes externí SMTP server (viz dokumenty). Používejte s extrémní opatrností!",
  "MP_SMTP_RELAY_MATCHING": "Automaticky přenechat některé příchozí zprávy příjemcům prostřednictvím externího SMTP serveru (viz dokumenty).",
  "MP_POP3_BIND_ADDR": "POP3 server sváže rozhraní a port.",
  "MP_POP3_AUTH_FILE": "Zadejte soubor s heslem pro autentizaci POP3 (viz dokumenty).",
  "MP_POP3_TLS_CERT": "TLS certifikát pro SSL/TLS. Tato volba vyžaduje nastavení parametru --pop3-tls-key nebo MP_POP3_TLS_KEY proměnné prostředí.",
  "MP_POP3_TLS_KEY": "TLS klíč pro POP3 SSL/TLS. Tato volba vyžaduje nastavení parametru --pop3-tls-cert nebo MP_POP3_TLS_CERT prostředí.",
  "MP_TAG": "Automaticky označit nové zprávy odpovídající filtrům (viz dokumenty).",
  "MP_TAGS_CONFIG": "Načíst filtry z konfiguračního souboru yaml (viz dokumenty).",
  "MP_TAGS_TITLE_CASE": "Vynutit TitleCasing pro všechny nově vytvořené tagy (viz dokumenty).",
  "MP_TAGS_DISABLE": "Zakázat určité automatické označování. Tato možnost obsahuje čárkou oddělený seznam možností (viz dokumenty).",
  "MP_WEBHOOK_URL": "Zavolat webhooku, když jsou přijímány nové zprávy (viz dokumenty). Příklad: --webhook-url https://example.com/webhook.php",
  "MP_WEBHOOK_LIMIT": "Sazba omezeného počtu žádostí o webhook za sekundu. Aby se zabránilo přetížení webhookových serverů, je tato rychlost ve výchozím nastavení omezena na maximálně 1 požadavek za sekundu (viz dokumenty)."
}
