{
  "working_dir": "Pracovní adresář",
  "db_path": "Označuje umístění, kde budou vytvořeny a načteny databázové soubory",
  "env": "Konfiguruje prostředí instance. Hodnota musí být buď `výroba` nebo `development`.",
  "http_addr": "Adresa, na které bude HTTP server naslouchat.",
  "master_key": "Nastaví hlavní klíč instance, automaticky ochraňuje všechny cesty kromě GET /zdraví.",
  "no_analytics": "Deaktivuje vestavěnou telemetrii Meilisearch, pokud je k dispozici.\nMeilis™ automaticky shromažďuje data ze všech instancí, které nepoužívají tuto vlajku.\nVšechna shromážděná data jsou použita výhradně pro zlepšení Meilisearch a mohou být kdykoli smazána.",
  "http_payload_size_limit": "Nastaví maximální velikost přijatého užitečného zatížení.",
  "log_level": "Určuje, kolik detailů by mělo být přítomno v Meilisearch.\nMeilis<unk> v současné době podporuje šest úrovní logů uvedených podle rostoucího slova: `OFF`, `ERROR`, `WARN`, `INFO`, `DEBUG`, `TRACE`",
  "max_indexing_memory": "Nastaví maximální množství RAM Meilis<unk> může být použito při indexování.",
  "max_indexing_threads": "Nastaví maximální počet vláken Meilis<unk> může být použit při indexování.",
  "dump_dir": "Nastaví adresář, kde bude vytvářet dump souborů.",
  "import_dump": "Importuje dump soubor umístěný na zadané cestě. Cesta musí odkazovat na soubor .dump.",
  "ignore_missing_dump": "Zabraňuje Meilis vhození chyby, když `import_dump` neukazuje na platný dump soubor.",
  "ignore_dump_if_db_exists": "Zabraňuje instanci, aby s existující databází vyhazovala chybu při použití `import_dump`.",
  "schedule_snapshot": "Povolí naplánované snímky, když je true, vypne při nepravdě (výchozí).\nJe-li hodnota dána jako celé číslo, pak v sekundách povolí plánovaný snímek s předanou hodnotou jako interval mezi jednotlivými snímky.",
  "snapshot_dir": "Nastaví adresář, kde bude Meilis<unk> ukládat snímky.",
  "import_snapshot": "Po importu dříve generovaného snímku na dané cestě k souboru.",
  "ignore_missing_snapshot": "Zabraňuje instanci, aby ve vyhazování chyby pokud `import_snapshot` neukazuje na platný soubor snapshot.",
  "ignore_snapshot_if_db_exists": "Zabraňuje instanci, která je existující databází, vyhazovat chybu při použití `import_snapshot`.",
  "ssl_auth_path": "Povolí ověření klienta v zadané cestě.",
  "ssl_cert_path": "Nastaví SSL certifikáty.",
  "ssl_key_path": "Nastaví soubory SSL klíče serveru.",
  "ssl_ocsp_path": "Nastaví soubor OCSP serveru.",
  "ssl_require_auth": "Učiní ověření SSL povinným.",
  "ssl_resumption": "Aktivuje SSL obnovení relace.",
  "ssl_tickets": "Aktivuje SSL tikety.",
  "experimental_enable_metrics": "Experimentální metrika. Umožňuje Prometheus metriku na koncovce `GET /metrics`.",
  "experimental_reduce_indexing_memory_usage": "Experimentální snížení RAM během indexace, nepoužívá se při výrobě.",
  "experimental_max_number_of_batched_tasks": "Experimentálně snižuje maximální počet úkolů, které budou zpracovány najednou."
}
